
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)      
	
	//ТипСтр = "ПеречислениеСсылка.СистемаНалогообложенияКонтрагента";
	мм1 = Новый Массив;
	ВН = Новый РеквизитФормы("СистемаНалогообложенияКонтрагента", Новый ОписаниеТипов("ПеречислениеСсылка.СистемаНалогообложенияКонтрагента"),"" , "Система налогообложения", Истина);
	СНДС = Новый РеквизитФормы("СтавкаНДС", Новый ОписаниеТипов("Число"),"", "Ставка НДС", Истина);
	мм1.Добавить(ВН);  
	мм1.Добавить(СНДС);

	ИзменитьРеквизиты(мм1); 
	
	
	Элемент = ЭтаФорма.Элементы.Добавить("СистемаНалогообложенияКонтрагента", Тип("ПолеФормы"), Этаформа.Элементы.ГруппаПериметр);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ВидНалогооблажения";	       
	
	Элемент = ЭтаФорма.Элементы.Добавить("СтавкаНДС", Тип("ПолеФормы"), Этаформа.Элементы.ГруппаПериметр);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.СтавкаНДС";	
	
	//Объект.СтавкаНДС = ЭтотОбъект.СтавкаНДС;
	//Объект.СистемаНалогообложенияКонтрагента = ЭтотОбъект.СистемаНалогообложенияКонтрагента;
КонецПроцедуры
