
&НаСервере
Процедура ТекстНаСервере()
	
	URLСервисаVeLab 		= "rtsapi.star-pro.ru";//"star-pro-proxy.gzdom.local:10080";
	TokenVelab 				= "Bearer 75f9a1b8f18b486db9d75f5eff944964";		
	ЗСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(URLСервисаVeLab,,,,,10,ЗСоединение);	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыСправочник.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК КонтрагентыСправочник
		|ГДЕ
		|	НЕ КонтрагентыСправочник.ПометкаУдаления
		//|	И КонтрагентыСправочник.Родитель = &Родитель
		|	И НЕ КонтрагентыСправочник.ЭтоГруппа
		|	И КонтрагентыСправочник.ВидНалогооблажения = ЗНАЧЕНИЕ(Перечисление.СистемаНалогообложенияКонтрагента.УСН)
		|	И КонтрагентыСправочник.ИНН <> """"";
	
	//Запрос.УстановитьПараметр("Родитель", Справочники.Контрагенты.НайтиПоКоду("00-000013")); 
	//Запрос.УстановитьПараметр("ИНН"		, "7719816961");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Система = Неопределено;	
		ИнтеграцияSatrPro.ОпределитьСистемуНалогооблаженияКонтрагента(ВыборкаДетальныеЗаписи.Ссылка,Система,HTTPСоединение,TokenVelab);
		
		Если Система = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОКонтрагент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ОКонтрагент.ВидНалогооблажения = Система;
		
		Если Система = Перечисления.СистемаНалогообложенияКонтрагента.ОСН Тогда
			
			ОКонтрагент.СтавкаНДС = 0.2;
		ИначеЕсли Система = Перечисления.СистемаНалогообложенияКонтрагента.УСН Тогда
			ОКонтрагент.СтавкаНДС = 0.07;
		КонецЕсли;
		
		ОКонтрагент.Записать();
		//сек = 15;
		//КонДата = ТекущаяДата() + сек;
		//Пока ТекущаяДата() < КонДата Цикл
		//	// ждемссс....
		//КонецЦикла;      
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	

	
КонецПроцедуры

&НаКлиенте
Процедура Текст(Команда)
	ТекстНаСервере();
КонецПроцедуры
