#Область СлужебныеПроцедурыИФункции           
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)   
	Если Параметры.Представление = "Проект" Или Параметры.Представление = "Организация" Тогда     
		РольДоступна = ОбщегоПользованияУХ.ЕстьРоль("АдминистраторСистемы",ПользователиКлиентСервер.ТекущийПользователь());    
		Если НЕ РольДоступна Тогда
			//Элементы.СписокДобавлениеУдаление.Доступность = Ложь;   
			Элементы.СписокПодбор.Доступность = Ложь;
			Элементы.СписокПодборПодвал.Доступность = Ложь; 
			Элементы.СписокДобавить.Доступность = Ложь;   
			Элементы.СписокДобавлениеУдалениеМеню.Доступность = Ложь;
			Элементы.СписокЗначение.ТолькоПросмотр = Истина;    
			Элементы.СписокВставитьИзБуфераОбмена.Доступность = Ложь;
			Элементы.СписокУдалить.Доступность = Ложь;   
			Элементы.ФормаИзменитьФорму.Доступность = Ложь;
		КонецЕсли;    
	КонецЕсли;
КонецПроцедуры
#КонецОбласти            
