
#Область ПрограммныйИнтерфейс
#Область ДляВызоваИзДругихПодсистем
// СтандартныеПодсистемы.ВариантыОтчетов
//Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
//	//НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
//КонецПроцедуры
//// Задать настройки формы отчета.
////
//// Параметры:
////   Форма - ФормаКлиентскогоПриложения
////         - Неопределено
////   КлючВарианта - Строка
////                - Неопределено
////   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
////
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт  
	Настройки.События.Вставить("ПриСозданииНаСервере", Истина);   	
	Настройки.События.Вставить("ПриЗагрузкеПользовательскихНастроекНаСервере", Истина);     	
КонецПроцедуры
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт     
	УстановитьПривилегированныйРежим(Истина);
	//Сообщить("1234");   
	РольДоступна = ОбщегоПользованияУХ.ЕстьРоль("АдминистраторСистемы",ПользователиКлиентСервер.ТекущийПользователь());    
	Если РольДоступна = Ложь Тогда
		ЭтаФорма.Элементы.ДругиеОтчеты.Доступность = Ложь;  	 
	КонецЕсли;     
	УстановитьПривилегированныйРежим(Ложь);         
КонецПроцедуры   
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеНастройкиКД) Экспорт   
	УстановитьПривилегированныйРежим(Истина);    	
		
	ВложенныеСхемы = ПолучениеСоотвествияВложенныхСхем();
    ВложенаяСхемаВариантОтчета = ВложенныеСхемы.Получить(Форма.КлючТекущегоВарианта);
	
 	РольДоступна = ОбщегоПользованияУХ.ЕстьРоль("АдминистраторСистемы",ПользователиКлиентСервер.ТекущийПользователь());    
	Если НЕ РольДоступна Тогда      
		
		Если НовыеНастройкиКД.ДополнительныеСвойства.Свойство("КэшЗначенийОтборов") Тогда
			СброситьПользовательскийКэшОтборов(НовыеНастройкиКД.ДополнительныеСвойства.КэшЗначенийОтборов);
		КонецЕсли;   
					
			ТаблицаПроектыОрганизации = ПолучениеДанныхПроектовПользователей(ПользователиКлиентСервер.ТекущийПользователь());	
			
			//{Воронков А.Д. 06.06.2025 ++  
			ТаблицаСоответствийПользовательскихОтборов = ПолучениеТаблицыСоответствийПользовательскихОтборов();	
			
			Для Каждого ЭлОтбора Из ТаблицаПроектыОрганизации Цикл 
				ИндексОтбора = ТаблицаСоответствийПользовательскихОтборов.Получить(ЭлОтбора.ИмяКолонки); 
				Если ИндексОтбора <> Неопределено Тогда
					Если ЭлОтбора.ИспользоватьОтбор Тогда         
						РежимОтображенияОтбора = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;			
					Иначе     
						РежимОтображенияОтбора = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
					КонецЕсли;      
					Если ВложенаяСхемаВариантОтчета <> Неопределено Тогда       									
						//ЭлементОтбора = КомпоновщикНастроек.Настройки.Структура[0].Настройки.Отбор.Элементы.Получить(ИндексОтбора-1);  
						ЭлементОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(ИндексОтбора);    					
					Иначе
						ЭлементОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(ИндексОтбора);   
					КонецЕсли;
					ЭлементОтбора.Использование = ЭлОтбора.ИспользоватьОтбор;   
					ЭлементОтбора.РежимОтображения = РежимОтображенияОтбора;    
					СписокЗначенийПредопредленный = Новый СписокЗначений;
					Для Каждого СтрОтбор Из ЭлОтбора.МассивЗначенийОтбора Цикл 
						СписокЗначенийПредопредленный.Добавить(СтрОтбор);
					КонецЦикла;   
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементОтбора,"ПравоеЗначение") Тогда
						ЭлементОтбора.ПравоеЗначение = СписокЗначенийПредопредленный;  
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;  
		//--}
	КонецЕсли;     
	
	//НовыеНастройкиКД = ЭтотОбъект.СхемаКомпоновкиДанных.ВариантыНастроек.Отчет1.Настройки;
	НовыеНастройкиКД = КомпоновщикНастроек.ПользовательскиеНастройки;  
	УстановитьПривилегированныйРежим(Ложь);     
	
	
КонецПроцедуры  
Функция УстановитьВидимостьПолей() 
	УстановитьПривилегированныйРежим(Истина);    		
 	РольДоступна = ОбщегоПользованияУХ.ЕстьРоль("АдминистраторСистемы",ПользователиКлиентСервер.ТекущийПользователь());    
	Если НЕ РольДоступна Тогда      				
		ТаблицаПроектыОрганизации = ПолучениеДанныхПроектовПользователей(ПользователиКлиентСервер.ТекущийПользователь());					
		//{Воронков А.Д. 06.06.2025 ++  
		ТаблицаСоответствийПользовательскихОтборов = ПолучениеТаблицыСоответствийПользовательскихОтборов();			
		Для Каждого ЭлОтбора Из ТаблицаПроектыОрганизации Цикл 
			ИндексОтбора = ТаблицаСоответствийПользовательскихОтборов.Получить(ЭлОтбора.ИмяКолонки); 
			Если ИндексОтбора <> Неопределено Тогда
				Если ЭлОтбора.ИспользоватьОтбор Тогда         
					РежимОтображенияОтбора = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;			
				Иначе     
					РежимОтображенияОтбора = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
				КонецЕсли;  
				ЭлементОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(ИндексОтбора);
				ЭлементОтбора.Использование = ЭлОтбора.ИспользоватьОтбор;   
				ЭлементОтбора.РежимОтображения = РежимОтображенияОтбора;    
				СписокЗначенийПредопредленный = Новый СписокЗначений;
				Для Каждого СтрОтбор Из ЭлОтбора.МассивЗначенийОтбора Цикл 
					СписокЗначенийПредопредленный.Добавить(СтрОтбор);
				КонецЦикла;   
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементОтбора,"ПравоеЗначение") Тогда
					ЭлементОтбора.ПравоеЗначение = СписокЗначенийПредопредленный;  
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//--}
	КонецЕсли;      
	УстановитьПривилегированныйРежим(Ложь);      
КонецФункции 
#КонецОбласти
#КонецОбласти

#Область Инициализация
Функция СведенияОВнешнейОбработке() Экспорт   
    ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
    Синоним = ЭтотОбъект.Метаданные().Синоним; 
    Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОтчета);         
    РегистрационныеДанные = Новый Структура;
    РегистрационныеДанные.Вставить("Вид","ДополнительныйОтчет"); 
    РегистрационныеДанные.Вставить("Наименование", Синоним); 
    РегистрационныеДанные.Вставить("Версия", "3.0");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
    РегистрационныеДанные.Вставить("Информация", "Отчет "+Синоним); 
    
    ТаблицаКоманд = ПолучитьТаблицуКоманд();
    ДобавитьКоманду(ТаблицаКоманд, Синоним, "СформироватьОтчет" , "ОткрытиеФормы", Истина, );
    РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
    
    Возврат РегистрационныеДанные;                                       
КонецФункции
Функция ПолучитьТаблицуКоманд()   
	Команды = Новый ТаблицаЗначений;	
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 	
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));	
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));	
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));		
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;   
КонецФункции
Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")  
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры 
#КонецОбласти     



#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)         
	УстановитьПривилегированныйРежим(Истина); 
	СтандартнаяОбработка = Ложь;  	
	
	ОбработатьФормированиеОтчета(ДокументРезультат, ДанныеРасшифровки);
	
	УстановитьПривилегированныйРежим(Ложь); 
	//УстановитьПривилегированныйРежим(Истина); 
	//СтандартнаяОбработка = Ложь;  	
	//ПризнакПроверки = Истина;  
	//ОрганизацииОтбора = Неопределено;	  
	//	
	//ВложенныеСхемы = ПолучениеСоотвествияВложенныхСхем();
	//ВложенаяСхемаВариантОтчета = ВложенныеСхемы.Получить(КомпоновщикНастроек.Настройки.ДополнительныеСвойства.КлючВарианта);
	//
	//Если ВложенаяСхемаВариантОтчета <> Неопределено Тогда		  
	//	НастройкиОтбора = ЭтотОбъект.КомпоновщикНастроек.Настройки.Структура[0].Настройки.Отбор.Элементы;	   		
	//Иначе
	//	НастройкиОтбора = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки().Отбор.Элементы;	
	//КонецЕсли;
	//
	//Для каждого ЭлементОтбора Из НастройкиОтбора Цикл
	//	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементОтбора,"ЛевоеЗначение") Тогда		
	//		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
	//			Идентификатор =     ЭлементОтбора.ИдентификаторПользовательскойНастройки;   
	//			Если ЭлементОтбора.ПравоеЗначение.Количество() = 0 Тогда  
	//				Прервать;            
	//			Иначе
	//				Если ЭлементОтбора.Использование Тогда
	//					ОрганизацииОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор).ПравоеЗначение; 
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;  
	//	КонецЕсли;
	//КонецЦикла;   
	//
	//СтруктураПериодаОтчета = ПолучитьПериодОтчета(КомпоновщикНастроек);
	//ДатаНачалаОтчета = СтруктураПериодаОтчета.ДатаНачала;
	//ДатаОкончанияОтчета = СтруктураПериодаОтчета.ДатаОкончания;
	//ЕстьПериодСверки = СтруктураПериодаОтчета.ЕстьПериодСверки;

	//ОбработатьСутиацииИсключения(ДатаНачалаОтчета,ДатаОкончанияОтчета,ЕстьПериодСверки);
	//
	//Попытка   
	//	
	//	Если ВложенаяСхемаВариантОтчета <> Неопределено Тогда  
	//		
	//		ТаблицаСоответствийПользовательскихОтборов = ПолучениеТаблицыСоответствийПользовательскихОтборов();
	//		Настройки = ЭтотОбъект.КомпоновщикНастроек.Настройки.Структура[0].Настройки;			
	//		Для Каждого ЭлОтбора Из Настройки.Отбор.Элементы Цикл   
	//			//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлОтбора,"ЛевоеЗначение") Тогда
	//			ИндексОтбора = ТаблицаСоответствийПользовательскихОтборов.Получить(Строка(ЭлОтбора.ЛевоеЗначение)); 
	//			Если ИндексОтбора <> Неопределено Тогда
	//				ТаблицаПроектыОрганизации = ПолучениеДанныхПроектовПользователей(ПользователиКлиентСервер.ТекущийПользователь());
	//			КонецЕсли;	
	//			
	//			Для Каждого СтрПроект Из ТаблицаПроектыОрганизации Цикл	  
	//				Если СтрПроект.ИмяКолонки = Строка(ЭлОтбора.ЛевоеЗначение) Тогда
	//					Если СтрПроект.ИспользоватьОтбор Тогда         
	//						РежимОтображенияОтбора = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;			
	//					Иначе     
	//						РежимОтображенияОтбора = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	//					КонецЕсли; 
	//					ЭлОтбора.Использование = СтрПроект.ИспользоватьОтбор;   
	//					ЭлОтбора.РежимОтображения = РежимОтображенияОтбора;  
	//					ЭлОтбора.ПравоеЗначение = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(ИндексОтбора).ПравоеЗначение;  
	//				КонецЕсли;
	//			КонецЦикла;					
	//		КонецЦикла;
	//		
	//		Для Каждого Парам Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл   
	//							
	//			Если Не Парам.Использование Или НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Парам,"Параметр") Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			ИмяПараметра = Строка(Парам.Параметр);
	//			
	//			Если ИмяПараметра = "Период" Тогда    
	//				ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);   
	//				
	//				ПараметрСКД.Значение = Парам.Значение;   					
	//			ИначеЕсли ИмяПараметра = "ПериодСверки" Тогда
	//				ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);  
	//				ПараметрСКД.Значение = Парам.Значение;					
	//			КонецЕсли; 
	//			
	//		КонецЦикла;						
	//	Иначе
	//		Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();	
	//	КонецЕсли;
	//	
	//	ПризнакПроверки = ПолучениеПризнакаПроверкиОбязательныхОтборов(ПризнакПроверки);
	//	Если ПризнакПроверки = Ложь Тогда
	//		Возврат; 
	//	КонецЕсли;		
	//	
	//	ПользовательскиеНастройки = Настройки;
	//		
	//	ОбрабатыватьКосвенные = ПолучениеПризнакаОбработкиКосвенных();       
	//	
	//	МассивПериодовОтчета = ОбщегоПользованияУХ.ПолучениеМесяцевВДиапазонеДат(ДатаНачалаОтчета,ДатаОкончанияОтчета);
	//	
	//	ДанныеЭО = ПолучениеДанныхЭкземпляровОтчета(ОрганизацииОтбора,ДатаНачалаОтчета,ДатаОкончанияОтчета,ОбрабатыватьКосвенные);  
	//	ТаблицаДанныхОтчета = СопоставлениеДанныхПланФакт(ДанныеЭО,ДатаНачалаОтчета,ДатаОкончанияОтчета,ОбрабатыватьКосвенные,ВложенаяСхемаВариантОтчета,МассивПериодовОтчета);   
	//	
	//	Если ЕстьПериодСверки Тогда
	//		ТаблицаДанныхОтчета = ДополнитьДаннымиПоФОТСотрудниковРуководителя(НачалоГода(ДатаОкончанияОтчета),ТаблицаДанныхОтчета);        
	//	Иначе
	//		ТаблицаДанныхОтчета = ДополнитьДаннымиПоФОТСотрудниковРуководителя(ДатаНачалаОтчета,ТаблицаДанныхОтчета); 	
	//	КонецЕсли;
	//
	//Исключение  
	//	ОписОшибки = ОписаниеОшибки(); 
	//	Сообщение = "Возникли ошибки при заполнении сводного отчета. Обратитесь к администраторам системы.";  
	//	ОбщегоНазначенияКлиентСерверУХ.СообщитьПользователю(Сообщение); 
	//КонецПопытки;
	//	
	//Если ТаблицаДанныхОтчета <> Неопределено Тогда   
	//	
	//			
	//	//Если ВложенаяСхемаВариантОтчета <> Неопределено Или КомпоновщикНастроек.Настройки.ДополнительныеСвойства.КлючВарианта = "Отчет Conso (Проект)" Тогда    
	//				
	//		Если ЕстьПериодСверки Тогда  
	//			
	//			ВложенаяСхемаВариантОтчета = ?(ВложенаяСхемаВариантОтчета = Неопределено,КомпоновщикНастроек.Настройки.ДополнительныеСвойства.КлючВарианта,ВложенаяСхемаВариантОтчета);
	//			
	//			// Получим вложенную схему с макетом для пользователя
	//			ВложеннаяСхемаИтогиПоГодам = ПолучитьСоответствиеВложеннойСхемыКОтчету(ВложенаяСхемаВариантОтчета);
	//			
	//			ВложеннаяСКД = СхемаКомпоновкиДанных.ВложенныеСхемыКомпоновкиДанных.Найти(ВложеннаяСхемаИтогиПоГодам);
	//			СхемаКД = ВложеннаяСКД.Схема;

	//			СравнитьДанныеКонсолидированногоОтчета(ТаблицаДанныхОтчета, ДатаНачалаОтчета, ДатаОкончанияОтчета);    
	//			
	//			Настройки = СхемаКД.ВариантыНастроек[0].Настройки;   	
	//			
	//			// Установим пользовательские отборы в настройки подменяемого макета
	//			УстановитьПользовательскиеОтборы(Настройки,ПользовательскиеНастройки);
	//			
	//			// Установим пользовательские параметры в настройки подменяемого макета
	//			УстановитьПользовательскиеПараметры(Настройки,ПользовательскиеНастройки);		
	//			
	//			// Установим пользовательские отборы и параметры
	//			//УстановитьПользовательскиеОтборыПараметры(Настройки,КомпоновщикНастроек)
	//			
	//		Иначе 
	//			Если ВложенаяСхемаВариантОтчета <> Неопределено Тогда
	//				ВложеннаяСКД = СхемаКомпоновкиДанных.ВложенныеСхемыКомпоновкиДанных.Найти(ВложенаяСхемаВариантОтчета);    
	//				СхемаКД = ВложеннаяСКД.Схема;		
	//			Иначе     
	//				СхемаКД = ПолучитьМакет("СхемаКомпоновкиДанных_СводныйОтчет");	
	//			КонецЕсли;
	//		КонецЕсли;	
	//		
	//	//Иначе   
	//	//	СхемаКД = ПолучитьМакет("СхемаКомпоновкиДанных_СводныйОтчет"); 
	//	//КонецЕсли;
	//	  	
	//	ВывестиРезультатВыполненияВТабличныйДокумент(СхемаКД,Настройки,ДанныеРасшифровки,ТаблицаДанныхОтчета,ДокументРезультат)
	//			
	//КонецЕсли;
	//
	//УстановитьПривилегированныйРежим(Ложь); 

КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Процедура ОбработатьФормированиеОтчета(ДокументРезультат, ДанныеРасшифровки)
	
	ПризнакПроверки = Истина;  
	ОрганизацииОтбора = Неопределено;	  
	
	// Получение схемы варианта отчета
	ВложенаяСхемаВариантОтчета = ПолучитьВложеннуюСхемуВариантаОтчета();
	
	// Получение настроек отбора
	НастройкиОтбора = ПолучитьНастройкиОтбора(ВложенаяСхемаВариантОтчета);
	
	// Обработка отбора по организациям
	ОрганизацииОтбора = ОбработатьОтборПоОрганизациям(НастройкиОтбора);
	
	// Получение периода отчета
	СтруктураПериодаОтчета = ПолучитьПериодОтчета(КомпоновщикНастроек);
	
	ПользовательскиеНастройки = ОбработатьПользовательскиеНастройки(ВложенаяСхемаВариантОтчета);
	
	// Проверка исключительных ситуаций
	ОбработатьСутиацииИсключения(СтруктураПериодаОтчета);
	
	// Основная обработка данных отчета
	ТаблицаДанныхОтчета = СформироватьДанныеОтчета(ВложенаяСхемаВариантОтчета, СтруктураПериодаОтчета,
		ОрганизацииОтбора, ПризнакПроверки, ПользовательскиеНастройки);
	
	// Вывод результата
	Если ТаблицаДанныхОтчета <> Неопределено Тогда
		ВывестиРезультатВДокумент(ТаблицаДанныхОтчета, ДокументРезультат, ДанныеРасшифровки, 
			ВложенаяСхемаВариантОтчета, СтруктураПериодаОтчета, ПользовательскиеНастройки);
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьВложеннуюСхемуВариантаОтчета()
	
	ВложенныеСхемы = ПолучениеСоотвествияВложенныхСхем();
	ВложенаяСхемаВариантОтчета = ВложенныеСхемы.Получить(КомпоновщикНастроек.Настройки.ДополнительныеСвойства.КлючВарианта);
	
	Возврат ВложенаяСхемаВариантОтчета;
	
КонецФункции  

Функция ПолучитьНастройкиОтбора(ВложенаяСхемаВариантОтчета)
	
	Если ВложенаяСхемаВариантОтчета <> Неопределено Тогда		  
		НастройкиОтбора = ЭтотОбъект.КомпоновщикНастроек.Настройки.Структура[0].Настройки.Отбор.Элементы;	   		
	Иначе
		НастройкиОтбора = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки().Отбор.Элементы;	
	КонецЕсли;
	
	Возврат НастройкиОтбора;
	
КонецФункции    

Функция ОбработатьОтборПоОрганизациям(НастройкиОтбора)
	
	ОрганизацииОтбора = Неопределено;
	
	Для каждого ЭлементОтбора Из НастройкиОтбора Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементОтбора,"ЛевоеЗначение") Тогда		
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
				Идентификатор = ЭлементОтбора.ИдентификаторПользовательскойНастройки;   
				Если ЭлементОтбора.ПравоеЗначение.Количество() = 0 Тогда  
					Прервать;            
				Иначе
					Если ЭлементОтбора.Использование Тогда
						ОрганизацииОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор).ПравоеЗначение; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОрганизацииОтбора;
	
КонецФункции     

Функция СформироватьДанныеОтчета(ВложенаяСхемаВариантОтчета, СтруктураПериодаОтчета,
			ОрганизацииОтбора, ПризнакПроверки, ПользовательскиеНастройки)
			
	ДатаНачалаОтчета = СтруктураПериодаОтчета.ДатаНачала; 
	ДатаОкончанияОтчета = СтруктураПериодаОтчета.ДатаОкончания;   
	ЕстьПериодСверки = СтруктураПериодаОтчета.ЕстьПериодСверки;
	Попытка   
				
		ПризнакПроверки = ПолучениеПризнакаПроверкиОбязательныхОтборов(ПризнакПроверки);
		Если ПризнакПроверки = Ложь Тогда
			Возврат Неопределено; 
		КонецЕсли;	
		
		ТаблицаОтборовПользователей = ПолучитьПользовательскиеОтборы(ПользовательскиеНастройки);
					
		ОбрабатыватьКосвенные = ПолучениеПризнакаОбработкиКосвенных();       
		
		МассивПериодовОтчета = ОбщегоПользованияУХ.ПолучениеМесяцевВДиапазонеДат(ДатаНачалаОтчета,ДатаОкончанияОтчета);
		
		ДанныеЭО = ПолучениеДанныхЭкземпляровОтчета(ОрганизацииОтбора,ДатаНачалаОтчета,ДатаОкончанияОтчета,ОбрабатыватьКосвенные,ТаблицаОтборовПользователей);  
		ТаблицаДанныхОтчета = СопоставлениеДанныхПланФакт(ДанныеЭО,ДатаНачалаОтчета,ДатаОкончанияОтчета,ОбрабатыватьКосвенные,ВложенаяСхемаВариантОтчета,МассивПериодовОтчета);   
		
		Если НЕ РольДоступна("ПолныеПрава") Тогда		
			Если ЕстьПериодСверки Тогда
				ТаблицаДанныхОтчета = ДополнитьДаннымиПоФОТСотрудниковРуководителя(НачалоГода(ДатаОкончанияОтчета),ТаблицаДанныхОтчета);        
			Иначе
				ТаблицаДанныхОтчета = ДополнитьДаннымиПоФОТСотрудниковРуководителя(ДатаНачалаОтчета,ТаблицаДанныхОтчета); 	
			КонецЕсли; 
		КонецЕсли;
		
		Возврат ТаблицаДанныхОтчета;
	
	Исключение  
		ОписОшибки = ОписаниеОшибки(); 
		Сообщение = "Возникли ошибки при заполнении сводного отчета. Обратитесь к администраторам системы.";  
		ОбщегоНазначенияКлиентСерверУХ.СообщитьПользователю(Сообщение); 
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции 

Функция ПолучитьПользовательскиеОтборы(ПользовательскиеНастройки)  
	
	МассивИспользуемыхОтборов = Новый Массив;
	МассивИспользуемыхОтборов.Добавить("СтатьяЗатрат");
	МассивИспользуемыхОтборов.Добавить("СтатьяДоходовРасходов");
    МассивИспользуемыхОтборов.Добавить("НазначениеПлатежа");
	
	ТаблицаОтборовПользователей = Новый ТаблицаЗначений;
	ТаблицаОтборовПользователей.Колонки.Добавить("ОтборПо",Новый ОписаниеТипов("Строка"));
	ТаблицаОтборовПользователей.Колонки.Добавить("МассивВыбранныхОтборов");
	
	
	Для Каждого СтрОтб Из ПользовательскиеНастройки.Отбор.Элементы Цикл   
		МассивВыбранныхОтборов = Новый Массив;
		ТекущийОтбор = Строка(СтрОтб.ЛевоеЗначение);    
			
		Если МассивИспользуемыхОтборов.Найти(ТекущийОтбор) = Неопределено Тогда
            Продолжить;
        КонецЕсли;
		
		Если МассивИспользуемыхОтборов.Найти(ТекущийОтбор) <> Неопределено Тогда     
			Для Каждого ЭлОтб Из СтрОтб.ПравоеЗначение Цикл  
				Если ЭлОтб.Значение.Код = "00-000017" Или ЭлОтб.Значение.Код = "РТ-000040" Тогда
					МассивВыбранныхОтборов.Добавить(ЭлОтб.Значение);	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;    
		
		Если МассивВыбранныхОтборов.Количество() > 0 Тогда
			НовСтр = ТаблицаОтборовПользователей.Добавить();   
			НовСтр.ОтборПо = ТекущийОтбор;
			НовСтр.МассивВыбранныхОтборов = МассивВыбранныхОтборов;     
		КонецЕсли;
	КонецЦикла;    
	Возврат ТаблицаОтборовПользователей;
КонецФункции

Функция ОбработатьПользовательскиеНастройки(ВложенаяСхемаВариантОтчета)
	
	Если ВложенаяСхемаВариантОтчета <> Неопределено Тогда  
			
		ТаблицаСоответствийПользовательскихОтборов = ПолучениеТаблицыСоответствийПользовательскихОтборов();
		Настройки = ЭтотОбъект.КомпоновщикНастроек.Настройки.Структура[0].Настройки;			
		
		ОбработатьОтборыПользователя(Настройки, ТаблицаСоответствийПользовательскихОтборов);
		ОбработатьПараметрыПользователя(Настройки);
		
	Иначе
		Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();	
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции              

Процедура ОбработатьОтборыПользователя(Настройки, ТаблицаСоответствийПользовательскихОтборов)
	
	Для Каждого ЭлОтбора Из Настройки.Отбор.Элементы Цикл   
		ИндексОтбора = ТаблицаСоответствийПользовательскихОтборов.Получить(Строка(ЭлОтбора.ЛевоеЗначение)); 
		Если ИндексОтбора <> Неопределено Тогда
			ТаблицаПроектыОрганизации = ПолучениеДанныхПроектовПользователей(ПользователиКлиентСервер.ТекущийПользователь());
		КонецЕсли;	
		
		Для Каждого СтрПроект Из ТаблицаПроектыОрганизации Цикл	  
			Если СтрПроект.ИмяКолонки = Строка(ЭлОтбора.ЛевоеЗначение) Тогда
				Если СтрПроект.ИспользоватьОтбор Тогда         
					РежимОтображенияОтбора = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;			
				Иначе     
					РежимОтображенияОтбора = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
				КонецЕсли; 
				ЭлОтбора.Использование = СтрПроект.ИспользоватьОтбор;   
				ЭлОтбора.РежимОтображения = РежимОтображенияОтбора;  
				ЭлОтбора.ПравоеЗначение = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(ИндексОтбора).ПравоеЗначение;  
			КонецЕсли;
		КонецЦикла;					
	КонецЦикла;
	
КонецПроцедуры   

Процедура ОбработатьПараметрыПользователя(Настройки)
	
	Для Каждого Парам Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл   
							
		Если Не Парам.Использование Или НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Парам,"Параметр") Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПараметра = Строка(Парам.Параметр);
		
		Если ИмяПараметра = "Период" Тогда    
			ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);   
			ПараметрСКД.Значение = Парам.Значение;   					
		ИначеЕсли ИмяПараметра = "ПериодСверки" Тогда
			ПараметрСКД = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);  
			ПараметрСКД.Значение = Парам.Значение;					
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры   

Процедура ВывестиРезультатВДокумент(ТаблицаДанныхОтчета, ДокументРезультат, ДанныеРасшифровки, 
	ВложенаяСхемаВариантОтчета, СтруктураПериодаОтчета, ПользовательскиеНастройки)
	
	Настройки = ПользовательскиеНастройки;
	
	Если СтруктураПериодаОтчета.ЕстьПериодСверки Тогда  
		
		ВложенаяСхемаВариантОтчета = ?(ВложенаяСхемаВариантОтчета = Неопределено,КомпоновщикНастроек.Настройки.ДополнительныеСвойства.КлючВарианта,ВложенаяСхемаВариантОтчета);
		
		ВложеннаяСхемаИтогиПоГодам = ПолучитьСоответствиеВложеннойСхемыКОтчету(ВложенаяСхемаВариантОтчета);
		ВложеннаяСКД = СхемаКомпоновкиДанных.ВложенныеСхемыКомпоновкиДанных.Найти(ВложеннаяСхемаИтогиПоГодам);
		СхемаКД = ВложеннаяСКД.Схема;

		СравнитьДанныеКонсолидированногоОтчета(ТаблицаДанныхОтчета, СтруктураПериодаОтчета.ДатаНачала, СтруктураПериодаОтчета.ДатаОкончания);    
		
		Настройки = СхемаКД.ВариантыНастроек[0].Настройки;   	
		
		УстановитьПользовательскиеОтборы(Настройки,ПользовательскиеНастройки);
		УстановитьПользовательскиеПараметры(Настройки,ПользовательскиеНастройки);		
		
	Иначе 
		Если ВложенаяСхемаВариантОтчета <> Неопределено Тогда
			ВложеннаяСКД = СхемаКомпоновкиДанных.ВложенныеСхемыКомпоновкиДанных.Найти(ВложенаяСхемаВариантОтчета);    
			СхемаКД = ВложеннаяСКД.Схема;		
		Иначе     
			СхемаКД = ПолучитьМакет("СхемаКомпоновкиДанных_СводныйОтчет");	
		КонецЕсли;
	КонецЕсли;
	
	ВывестиРезультатВыполненияВТабличныйДокумент(СхемаКД,Настройки,ДанныеРасшифровки,ТаблицаДанныхОтчета,ДокументРезультат);
	
КонецПроцедуры

Процедура УстановитьПользовательскиеОтборы(Настройки,ПользовательскиеНастройки)  
	
	Настройки.Отбор.Элементы.Очистить();
	Для Каждого Стр Из ПользовательскиеНастройки.Отбор.Элементы Цикл   
		ЗаполнитьЗначенияСвойств(Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")),Стр);			
	КонецЦикла;    
	
КонецПроцедуры

Процедура УстановитьПользовательскиеПараметры(Настройки,ПользовательскиеНастройки) 
	
	Настройки.ПараметрыДанных.Элементы.Очистить();      
	Для Каждого Стр Из ПользовательскиеНастройки.ПараметрыДанных.Элементы Цикл   
		ЗаполнитьЗначенияСвойств(Настройки.ПараметрыДанных.Элементы.Добавить(),Стр);			
	КонецЦикла;    
	
КонецПроцедуры     

Процедура УстановитьПользовательскиеОтборыПараметры(Настройки,КомпоновщикНастроек)  
	// Очистим настройки подменяемой схемы компановки
	Настройки.Отбор.Элементы.Очистить();	  
	Настройки.ПараметрыДанных.Элементы.Очистить();      
	
	Для Каждого Стр Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл 
		Если Стр.Использование Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Стр,"Параметр") Тогда   // Заполним параметры     
				ПользовательскийПараметр = Настройки.ПараметрыДанных.Элементы.Добавить(); 	 
				ПользовательскийПараметр.Значение = Стр.Значение;
				ПользовательскийПараметр.ИдентификаторПользовательскойНастройки = Стр.ИдентификаторПользовательскойНастройки;
				ПользовательскийПараметр.Использование = Стр.Использование;
				ПользовательскийПараметр.Параметр = Стр.Параметр;
				ПользовательскийПараметр.РежимОтображения = Стр.РежимОтображения;
				
				//ЗаполнитьЗначенияСвойств(Настройки.ПараметрыДанных.Элементы.Добавить(),Стр);	
			Иначе   // Заполним отборы        
				ПользовательскийОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ПользовательскийОтбор.ВидСравнения = Стр.ВидСравнения; 
				ПользовательскийОтбор.ИдентификаторПользовательскойНастройки = Стр.ИдентификаторПользовательскойНастройки; 
				ПользовательскийОтбор.Использование = Стр.Использование;  
				ПользовательскийОтбор.ПравоеЗначение = Стр.ПравоеЗначение; 
				ПользовательскийОтбор.РежимОтображения = Стр.РежимОтображения; 
				
				//ЗаполнитьЗначенияСвойств(Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")),Стр);	
			КонецЕсли;  
		КонецЕсли;								
	КонецЦикла;   
	
КонецПроцедуры

Процедура ВывестиРезультатВыполненияВТабличныйДокумент(СхемаКД,Настройки,ДанныеРасшифровки,ТаблицаДанныхОтчета,ДокументРезультат)
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;  
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;  
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКД, Настройки, ДанныеРасшифровки); 
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаДанныхОтчета",ТаблицаДанныхОтчета);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 		
КонецПроцедуры

Функция ПолучитьСоответствиеВложеннойСхемыКОтчету(ВложенаяСхемаВариантОтчета)
	СоответствиеОтчетВложеннаяСхема = Новый Соответствие;     
	СоответствиеОтчетВложеннаяСхема.Вставить("ОтчетConsoСтатьяЗатрат","ОтчетConsoСтатьяЗатратИтогиПоГодам");  
	СоответствиеОтчетВложеннаяСхема.Вставить("ОтчетConsoСтатьяДоходовРасходов","ОтчетConsoСтатьяЗатратИтогиПоГодам");  
	СоответствиеОтчетВложеннаяСхема.Вставить("ОтчетConsoНазначениеПлатежа","ОтчетConsoСтатьяЗатратИтогиПоГодам"); 
	СоответствиеОтчетВложеннаяСхема.Вставить("Отчет Conso (Проект)","ОтчетConsoПроектИтогиПоГодам");
	
	ВложеннаяСхемаИтогиПоГодам = СоответствиеОтчетВложеннаяСхема.Получить(ВложенаяСхемаВариантОтчета);
	
	Возврат ВложеннаяСхемаИтогиПоГодам;
КонецФункции  

Функция ПолучениеДанныхЭкземпляровОтчета(ОрганизацииОтбора,ДатаНачалаОтчета,ДатаОкончанияОтчета,ОбрабатыватьКосвенные,ТаблицаОтборовПользователей)  	
	// Получение основной таблицы	
	ТаблицаРасходов = ПолучитьДанныеКонсолидированныхРасходов(ДатаНачалаОтчета,ДатаОкончанияОтчета,ТаблицаОтборовПользователей); 
	
	// Получение вспомогательных таблиц
	ТаблицаДанных = ПолучениеТаблицыЗаполнения(""); 	
	ТаблицаДанных_Косвенные = ПолучениеТаблицыЗаполненияКосвенные("");
	ПризнакПолученияПроцентов = "Данные процентов процент";//План    
	
	ПериодыОтчетаМесяц = ПериодыУХ.ПолучитьПодчиненныеПериоды(
        ДатаНачалаОтчета, 
        КонецГода(ДатаНачалаОтчета), 
        Перечисления.Периодичность.Месяц);

	ТаблицаПроцентов_РаспределениеКосвенные = ПолучениеПроцентоДляРаспеределенияБЛКосвенные(ПериодыОтчетаМесяц,ПризнакПолученияПроцентов);
		   	
	// Инициализация констант и справочников
    Организации = ИнициализироватьОрганизации();  
		
	// Инициализация параметров
    СценарииОтчета = Справочники.Сценарии.НайтиПоНаименованию("Сценарий месячный (2025 год)");      
    ПериодОтчета_ПроцентыРаспределения = ПериодыУХ.ПолучитьПодчиненныеПериоды(
        ДатаНачалаОтчета, 
        КонецГода(ДатаНачалаОтчета), 
        Перечисления.Периодичность.Год)[0];  
		
	// Получим таблицы с процентами распределения по организациям
	ТаблицыПроцентовОрганизаций = ПолучитьДанныеПоРаспределениюПроцентов(ДатаНачалаОтчета,ДатаОкончанияОтчета);	
		
	//{Воронков А.Д. ++
	//Перенести всю инициализацию используемых переменных, в отдельную функцию
	РазвитиеБизнесаСтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("РТ-000018");  
	СтатьяЗатрат_Мотивация = Справочники.СтатьиЗатрат.НайтиПоКоду("00-000018");
	СтатьяЗатрат_ФОТНалоги = Справочники.СтатьиЗатрат.НайтиПоКоду("РТ-000040"); 	
	МассивОтчетовОбрабатываемыхОтдельно =  МассивЭООбрабатываемыхОтдельно();	
	ВладелецСправочника = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Проект");
	ПроектПеревода_Косвенные = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Косвенные",,,ВладелецСправочника);    	
	SalesTech_Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Sales Tech",,,ВладелецСправочника); 
    Поставщики_Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Поставщики",,,ВладелецСправочника);  	
	ВладелецСправочникаНазначениеПлатежа = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Назначение платежа");
	Лицензии = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Лицензии",,,ВладелецСправочникаНазначениеПлатежа); 	
	//--}	 
	
	// Получение соответствий
	СоответствияКомпанийВГО = ПолучениеСоответствияКомпанийВГО();   	
	СоответствияПорядкаСортировкиСтатьиЗатрат = ПолучениеСоответствияПорядкаСортировкиСтатьиЗатрат();  
	СоответствиеВидОтчетаОрганизация = ПолучениеСоотвествияВидОтчетаОрагнизационнаяЕдиница();
	СоответствиеПроектовБЛ = СоответствиеПроектовБЛ();
	
	//{Воронков А.Д. 11.06.2025 ++  
	СтруктураНастроекТрансфертов = ПолучениеПризнакаТрансфертаПоСотрудникуОтчетConso();
	//--}
	
	ДатаСравнения = Дата('2026.01.01');
	
	КэшПериодов = Новый Соответствие;
	
	Для Каждого Стр Из ТаблицаРасходов Цикл      
		
		
		ПризнакПереводаПроекта = Ложь;
		
		Если Стр.Аналитика2.Код = "РТ-000018" Или  Стр.Аналитика2.Код = "00-000016" Тогда     
			Стр.Аналитика2 = РазвитиеБизнесаСтатьяЗатрат;	 
		КонецЕсли;   
		
		Если Стр.Аналитика4 = Неопределено Тогда
			Стр.Аналитика4 = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("НазначПлат");	       
		ИначеЕсли Стр.Аналитика4.Код = "000000043" Тогда
			Стр.Аналитика4 = Лицензии;	
		КонецЕсли;
		
		ОрганизаяВидаОтчета = СоответствиеВидОтчетаОрганизация.Получить(СокрЛП(Стр.КодГруппыВидаОтчета));
		Если ОрганизаяВидаОтчета <> Неопределено Тогда
			Организация = ОрганизаяВидаОтчета;   
		КонецЕсли;     
		
		//Проверку делать только по определенным отчем. Остальные пропускаем  
		ПризакРасчетаЭО = МассивОтчетовОбрабатываемыхОтдельно.Получить(Стр.ВидОтчета.Наименование);//Стр.ВидОтчета);  
		Если ПризакРасчетаЭО <> Неопределено Тогда 
			Если СтрНайти(Стр.Справочно,"Перевод РТС") > 0  Тогда  				
				Организация = Организации.РТСТ;	
			ИначеЕсли СтрНайти(Стр.Справочно,"Перевод ОТС") > 0  Тогда		
				Организация = Организации.ОТС;	      
			ИначеЕсли  СтрНайти(Стр.Справочно,"Перевод ЦРЭ") > 0  Тогда	
				Организация = Организации.ЦРЭ;	
			КонецЕсли;
			Если Стр.Аналитика1.Код = "000000016" Тогда //Проект "Перевод РТС" 
				ПризнакПереводаПроекта = Истина;
				Организация = Организации.РТСТ;	  
			КонецЕсли;                           
			Если Стр.Аналитика1.Код = "000000013" Тогда // Перевод ОТС
				Организация = Организации.ОТС;      
			КонецЕсли;
		КонецЕсли;
		//--  
		
		//{Воронков А.Д. 06.05.2025 ++
		//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409001/
		Если Стр.Аналитика1.Код = "000000014" Тогда //Проект "Перевод ЦРЭ"      
			ПризнакПереводаПроекта = Истина;
			Организация = Организации.ЦРЭ;	
		КонецЕсли;     
		//--}	   
		
		// {Воронков А.Д. 01.12.2025 ++
		// Обработка проектов взяли как в КонсолидированныеРасходыДляБюджетаv7      
		Если Стр.ПериодОтчета.ДатаНачала >= ДатаСравнения Тогда
		//Если ДатаНачалаОтчета >= ДатаСравнения Тогда
			Если Стр.Аналитика1.Код = "000000016" ИЛИ Стр.Аналитика1.Код = "000000014" ИЛИ Стр.Аналитика1.Код = "000000013" Тогда 
				Стр.Аналитика1 = ПроектПеревода_Косвенные;
			КонецЕсли; 
		КонецЕсли;
		//--}
		
		Если Стр.РасходыКонтактЦентра Тогда 	
			//МассивДанныхРаспределения = ТаблицаПроцентовКосвенные; 	
			НаименованиеТаблицы = "РасходыКонтактЦентраРТС";	
			МассивДанныхРаспределения = ПолучитьПроцентыРаспределения(
				НаименованиеТаблицы,Стр,ТаблицыПроцентовОрганизаций,КэшПериодов);
		Иначе
			СтруктураОтбора = Новый Структура("Регион",Стр.Аналитика6);
			Если Организация = Организации.РТСТ ИЛИ Организация = Организации.Текса ИЛИ Организация = Организации.Холдинг ИЛИ Организация = Организации.Силует ИЛИ Организация = Организации.Академия Тогда 
				//МассивДанныхРаспределения = ТаблицаПроцентовРТС.НайтиСтроки(СтруктураОтбора);   
				НаименованиеТаблицы = "ПроцентыРаспределенияРТС";	
				МассивДанныхРаспределения = ПолучитьПроцентыРаспределения(
					НаименованиеТаблицы,Стр,ТаблицыПроцентовОрганизаций,КэшПериодов);						
			ИначеЕсли Организация = Организации.ЦРЭ Тогда      
				//МассивДанныхРаспределения = ТаблицаПроцентовЦРЭ.НайтиСтроки(СтруктураОтбора);  
				НаименованиеТаблицы = "ПроцентыРаспределенияЦРЭ";	
				МассивДанныхРаспределения = ПолучитьПроцентыРаспределения(
					НаименованиеТаблицы,Стр,ТаблицыПроцентовОрганизаций,КэшПериодов);	
			ИначеЕсли Организация = Организации.ОТС Тогда 
				//МассивДанныхРаспределения = ТаблицаПроцентовОТС.НайтиСтроки(СтруктураОтбора);  
				НаименованиеТаблицы = "ПроцентыРаспределенияОТС";	
				МассивДанныхРаспределения = ПолучитьПроцентыРаспределения(
					НаименованиеТаблицы,Стр,ТаблицыПроцентовОрганизаций,КэшПериодов);	
			ИначеЕсли Организация = Организации.ОЛ Тогда  
				НаименованиеТаблицы = "ПроцентыРаспределенияОЛ"; 
				МассивДанныхРаспределения = ПолучитьПроцентыРаспределения(
					НаименованиеТаблицы,Стр,ТаблицыПроцентовОрганизаций,КэшПериодов);
				//МассивДанныхРаспределения = ТаблицаПроцентовОЛ.НайтиСтроки(СтруктураОтбора);
			КонецЕсли;
		КонецЕсли;	 
		
		Если Стр.Аналитика5 <> Неопределено Тогда
			ПризнакВГО = СоответствияКомпанийВГО.Получить(СокрЛП(Стр.Аналитика5.Наименование));  
		Иначе
			ПризнакВГО = Неопределено;	
		КонецЕсли;
	
		Если ОрганизацииОтбора = Неопределено Тогда
			Если ПризнакВГО <> Неопределено	Тогда //Если нашли признак ВГО, но отбор по организации у пользователя не установлен, пропускаем строку. 
				Продолжить;
			КонецЕсли;
		ИначеЕсли ОрганизацииОтбора <> Неопределено Тогда     
			//Уточнить про точечный отбор по организациям
			//Если ПризнакВГО <> Неопределено И ПризнакВГО_ОрганизацияОтбора = Неопределено Тогда // Если нашли признак ВГО, но компания отобора у пользователя не сопоставилась, пропускаем строку.   
			//	Продолжить;  
			//КонецЕсли;   
			//Если ПризнакВГО <> Неопределено Тогда
			//	Если Трансферты <> Неопределено Тогда    
			//		ОтборТрансферт = Новый Структура("ВидОтчета",Справочники.ВидыОтчетов.НайтиПоНаименованию(Стр.ВидОтчета));
			//		МассивТрансфертов = Трансферты.НайтиСтроки(ОтборТрансферт);
			//		Если МассивТрансфертов.Количество() > 0 Тогда
			//			Продолжить;
			//		КонецЕсли;	  
			//	КонецЕсли;   
			//КонецЕсли;
		КонецЕсли;
		
		//{Воронков А.Д. 10.06.2025 ++  
		//Если отчет формирует пользователь из справочника "Проекты пользователей", нужно сменить организацию, если есть признак Транферт в справочнике 
		//"Проекты пользователей"        
		//   
		Если СтруктураНастроекТрансфертов <> Неопределено Тогда
			//ОтборТрансферт = Новый Структура("ВидОтчета",Справочники.ВидыОтчетов.НайтиПоНаименованию(Стр.ВидОтчета));
			//МассивТрансфертов = Трансферты.НайтиСтроки(ОтборТрансферт);
			//Если МассивТрансфертов.Количество() > 0 Тогда  
			//	Организация = МассивТрансфертов[0].Организация;	
			//КонецЕсли; 
			
			ОтборПроект = Новый Структура("Проект",Стр.Аналитика1);	
			МассивПроект = СтруктураНастроекТрансфертов.Проекты.НайтиСтроки(ОтборПроект);
			Если МассивПроект.Количество() > 0 Тогда    
				ОтборТрансферт = Новый Структура("ВидОтчета",Справочники.ВидыОтчетов.НайтиПоНаименованию(Стр.ВидОтчета.Наименование));
				МассивТрансфертов = СтруктураНастроекТрансфертов.Трансферты.НайтиСтроки(ОтборТрансферт); 
				Если МассивТрансфертов.Количество() > 0 Тогда  
					Организация = МассивТрансфертов[0].Организация;	
				КонецЕсли; 			
			КонецЕсли;		
		КонецЕсли;
		//--}
		
		Если Стр.Аналитика1 = Справочники.ПроизвольныйКлассификаторУХ.ПустаяСсылка() Тогда	
			Если МассивДанныхРаспределения.Количество() > 0 Тогда   
				Для Каждого Эл Из МассивДанныхРаспределения Цикл  
					
					АналитикаПроектНаименование = Эл.Проект.Наименование;
					АналитикаПроект = Эл.Проект; 
					ПроцентБЛ = Эл.ПроцентБЛ;
					
					СтруктураПараметров = Новый Структура("АналитикаПроектНаименование,АналитикаПроект,ПроцентБЛ,ПризнакПереводаПроекта,ПроектПеревода_Косвенные,Организация,СтатьяЗатрат_Мотивация,СтатьяЗатрат_ФОТНалоги,SalesTech_Проект,Поставщики_Проект,ТаблицаДанных_Косвенные,ОбрабатыватьКосвенные,ДляПлана",
					АналитикаПроектНаименование,АналитикаПроект,ПроцентБЛ,ПризнакПереводаПроекта,ПроектПеревода_Косвенные,Организация,СтатьяЗатрат_Мотивация,СтатьяЗатрат_ФОТНалоги,SalesTech_Проект,Поставщики_Проект,ТаблицаДанных_Косвенные,ОбрабатыватьКосвенные);
														
					ДобавлениеСтрокиВОбщийОтчет(Стр,СтруктураПараметров,ТаблицаДанных,СоответствиеПроектовБЛ,СоответствияПорядкаСортировкиСтатьиЗатрат);	
										
				КонецЦикла;
			КонецЕсли;
		Иначе 
			
			АналитикаПроектНаименование = СокрЛП(Стр.Аналитика1.Наименование);
			АналитикаПроект = Стр.Аналитика1;  
			ПроцентБЛ = Неопределено;
			
			СтруктураПараметров = Новый Структура("АналитикаПроектНаименование,АналитикаПроект,ПроцентБЛ,ПризнакПереводаПроекта,ПроектПеревода_Косвенные,Организация,СтатьяЗатрат_Мотивация,СтатьяЗатрат_ФОТНалоги,SalesTech_Проект,Поставщики_Проект,ТаблицаДанных_Косвенные,ОбрабатыватьКосвенные,ДляПлана",
			АналитикаПроектНаименование,АналитикаПроект,ПроцентБЛ,ПризнакПереводаПроекта,ПроектПеревода_Косвенные,Организация,СтатьяЗатрат_Мотивация,СтатьяЗатрат_ФОТНалоги,SalesTech_Проект,Поставщики_Проект,ТаблицаДанных_Косвенные,ОбрабатыватьКосвенные);
			
			ДобавлениеСтрокиВОбщийОтчет(Стр,СтруктураПараметров,ТаблицаДанных,СоответствиеПроектовБЛ,СоответствияПорядкаСортировкиСтатьиЗатрат);			
		КонецЕсли;			
		
	КонецЦикла;           
	
	ОбработаемОтдельноОтчетыИзГруппы_ИТРазработкаИСопровождениеПО2(ТаблицаДанных,ТаблицаДанных_Косвенные,ДатаНачалаОтчета,ДатаОкончанияОтчета);	
	
	ПризнакРасчетаПланФакт = "Сумма"; //Сумма планового значения
	
	ТаблицаДанных_Косвенные.Свернуть("Направление,ПериодОтчета,ПериодОтчетаРодитель,Организация", ПризнакРасчетаПланФакт);       
	
	ДанныеПоКосвеннымРасходам = РассчитаемКосвенныеРасходыОтдельно(ТаблицаДанных_Косвенные,ТаблицаПроцентов_РаспределениеКосвенные,СоответствияПорядкаСортировкиСтатьиЗатрат,ПризнакРасчетаПланФакт);
	
	ДополнитьТаблицу(ДанныеПоКосвеннымРасходам,ТаблицаДанных);  
		
	Возврат ТаблицаДанных;
КонецФункции 

Функция ИнициализироватьОрганизации() 
    
    РТСТ = Справочники.Организации.НайтиПоРеквизиту("ИНН","7710357167");
    ЦРЭ = Справочники.Организации.НайтиПоРеквизиту("ИНН","5034031535");
    ОТС = Справочники.Организации.НайтиПоРеквизиту("ИНН","7708699893");
    Академия = Справочники.Организации.НайтиПоРеквизиту("ИНН","9718036602");
    Холдинг = Справочники.Организации.НайтиПоРеквизиту("ИНН","7723825581");
    Силует = Справочники.Организации.НайтиПоРеквизиту("ИНН","7720745867");
    Текса = Справочники.Организации.НайтиПоРеквизиту("ИНН","9718151838");  
	ОЛ = Справочники.Организации.НайтиПоРеквизиту("ИНН","7725320554");
    
    Возврат Новый Структура("РТСТ,ЦРЭ,ОТС,Академия,Холдинг,Силует,Текса,ОЛ",
        РТСТ, ЦРЭ, ОТС, Академия, Холдинг, Силует, Текса, ОЛ);
КонецФункции  

Функция ПолучитьДанныеКонсолидированныхРасходов(ДатаНачалаОтчета,ДатаОкончанияОтчета,ТаблицаОтборовПользователей)     
			
	//Результат = Новый ТаблицаЗначений;
	//
	//ПериодОтчетаПроверка = КонецГода(ДатаНачалаОтчета);
	//
	//// Данные за текущий год
	//Если ДатаНачалаОтчета <= ПериодОтчетаПроверка Тогда
	//	ДатаОкончания1 = ?(ДатаОкончанияОтчета <= ПериодОтчетаПроверка, ДатаОкончанияОтчета, ПериодОтчетаПроверка);
	//	Результат = СоздатьЗапросДоВерсии2025(ДатаНачалаОтчета, ДатаОкончания1);
	//КонецЕсли;
	//
	//// Определим есть ли следующий год в выбранном периоде
	//Если ДатаОкончанияОтчета > ПериодОтчетаПроверка Тогда
	//	ДатаНачала2 = ?(ДатаНачалаОтчета > ПериодОтчетаПроверка, ДатаНачалаОтчета, ПериодОтчетаПроверка + 1);
	//	Таблица2 = СоздатьЗапросПослеВерсии2025(ДатаНачала2, ДатаОкончанияОтчета);
	//	
	//	Если Результат.Количество() = 0 Тогда
	//		Результат = Таблица2;
	//	Иначе   
	//		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Таблица2,Результат);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Возврат Результат; 
	
	Результат = Новый ТаблицаЗначений;  
	
	Конец2025Года = КонецГода(Дата(2025, 12, 31));
	
	// Если весь период находится после 2025 года
	Если ДатаНачалаОтчета > Конец2025Года Тогда
		// Используем только новый метод
		Результат = СоздатьЗапросПослеВерсии2025(ДатаНачалаОтчета, ДатаОкончанияОтчета, ТаблицаОтборовПользователей);
		
	ИначеЕсли ДатаОкончанияОтчета <= Конец2025Года Тогда
		// Если весь период до 2025 года включительно
		Результат = СоздатьЗапросДоВерсии2025(ДатаНачалаОтчета, ДатаОкончанияОтчета, ТаблицаОтборовПользователей);
		
	Иначе
		// Смешанный период: часть до 2025, часть после
		
		// Данные за период до 2025 года включительно
		Если ДатаНачалаОтчета <= Конец2025Года Тогда
			ДатаОкончанияПервогоПериода = Конец2025Года;
			Если ДатаОкончанияОтчета <= Конец2025Года Тогда
				ДатаОкончанияПервогоПериода = ДатаОкончанияОтчета;
			КонецЕсли;
			
			Результат = СоздатьЗапросДоВерсии2025(ДатаНачалаОтчета, ДатаОкончанияПервогоПериода, ТаблицаОтборовПользователей);
		КонецЕсли;
		
		// Данные за период после 2025 года
		Если ДатаОкончанияОтчета > Конец2025Года Тогда
			ДатаНачалаВторогоПериода = Макс(ДатаНачалаОтчета, Конец2025Года + 1);
			ДанныеВторогоПериода = СоздатьЗапросПослеВерсии2025(ДатаНачалаВторогоПериода, ДатаОкончанияОтчета, ТаблицаОтборовПользователей);
			
			Если Результат.Количество() = 0 Тогда
				Результат = ДанныеВторогоПериода;
			Иначе   
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеВторогоПериода, Результат);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;       
	
КонецФункции      

Функция СоздатьЗапросДоВерсии2025(ДатаНачала, ДатаОкончания, ТаблицаОтборовПользователей)
    
   Запрос = Новый Запрос;
    
    Запрос.УстановитьПараметр("МассивПравилОбработки", ПолучениеМассиваКодовГруппОтчетов());   
    Запрос.УстановитьПараметр("МассивПравилОбработки_НеВключаемВОтчет", ПолучениеЭОНеВключаемыхВОбщийОтчет());	
    Запрос.УстановитьПараметр("ПоказателиБулево", ПолучениеПоказателейБулево());
    Запрос.УстановитьПараметр("ПоказателиСтроковые", ПолучениеПоказателейСтроковые());
    Запрос.УстановитьПараметр("ПоказателиЧисловые", ПолучениеПоказателейЧисловых());      
    Запрос.УстановитьПараметр("ПоказателиНДС", ПолучениеПоказателейНДС());   
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    ПериодНДС = ПериодыУХ.ПолучитьПодчиненныеПериоды(
        НачалоГода(ДатаНачала),
        КонецМесяца(НачалоГода(ДатаНачала)),
        Перечисления.Периодичность.Месяц
    );
    Запрос.УстановитьПараметр("ПериодПолученияНДС", ПериодНДС[0]); 
    
    Запрос.Текст = ПроверкаНовогоЗапроса(); 
	
	Если РольДоступна("ПолныеПрава") Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ &ПользовательскиеОтборы","");	
	Иначе
		// Установим пользотвательские отборы, чтобы сократить выборку данных запросом
		Если ТаблицаОтборовПользователей.Количество() > 0 Тогда    
			УстановитьПользовательскиеОтборыТекстЗапроса(Запрос,ТаблицаОтборовПользователей);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ &ПользовательскиеОтборы","");	
		КонецЕсли;       
	КонецЕсли;
	
    Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  

Функция СоздатьЗапросПослеВерсии2025(ДатаНачала, ДатаОкончания, ТаблицаОтборовПользователей)
    
    Запрос = Новый Запрос;
    
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    Запрос.УстановитьПараметр("МассивПравилОбработки", ПолучениеМассиваКодовГруппОтчетов());
    Запрос.УстановитьПараметр("ПоказателиЧисловые", ПолучениеПоказателейЧисловых());
    
    МесячныйПериод = ПериодыУХ.ПолучитьПодчиненныеПериоды(
        ДатаНачала,
        КонецМесяца(ДатаНачала),
        Перечисления.Периодичность.Месяц
    );
    ГодовойПериод = ПериодыУХ.ПолучитьПодчиненныеПериоды(
        ДатаНачала,
        КонецМесяца(ДатаНачала),
        Перечисления.Периодичность.Год
    );
    
    Запрос.УстановитьПараметр("ПериодПолученияНечисловыхПоказателей", МесячныйПериод[0]);
    Запрос.УстановитьПараметр("ПериодОтчета", ГодовойПериод[0]);
    
    Запрос.Текст = ПолучитьТекстЗапросаДляСбораКонсолидированныхРасходов();
	
	Если РольДоступна("ПолныеПрава") Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ &ПользовательскиеОтборы","");	
	Иначе
		// Установим пользотвательские отборы, чтобы сократить выборку данных запросом
		Если ТаблицаОтборовПользователей.Количество() > 0 Тогда    
			УстановитьПользовательскиеОтборыТекстЗапроса(Запрос,ТаблицаОтборовПользователей);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ &ПользовательскиеОтборы","");	
		КонецЕсли; 
	КонецЕсли;
	
   Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УстановитьПользовательскиеОтборыТекстЗапроса(Запрос, ТаблицаОтборовПользователей)   
	     
	СоответствиеОтборов = Новый Соответствие;
	СоответствиеОтборов.Вставить("СтатьяЗатрат","НЕ ВТ_ОсновныеДанныеПоСуммам.Аналитика2 В(&СтатьяЗатрат)");
	СоответствиеОтборов.Вставить("СтатьяДоходовРасходов","ВТ_ОсновныеДанныеПоСуммам.Аналитика3 В(&СтатьяДоходовРасходов)");
	СоответствиеОтборов.Вставить("НазначениеПлатежа","ВТ_ОсновныеДанныеПоСуммам.Аналитика4 В(&НазначениеПлатежа)");
	
	ТекстЗапросаОтбор = "";
	
	Для Каждого СтрокаОтбора Из ТаблицаОтборовПользователей Цикл     
		ТекстОтбора = СоответствиеОтборов.Получить(СтрокаОтбора.ОтборПо);
		Если ТекстОтбора <> Неопределено Тогда    
			ТекстЗапросаОтбор = ТекстЗапросаОтбор + ТекстОтбора;
		КонецЕсли; 
		Запрос.УстановитьПараметр(СтрокаОтбора.ОтборПо,СтрокаОтбора.МассивВыбранныхОтборов);
	КонецЦикла;	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПользовательскиеОтборы",ТекстЗапросаОтбор); 
КонецПроцедуры

Функция ПолучитьТаблицуРаспределенияОЛ()      
	ВладелецСправочника = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Проект");  
	ВладелецСправочникаРегион = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Регион");

	ТаблицаПроцентовОЛ = Новый ТаблицаЗначений;
	ТаблицаПроцентовОЛ.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));
	ТаблицаПроцентовОЛ.Колонки.Добавить("ПроцентБЛ",Новый ОписаниеТипов("Число"));  
	ТаблицаПроцентовОЛ.Колонки.Добавить("Регион",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));
	
	СтрПроц = ТаблицаПроцентовОЛ.Добавить();
	СтрПроц.Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000022",,,ВладелецСправочника);//ОЛ
	СтрПроц.ПроцентБЛ = 100;    
	СтрПроц.Регион = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000026",,,ВладелецСправочникаРегион);//ОЛ
	Возврат ТаблицаПроцентовОЛ;	
КонецФункции

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеТаблицыПроцентов(ВидОтчета, тПериодыОтчета, СценарииОтчета, ИмяКолонкиАналитики)     
    СтруктураПараметровОтбора = Новый Структура("ВидОтчета,ПериодОтчета,Сценарий",  
    ВидОтчета, тПериодыОтчета, СценарииОтчета);    
    РаскрываемыеАналитики = Новый Структура("Аналитика1");    
    тЗначенияПоказателейВидаОтчета = СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(
    СтруктураПараметровОтбора, РаскрываемыеАналитики);        
    
    ТаблицаПроцентов = Новый ТаблицаЗначений;    
    ТаблицаПроцентов.Колонки.Добавить(ИмяКолонкиАналитики, Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));
    ТаблицаПроцентов.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));
    ТаблицаПроцентов.Колонки.Добавить("ПроцентБЛ", Новый ОписаниеТипов("Число"));
        
    ВладелецСправочника = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Проект");
    
    Для Каждого Стр Из тЗначенияПоказателейВидаОтчета Цикл  
        НовСтр = ТаблицаПроцентов.Добавить();        
        НовСтр[ИмяКолонкиАналитики] = Стр.Аналитика1;
        
        // Обработка проекта
        Если Стр.ПоказательОтчета.Колонка.Наименование = "GМаркет" Тогда
            НовСтр.Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("G-Маркет",,,ВладелецСправочника);     
        ИначеЕсли Стр.ПоказательОтчета.Колонка.Наименование = "Обучение" Или Стр.ПоказательОтчета.Колонка.Наименование = "Поставщики" 
            Или Стр.ПоказательОтчета.Колонка.Наименование = "ЭЦП" Тогда     
            НовСтр.Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию(Стр.ПоказательОтчета.Колонка.Наименование,,,ВладелецСправочника);
        Иначе
            НовСтр.Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию(Стр.ПоказательОтчета.Колонка.Наименование,,,ВладелецСправочника);     
        КонецЕсли;
        НовСтр.ПроцентБЛ = Стр.Значение;
    КонецЦикла;    
    
    Возврат ТаблицаПроцентов;
КонецФункции  

Функция ОбработатьОтдельноМесяцы(ДанныеЭО,ДатаНачалаОтчета,ДатаОкончанияОтчета,ОбрабатыватьКосвенные,ВложенаяСхемаВариантОтчета)
	МассивОбрабатываемыхМесяцевОтдельно = Новый Массив; 
	МассивОбрабатываемыхМесяцевОтдельно.Добавить(Справочники.Периоды.НайтиПоНаименованию("Май 2025 г.")); 		 
	ТаблицаДанныхОтчетаДоп = СопоставлениеДанныхПланФакт(ДанныеЭО,ДатаНачалаОтчета,ДатаОкончанияОтчета,ОбрабатыватьКосвенные,ВложенаяСхемаВариантОтчета,МассивОбрабатываемыхМесяцевОтдельно);
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВТ_Табл",ТаблицаДанныхОтчетаДоп); 
	Запрос.УстановитьПараметр("МассивПериодов",МассивОбрабатываемыхМесяцевОтдельно); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Табл.Контрагент КАК Контрагент,
	|	ВТ_Табл.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_Табл.Направление КАК Направление,
	|	ВТ_Табл.Организация КАК Организация,
	|	ВТ_Табл.ОтклонениеПроцент КАК ОтклонениеПроцент,
	|	ВТ_Табл.ПериодОтчета КАК ПериодОтчета,
	|	ВТ_Табл.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
	|	ВТ_Табл.Проект КАК Проект,
	|	ВТ_Табл.Регион КАК Регион,
	|	ВТ_Табл.СортировкаНаправление КАК СортировкаНаправление,
	|	ВТ_Табл.СортировкаПериод КАК СортировкаПериод,
	|	ВТ_Табл.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВТ_Табл.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Табл.Сумма КАК Сумма,
	|	ВТ_Табл.СуммаОтклонение КАК СуммаОтклонение,
	|	ВТ_Табл.СуммаФакт КАК СуммаФакт,
	|	ВТ_Табл.СортировкаСтатьяЗатрат КАК СортировкаСтатьяЗатрат,
	|	ВТ_Табл.СортировкаПроект КАК СортировкаПроект,
	|	ВТ_Табл.ПериодЗаписи КАК ПериодЗаписи
	|ПОМЕСТИТЬ ВТ_Табл
	|ИЗ
	|	&ВТ_Табл КАК ВТ_Табл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Табл.Контрагент КАК Контрагент,
	|	ВТ_Табл.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_Табл.Направление КАК Направление,
	|	ВТ_Табл.Организация КАК Организация,
	//|	ВТ_Табл.ОтклонениеПроцент КАК ОтклонениеПроцент,
	|	ВТ_Табл.ПериодОтчета КАК ПериодОтчета,
	|	ВТ_Табл.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
	|	ВТ_Табл.Проект КАК Проект,
	|	ВТ_Табл.Регион КАК Регион,
	|	ВТ_Табл.СортировкаНаправление КАК СортировкаНаправление,
	|	ВТ_Табл.СортировкаПериод КАК СортировкаПериод,
	|	ВТ_Табл.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВТ_Табл.СтатьяЗатрат КАК СтатьяЗатрат,
	//|	ВТ_Табл.Сумма КАК Сумма,
	//|	ВТ_Табл.СуммаОтклонение КАК СуммаОтклонение,
	|	ВТ_Табл.СуммаФакт КАК СуммаФакт,
	|	ВТ_Табл.СортировкаСтатьяЗатрат КАК СортировкаСтатьяЗатрат,
	|	ВТ_Табл.СортировкаПроект КАК СортировкаПроект,
	|	ВТ_Табл.ПериодЗаписи КАК ПериодЗаписи
	|ИЗ
	|	ВТ_Табл КАК ВТ_Табл
	|ГДЕ
	|	ВТ_Табл.ПериодОтчета В(&МассивПериодов)
	|";
	Возврат Запрос.Выполнить().Выгрузить()	
КонецФункции
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеТаблицыЗаполнения(ПризнакТаблицы)  	
	ТаблицаДанныхОтчета = Новый ТаблицаЗначений;     
	ТаблицаДанныхОтчета.Колонки.Добавить("Направление",Новый ОписаниеТипов("Строка"));//Направление
	ТаблицаДанныхОтчета.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));//Проект
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяЗатрат",Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));//СтатьяЗатрат  
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяЗатратКод",Новый ОписаниеТипов("Строка"));//СтатьяЗатрат
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяДоходовРасходов",Новый ОписаниеТипов("СправочникСсылка.СтатьиДоходовИРасходов"));//СтатьяДоходовРасходов
	ТаблицаДанныхОтчета.Колонки.Добавить("НазначениеПлатежа",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));//НазначениеПлатежа
	ТаблицаДанныхОтчета.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("Строка"));//Контрагент
	ТаблицаДанныхОтчета.Колонки.Добавить("Регион",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));//Регион
	ТаблицаДанныхОтчета.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));//Сумма
	ТаблицаДанныхОтчета.Колонки.Добавить("ПериодОтчета",Новый ОписаниеТипов("СправочникСсылка.Периоды")); 
	ТаблицаДанныхОтчета.Колонки.Добавить("ПоказательОтчетаКод",Новый ОписаниеТипов("Строка"));//ПоказательОтчета   
	ТаблицаДанныхОтчета.Колонки.Добавить("КодГруппыВидаОтчета",Новый ОписаниеТипов("Строка"));//ВидОтчетаНаименование    
	ТаблицаДанныхОтчета.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));//Организация	
	ТаблицаДанныхОтчета.Колонки.Добавить("Справочно",Новый ОписаниеТипов("Строка"));//Справочно 
	ТаблицаДанныхОтчета.Колонки.Добавить("РасходыКонтактЦентра",Новый ОписаниеТипов("Булево"));//РасходыКонтактЦентра 		
	ТаблицаДанныхОтчета.Колонки.Добавить("НДС",Новый ОписаниеТипов("Число"));//НДС 
	ТаблицаДанныхОтчета.Колонки.Добавить("НДССумма",Новый ОписаниеТипов("Число"));//НДССумма 
	ТаблицаДанныхОтчета.Колонки.Добавить("ПорядокСортировки_СтатьяЗатрат",Новый ОписаниеТипов("Число"));  
	ТаблицаДанныхОтчета.Колонки.Добавить("ПериодОтчетаРодитель",Новый ОписаниеТипов("СправочникСсылка.Периоды"));  
	ТаблицаДанныхОтчета.Колонки.Добавить("ПериодЗаписи",Новый ОписаниеТипов("Дата"));
	Возврат ТаблицаДанныхОтчета;
КонецФункции    
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеТаблицыЗаполненияКосвенные(ПризнакТаблицы)  	
	ТаблицаДанныхОтчета = Новый ТаблицаЗначений;     
	ТаблицаДанныхОтчета.Колонки.Добавить("Направление",Новый ОписаниеТипов("Строка"));//Направление  
	ТаблицаДанныхОтчета.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));//Проект  
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяЗатрат",Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));//СтатьяЗатрат 
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяЗатратКод",Новый ОписаниеТипов("Строка"));//СтатьяЗатрат
	ТаблицаДанныхОтчета.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));//Сумма
	ТаблицаДанныхОтчета.Колонки.Добавить("ПериодОтчета",Новый ОписаниеТипов("СправочникСсылка.Периоды"));   
	ТаблицаДанныхОтчета.Колонки.Добавить("ПериодОтчетаРодитель",Новый ОписаниеТипов("СправочникСсылка.Периоды"));
	ТаблицаДанныхОтчета.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));//Организация	  
	ТаблицаДанныхОтчета.Колонки.Добавить("ПорядокСортировки_СтатьяЗатрат",Новый ОписаниеТипов("Число"));
    ТаблицаДанныхОтчета.Колонки.Добавить("ПериодЗаписи",Новый ОписаниеТипов("Дата"));   
	
	ТаблицаДанныхОтчета.Колонки.Добавить("СуммаФакт",Новый ОписаниеТипов("Число"));//Сумма

	
	Возврат ТаблицаДанныхОтчета;
КонецФункции    
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеТаблицыЗаполненияКосвенныеФакт(ПризнакТаблицы)  	
	ТаблицаДанныхОтчета = Новый ТаблицаЗначений;     
	ТаблицаДанныхОтчета.Колонки.Добавить("Направление",Новый ОписаниеТипов("Строка"));//Направление  
	ТаблицаДанныхОтчета.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));//Проект  
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяЗатрат",Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));//СтатьяЗатрат 
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяЗатратКод",Новый ОписаниеТипов("Строка"));//СтатьяЗатрат 
	ТаблицаДанныхОтчета.Колонки.Добавить("СтатьяДоходовРасходов",Новый ОписаниеТипов("СправочникСсылка.СтатьиДоходовИРасходов"));//СтатьяДоходовРасходов
	ТаблицаДанныхОтчета.Колонки.Добавить("НазначениеПлатежа",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));//НазначениеПлатежа  
	ТаблицаДанныхОтчета.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("Строка"));//Контрагент    
	ТаблицаДанныхОтчета.Колонки.Добавить("Регион",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));//Регион
	ТаблицаДанныхОтчета.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));//Сумма
	ТаблицаДанныхОтчета.Колонки.Добавить("ПериодОтчета",Новый ОписаниеТипов("СправочникСсылка.Периоды"));   
	ТаблицаДанныхОтчета.Колонки.Добавить("ПериодОтчетаРодитель",Новый ОписаниеТипов("СправочникСсылка.Периоды"));
	ТаблицаДанныхОтчета.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));//Организация	  
	ТаблицаДанныхОтчета.Колонки.Добавить("ПорядокСортировки_СтатьяЗатрат",Новый ОписаниеТипов("Число"));
    ТаблицаДанныхОтчета.Колонки.Добавить("ПериодЗаписи",Новый ОписаниеТипов("Дата"));   
	
	ТаблицаДанныхОтчета.Колонки.Добавить("СуммаФакт",Новый ОписаниеТипов("Число"));//Сумма

	ТаблицаДанныхОтчета.Колонки.Добавить("ПереводПроект",Новый ОписаниеТипов("Строка"));//Сумма

	Возврат ТаблицаДанныхОтчета;
КонецФункции 
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПеридовОтчета()    
	тПериодыОтчета  = Новый Массив;
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Январь 2025 г."));  
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Февраль 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Март 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Апрель 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Май 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Июнь 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Июль 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Август 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Сентябрь 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Октябрь 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Ноябрь 2025 г."));
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Декабрь 2025 г."));
	Возврат тПериодыОтчета;
КонецФункции   
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьЗначенияОтбора()Экспорт  
	Возврат Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("615-ПП");
КонецФункции 
// <Добавляет строку в общий отчет перед выводом>
//
// Параметры:
//  <Стр>  											- <НаборДаных> 		- <Текущая строка данных>
//                 
//  <СтруктураПараметров> 							- <Структура>  		- <Структура дополнительных параметров>
//                  
//  <ТаблицаДанных>  								- <ТаблицаЗначений> - <Текущая таблица, в которую добавляется данные по строкам>
//                 
//  <СоответствиеПроектовБЛ>  						- <Соответствие> 	- <Для приведения технических проектов к общим проектам ГК>
//                 
//  <СоответствияПорядкаСортировкиСтатьиЗатрат>  	- <Соответствие> 	- <Для упорядочивания сортировки по статье затрат>
//                
//
Процедура ДобавлениеСтрокиВОбщийОтчет(Стр,СтруктураПараметров,ТаблицаДанных,СоответствиеПроектовБЛ,СоответствияПорядкаСортировкиСтатьиЗатрат)

	ЭтоВалюта = Ложь;
	Если СокрЛП(Стр.Показатель.Код) = "CAPEX_СуммаМесВалюта" Или СокрЛП(Стр.Показатель.Код) = "ИТПостоянные_СуммаМесВалюта" Тогда  
		ЭтоВалюта = Истина;	
	КонецЕсли;
	    	
	ПроектБЛ = СоответствиеПроектовБЛ.Получить(СтруктураПараметров.АналитикаПроектНаименование);     
	
	Если СтруктураПараметров.ПризнакПереводаПроекта Тогда    
		АналитикаПроект_Сопоставленная = СтруктураПараметров.ПроектПеревода_Косвенные;	
	Иначе
		АналитикаПроект_Сопоставленная = ?(ПроектБЛ<>Неопределено,ПроектБЛ,СтруктураПараметров.АналитикаПроект); 
	КонецЕсли;   
		
	Если АналитикаПроект_Сопоставленная.Код = "000000006"
		ИЛИ АналитикаПроект_Сопоставленная.Код = "000000038"  Тогда  //Косвенные   
		
		Если СтруктураПараметров.ОбрабатыватьКосвенные Тогда
			
			НовСтр = СтруктураПараметров.ТаблицаДанных_Косвенные.Добавить();  
			НовСтр.Проект = АналитикаПроект_Сопоставленная;  
			НовСтр.СтатьяЗатрат = Стр.Аналитика2;    
			НовСтр.СтатьяЗатратКод = СокрЛП(Стр.Аналитика2.Код); 
			НовСтр.Направление = ПолучениеПризнакаНаправления(НовСтр,Стр,СтруктураПараметров);
			Если НРег(Стр.Справочно) = "парковка сотрудников" Тогда  
				НовСтр.Сумма = Стр.ЗначениеСуммма * 0.5;	
			Иначе  
				Если Стр.ПравилоОбработки.Наименование = "ИТ_ЦРЭ_Косвенные_Разработка_и_Сопров_ПО_Прогноз (ЦРЭ)" Тогда
					НовСтр.Сумма = ?(СтруктураПараметров.ПроцентБЛ = Неопределено, Стр.ЗначениеСуммма, (Стр.ЗначениеСуммма * СтруктураПараметров.ПроцентБЛ)/ 100) * ?(ЭтоВалюта,100,1); 	
				Иначе
					НовСтр.Сумма = ?(СтруктураПараметров.ПроцентБЛ = Неопределено, Стр.ЗначениеСуммма, (Стр.ЗначениеСуммма * СтруктураПараметров.ПроцентБЛ)/ 100) * ?(ЭтоВалюта,100,1);  
				КонецЕсли;
			КонецЕсли;	
			НовСтр.ПериодОтчета = Стр.ПериодОтчета; 
			НовСтр.ПериодЗаписи = НовСтр.ПериодОтчета.ДатаНачала;
			НовСтр.Организация = СтруктураПараметров.Организация;       
			Если Стр.НДС <> NULL Тогда   
				СтрокаНДС = СтруктураПараметров.ТаблицаДанных_Косвенные.Добавить();  
				СтрокаНДС.Проект = НовСтр.Проект;
				СтрокаНДС.Направление = НовСтр.Направление; 
				СтрокаНДС.ПериодОтчета = НовСтр.ПериодОтчета;    
				СтрокаНДС.ПериодОтчетаРодитель = НовСтр.ПериодОтчета.Родитель;
				СтрокаНДС.Организация = НовСтр.Организация;
				СтрокаНДС.Сумма = -(НовСтр.Сумма * Стр.НДС) / (Стр.НДС+1);	
				СтрокаНДС.ПериодЗаписи = СтрокаНДС.ПериодОтчета.ДатаНачала; 
			КонецЕсли;
			Возврат; 
		КонецЕсли;
	КонецЕсли;	
	  	
	НовСтр = ТаблицаДанных.Добавить(); 
	НовСтр.Проект = АналитикаПроект_Сопоставленная;  
	
	//Если Проект ST+НСИ, тогда объединяем его с проектом SalesTech 
	Если НовСтр.Проект.Код = "000000019" Тогда  
		НовСтр.Проект = СтруктураПараметров.SalesTech_Проект;	
	ИначеЕсли НовСтр.Проект.Код = "000000038" Тогда //Польза
		НовСтр.Проект = СтруктураПараметров.ПроектПеревода_Косвенные;   
	ИначеЕсли НовСтр.Проект.Код = "000000012" Тогда //Проектный офис
		НовСтр.Проект = СтруктураПараметров.Поставщики_Проект;	  
	ИначеЕсли НовСтр.Проект.Код = "000000014" Тогда //Проект "Перевод ЦРЭ" 
		НовСтр.Проект = СтруктураПараметров.ПроектПеревода_Косвенные; 	
	КонецЕсли;
	
	//{Воронков А.Д. 06.05.2025
	//Задача: https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409004/
	Если НовСтр.СтатьяЗатрат.Код =  "00-000021" Тогда //Резерв на отпуск  
		НовСтр.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("00-000017");//ФОТ    
		НовСтр.СтатьяЗатратКод = СокрЛП(НовСтр.СтатьяЗатрат.Код); 
		НовСтр.СтатьяДоходовРасходов = Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("00-000064");	//Резерв на отпуск			
	Иначе
		НовСтр.СтатьяЗатрат = Стр.Аналитика2;    
		НовСтр.СтатьяЗатратКод = СокрЛП(Стр.Аналитика2.Код); 	
		НовСтр.СтатьяДоходовРасходов = Стр.Аналитика3;
	КонецЕсли;
	//--}
	
	НовСтр.Направление = ПолучениеПризнакаНаправления(НовСтр,Стр,СтруктураПараметров);      	
	НовСтр.НазначениеПлатежа = Стр.Аналитика4;
	НовСтр.Контрагент = СокрЛП(Стр.Аналитика5);
	НовСтр.Регион = Стр.Аналитика6;       
	Если НРег(Стр.Справочно) = "парковка сотрудников" Тогда  
		НовСтр.Сумма = Стр.ЗначениеСуммма * 0.5;	
	Иначе  
		Если Стр.ПравилоОбработки.Наименование = "ИТ_ЦРЭ_Косвенные_Разработка_и_Сопров_ПО_Прогноз (ЦРЭ)" Тогда
			НовСтр.Сумма = ?(СтруктураПараметров.ПроцентБЛ = Неопределено, Стр.ЗначениеСуммма, (Стр.ЗначениеСуммма * СтруктураПараметров.ПроцентБЛ)/ 100) * ?(ЭтоВалюта,100,1); 	
		Иначе
			НовСтр.Сумма = ?(СтруктураПараметров.ПроцентБЛ = Неопределено, Стр.ЗначениеСуммма, (Стр.ЗначениеСуммма * СтруктураПараметров.ПроцентБЛ)/ 100) * ?(ЭтоВалюта,100,1);  
		КонецЕсли;
	КонецЕсли;
	НовСтр.ПериодОтчета = Стр.ПериодОтчета; 
	НовСтр.ПериодЗаписи = НовСтр.ПериодОтчета.ДатаНачала;
	НовСтр.ПериодОтчетаРодитель = Стр.ПериодОтчета.Родитель;

	
	НовСтр.КодГруппыВидаОтчета = Стр.КодГруппыВидаОтчета;   				
	НовСтр.Организация = СтруктураПараметров.Организация; 
		
	//Добавим дополнительно строку с НДС
	Если Стр.НДС <> NULL Тогда     
		ДобавлениеСтрокиНДСВОбщийОтчет(ТаблицаДанных,НовСтр,Стр.НДС);
	КонецЕсли;	
	
КонецПроцедуры // ДобавлениеСтрокиВОбщийОтчет()  
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПризнакаНаправления(НовСтр,Стр,СтруктураПараметров)
	
	Если СтруктураПараметров.Свойство("ДляПлана") Тогда 		
		Если НовСтр.СтатьяЗатратКод = "00-000018" ИЛИ НовСтр.СтатьяЗатратКод = "00-000019" Тогда  
			Направление = "Мотивация";   
		ИначеЕсли НовСтр.СтатьяЗатратКод = "00-000017" И Стр.Аналитика3.Код = "00-000053" И СокрЛП(Стр.Показатель.Код) = "Вакансии_ОкладРубGross"  Тогда
			Направление = "ОРЕХ";	 
		ИначеЕсли НовСтр.СтатьяЗатратКод = "00-000017" И Стр.Аналитика3.Код = "00-000053" И СокрЛП(Стр.Показатель.Код) = "Вакансии_ФОТНалоги"  Тогда  
			Направление = "ОРЕХ"; 
			НовСтр.СтатьяЗатрат = СтруктураПараметров.СтатьяЗатрат_ФОТНалоги;   
			НовСтр.СтатьяЗатратКод = СокрЛП(НовСтр.СтатьяЗатрат.Код); 
		ИначеЕсли НовСтр.СтатьяЗатратКод = "00-000017" И Стр.Аналитика3.Код = "00-000053" Тогда
			Направление = "Мотивация";  			 
			НовСтр.СтатьяЗатрат = СтруктураПараметров.СтатьяЗатрат_Мотивация;   
			НовСтр.СтатьяЗатратКод = СокрЛП(НовСтр.СтатьяЗатрат.Код);     
		ИначеЕсли НовСтр.СтатьяЗатратКод = "00-000011" И Стр.Аналитика3.Код = "00-000008" И СокрЛП(Стр.Показатель.Код) = "ПрочиеАХО1_Расходники" 
			ИЛИ НовСтр.СтатьяЗатрат.Код = "00-000011" И Стр.Аналитика3.Код = "00-000025" И СокрЛП(Стр.Показатель.Код) = "Питание_Питание" Тогда 
			Направление = "ОРЕХ";
		Иначе
			Направление = "ОРЕХ";	
		КонецЕсли;   
	Иначе   
		Если НовСтр.СтатьяЗатратКод = "00-000018" ИЛИ НовСтр.СтатьяЗатратКод = "00-000019" Тогда   
			Направление = "Мотивация";	
		Иначе 
			Направление = "ОРЕХ";			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Направление;

КонецФункции // ПолучениеПризнакаНаправления()
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//
Процедура ДобавлениеСтрокиНДСВОбщийОтчет(ТаблицаДанных,НовСтр,НДС)
	СтрокаНДС = ТаблицаДанных.Добавить();  
	СтрокаНДС.Проект = НовСтр.Проект;
	СтрокаНДС.СтатьяЗатрат = НовСтр.СтатьяЗатрат; 
	СтрокаНДС.Направление = НовСтр.Направление;
	СтрокаНДС.СтатьяДоходовРасходов = НовСтр.СтатьяДоходовРасходов;
	СтрокаНДС.НазначениеПлатежа = НовСтр.НазначениеПлатежа;   
	СтрокаНДС.Контрагент = "Контрагент НДС"; 
	СтрокаНДС.ПериодОтчета = НовСтр.ПериодОтчета;   
	СтрокаНДС.ПериодЗаписи = СтрокаНДС.ПериодОтчета.ДатаНачала; 
	СтрокаНДС.ПериодОтчетаРодитель = НовСтр.ПериодОтчета.Родитель; 
	СтрокаНДС.Организация = НовСтр.Организация;
	СтрокаНДС.Сумма = -(НовСтр.Сумма * НДС) / (НДС+1);
	СтрокаНДС.ПорядокСортировки_СтатьяЗатрат = НовСтр.ПорядокСортировки_СтатьяЗатрат;
КонецПроцедуры // ДобавлениеСтрокиНДСВОбщийОтчет()
// <Возвращает признак проверки обязательных отоборов в зависимости от пользователя>
// Воронков А.Д.
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПризнакаПроверкиОбязательныхОтборов(ПризнакПроверки)  
	//{Воронков А.Д. 06.06.2025 ++      	
	РольДоступна = ОбщегоПользованияУХ.ЕстьРоль("АдминистраторСистемы",ПользователиКлиентСервер.ТекущийПользователь());    
	Если НЕ РольДоступна Тогда
		ТаблицаПроектыОрганизации = ПолучениеДанныхПроектовПользователей(ПользователиКлиентСервер.ТекущийПользователь());
		НастройкиОтчета = КомпоновщикНастроек.ПользовательскиеНастройки;
		
		ТаблицаСоответствийПользовательскихОтборов = ПолучениеТаблицыСоответствийПользовательскихОтборов();
		
		Для Каждого ЭлОтбора Из ТаблицаПроектыОрганизации Цикл 
			ИндексОтбора = ТаблицаСоответствийПользовательскихОтборов.Получить(ЭлОтбора.ИмяКолонки); 
			Если ИндексОтбора <> Неопределено Тогда   
				ЭлементОтбораКомпоновки    = НастройкиОтчета.Элементы[ИндексОтбора];
				Если ЭлОтбора.ИспользоватьОтбор Тогда 
					Если Не ЗначениеЗаполнено(ЭлементОтбораКомпоновки.ПравоеЗначение) ИЛИ НЕ ЭлементОтбораКомпоновки.Использование Тогда  
						ТекстОшибки = "Не заполнено поле отбора - "+ЭлОтбора.ИмяКолонки;					     
						Возврат Ложь;								
					КонецЕсли;		
				КонецЕсли;			
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;	
	//--} 
КонецФункции   
// <Возвращает список значений проектов пользователя информационной базы>
//
// Параметры:
//  <Пользователь>  - <СправочникСсылка.Пользователи> - <Ссылка на пользователя информационной базы>
//               
// Возвращаемое значение:
//   <СписокЗначений>   - <Список значений проектов по заданному пользователю. Если проекты не указаны, возвращается пустой список значений>
//
Функция ПолучениеДанныхПроектовПользователей(Пользователь)

	ЗначенияДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
	//{Воронков А.Д. 05.06.2025 ++ 
		//"ВЫБРАТЬ
		//|	ПроектыПользователейПроекты.Проект КАК Проект,
		//|	ПроектыПользователейПроекты.Ссылка.Организация КАК Организация
		//|ИЗ
		//|	Справочник.ПроектыПользователей.Проекты КАК ПроектыПользователейПроекты
		//|ГДЕ
		//|	ПроектыПользователейПроекты.Ссылка.Пользователь = &Пользователь
		//|";
     //--}
		"ВЫБРАТЬ
		|	ПроектыПользователейПроекты.Проект КАК Проект,
		|	NULL КАК СтатьяЗатрат,
		|	NULL КАК Организация,
		|	NULL КАК СтатьяДоходовРасходов,
		|	NULL КАК НазначениеПлатежа
		|ИЗ
		|	Справочник.ПроектыПользователей.Проекты КАК ПроектыПользователейПроекты
		|ГДЕ
		|	ПроектыПользователейПроекты.Ссылка.Пользователь = &Пользователь
		|	И НЕ ПроектыПользователейПроекты.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ПроектыПользователейСтатьиЗатрат.СтатьяЗатрат,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.ПроектыПользователей.СтатьиЗатрат КАК ПроектыПользователейСтатьиЗатрат
		|ГДЕ
		|	ПроектыПользователейСтатьиЗатрат.Ссылка.Пользователь = &Пользователь
		|	И НЕ ПроектыПользователейСтатьиЗатрат.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	ПроектыПользователейСтатьиДоходовРасходов.СтатьяДоходовРасходов,
		|	NULL
		|ИЗ
		|	Справочник.ПроектыПользователей.СтатьиДоходовРасходов КАК ПроектыПользователейСтатьиДоходовРасходов
		|ГДЕ
		|	НЕ ПроектыПользователейСтатьиДоходовРасходов.Ссылка.ПометкаУдаления
		|	И ПроектыПользователейСтатьиДоходовРасходов.Ссылка.Пользователь = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	ПроектыПользователейОрганизация.Организация,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.ПроектыПользователей.Организация КАК ПроектыПользователейОрганизация
		|ГДЕ
		|	НЕ ПроектыПользователейОрганизация.Ссылка.ПометкаУдаления
		|	И ПроектыПользователейОрганизация.Ссылка.Пользователь = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ПроектыПользователейНазначениеПлатежа.НазначениеПлатежа
		|ИЗ
		|	Справочник.ПроектыПользователей.НазначениеПлатежа КАК ПроектыПользователейНазначениеПлатежа
		|ГДЕ
		|	НЕ ПроектыПользователейНазначениеПлатежа.Ссылка.ПометкаУдаления
		|	И ПроектыПользователейНазначениеПлатежа.Ссылка.Пользователь = &Пользователь
		|";
	 	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();    
	
	МассивОтборов = Новый Массив;
	
	Для Каждого КолонкаОтбора Из РезультатЗапроса.Колонки Цикл     
		МассивЗначенийОтбора = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РезультатЗапроса.ВыгрузитьКолонку(КолонкаОтбора.Имя));
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияТипаИзМассива(МассивЗначенийОтбора,Тип("Null"));	
		Если МассивЗначенийОтбора.Количество() >= 1 Тогда  			
			СтруктутраОтборов = Новый Структура("ИмяКолонки,МассивЗначенийОтбора,ИспользоватьОтбор",КолонкаОтбора.Имя,МассивЗначенийОтбора,Истина);
		Иначе
			СтруктутраОтборов = Новый Структура("ИмяКолонки,МассивЗначенийОтбора,ИспользоватьОтбор",КолонкаОтбора.Имя,МассивЗначенийОтбора,Ложь);	
		КонецЕсли;  
		МассивОтборов.Добавить(СтруктутраОтборов);
	КонецЦикла;    
		
	Возврат МассивОтборов;  
	
КонецФункции // ПолучениеДанныхПроектовПользователей()    
Функция ПолучениеТаблицыСоответствийПользовательскихОтборов()
	ТаблицаСоответствийПользовательскихОтборов = Новый Соответствие;
	ТаблицаСоответствийПользовательскихОтборов.Вставить("Проект",2);
	ТаблицаСоответствийПользовательскихОтборов.Вставить("СтатьяЗатрат",3);  
	ТаблицаСоответствийПользовательскихОтборов.Вставить("СтатьяДоходовРасходов",4);   
	ТаблицаСоответствийПользовательскихОтборов.Вставить("НазначениеПлатежа",5);
	ТаблицаСоответствийПользовательскихОтборов.Вставить("Организация",6);				
	 Возврат ТаблицаСоответствийПользовательскихОтборов;     
	
	//ТаблицаСоответствийПользовательскихОтборов = Новый Соответствие;
	////ТаблицаСоответствийПользовательскихОтборов.Вставить("Проект",1);
	//ТаблицаСоответствийПользовательскихОтборов.Вставить("СтатьяЗатрат",1);  
	//ТаблицаСоответствийПользовательскихОтборов.Вставить("СтатьяДоходовРасходов",2);   
	////ТаблицаСоответствийПользовательскихОтборов.Вставить("НазначениеПлатежа",4);
	////ТаблицаСоответствийПользовательскихОтборов.Вставить("Организация",5);				
	// Возврат ТаблицаСоответствийПользовательскихОтборов;

КонецФункции // ПолучениеПолейОбязательногоОтбораПоПользователю()
// <Возвращает список значений принадлежности кода группы видов отчета к организации>
//
//
// Возвращаемое значение:
//   <СписокЗначений>   - <Список значений принадлежности кода группы видов отчета к организации>
//
Функция ПолучениеСоотвествияВидОтчетаОрагнизационнаяЕдиница()
РТСТ = Справочники.Организации.НайтиПоРеквизиту("ИНН","7710357167");
	ЦРЭ = Справочники.Организации.НайтиПоРеквизиту("ИНН","5034031535");
	ОТС = Справочники.Организации.НайтиПоРеквизиту("ИНН","7708699893");
	Академия = Справочники.Организации.НайтиПоРеквизиту("ИНН","9718036602");
	Холдинг = Справочники.Организации.НайтиПоРеквизиту("ИНН","7723825581");
	Силует = Справочники.Организации.НайтиПоРеквизиту("ИНН","7720745867");
	Текса = Справочники.Организации.НайтиПоРеквизиту("ИНН","9718151838");     
    ОЛ = Справочники.Организации.НайтиПоРеквизиту("ИНН","7725320554");   
	
	
	ТаблСоответсвия = Новый Соответствие;
	ТаблСоответсвия.Вставить("Аренда_Группа_РТС",РТСТ);  
	ТаблСоответсвия.Вставить("ИТПостоянные1",РТСТ);
	ТаблСоответсвия.Вставить("CAPEX_Группа_РТС",РТСТ);
	ТаблСоответсвия.Вставить("ИБ_Группа_РТС",РТСТ);
	ТаблСоответсвия.Вставить("ИТРазработкаИСопровождениеПО1",РТСТ);
	ТаблСоответсвия.Вставить("ИТПостосянные1",РТСТ); 
	ТаблСоответсвия.Вставить("Прочие",РТСТ);
	ТаблСоответсвия.Вставить("ПрочиеКадры",РТСТ); 
	ТаблСоответсвия.Вставить("РазвитиеБизнеса_Группа_РТС",РТСТ); 
	ТаблСоответсвия.Вставить("ЮридическиеРасходы_Группа_РТС",РТСТ);   
	ТаблСоответсвия.Вставить("Обучение_Группа_РТС",РТСТ); 
	ТаблСоответсвия.Вставить("ИзменениеОклада10",РТСТ);    
	ТаблСоответсвия.Вставить("ИзмОкл10",РТСТ);   
	ТаблСоответсвия.Вставить("Вакансии11",РТСТ);
	
	//{ЦРЭ ++
	ТаблСоответсвия.Вставить("Аренда_Группа_ЦРЭ",ЦРЭ);   
	ТаблСоответсвия.Вставить("CAPEX_Группа_ЦРЭ",ЦРЭ);
	ТаблСоответсвия.Вставить("ИБ_Группа_ЦРЭ",ЦРЭ);
	ТаблСоответсвия.Вставить("ИТРазработкаИСопровождениеПО2",ЦРЭ); //Обрабатываем отдельно
	ТаблСоответсвия.Вставить("ИТПостоянные6",ЦРЭ); 
	ТаблСоответсвия.Вставить("Прочие_ЦРЭ",ЦРЭ);
	ТаблСоответсвия.Вставить("Обучение_Группа_ЦРЭ",ЦРЭ); 
	ТаблСоответсвия.Вставить("РазвитиеБизнеса_Группа_ЦРЭ",ЦРЭ); 
	ТаблСоответсвия.Вставить("ЮридическиеРасходы_Группа_ЦРЭ",ЦРЭ); 
	ТаблСоответсвия.Вставить("ИзменениеОклада11",ЦРЭ); 
	ТаблСоответсвия.Вставить("ИзмОкл11",ЦРЭ);
	ТаблСоответсвия.Вставить("Вакансии12",ЦРЭ); 
	ТаблСоответсвия.Вставить("МазуринАВГрейдыЦРЭ",ЦРЭ);
	//--}    
	
	//{ОТС ++
	ТаблСоответсвия.Вставить("Аренда_Группа_ОТС",ОТС);   
	ТаблСоответсвия.Вставить("CAPEX_Группа_ОТС",ОТС);
	ТаблСоответсвия.Вставить("ИБ_Группа_ОТС",ОТС);
	ТаблСоответсвия.Вставить("ИТПостоянные7",ОТС);
	ТаблСоответсвия.Вставить("Прочие_ОТС",ОТС);
	ТаблСоответсвия.Вставить("РазвитиеБизнеса_Группа_ОТС",ОТС);
	ТаблСоответсвия.Вставить("ЮридическиеРасходы_Группа_ОТС",ОТС); 
	ТаблСоответсвия.Вставить("Обучение_Группа_ОТС",ОТС); 
	ТаблСоответсвия.Вставить("ИзменениеОклада12",ОТС);   
	ТаблСоответсвия.Вставить("ИзмОкл12",ОТС); 
	ТаблСоответсвия.Вставить("Вакансии13",ОТС);
	//--}  
	
	//{Академия ++
	ТаблСоответсвия.Вставить("Аренда",Академия);   
	ТаблСоответсвия.Вставить("ИТПостоянные2",Академия);
	ТаблСоответсвия.Вставить("РазвитиеБизнеса",Академия);
	ТаблСоответсвия.Вставить("ЮридическиеРасходы",Академия);  
	ТаблСоответсвия.Вставить("ИзменениеОклада14",Академия);   
	ТаблСоответсвия.Вставить("ИзмОкл14",Академия); 
	//--}   
	
	//{Холдинг ++
	ТаблСоответсвия.Вставить("Аренда3",Холдинг);   
	ТаблСоответсвия.Вставить("ИТПостоянные5",Холдинг);
	ТаблСоответсвия.Вставить("ЮридическиеРасходы3",Холдинг);
	ТаблСоответсвия.Вставить("ИзменениеОклада17",Холдинг);
	//--}  
	
	//{Силует ++
	ТаблСоответсвия.Вставить("Аренда1",Силует);   
	ТаблСоответсвия.Вставить("ИТПостоянные3",Силует);
	ТаблСоответсвия.Вставить("ЮридическиеРасходы1",Силует); 
	ТаблСоответсвия.Вставить("ИзменениеОклада15",Силует); 
	ТаблСоответсвия.Вставить("ИзмОкл15",Силует);
	//--}   
	
	//{Текса ++
	ТаблСоответсвия.Вставить("Аренда2",Текса);   
	ТаблСоответсвия.Вставить("ИТПостоянные4",Текса);
	ТаблСоответсвия.Вставить("РазвитиеБизнесаТекса",Текса);
	ТаблСоответсвия.Вставить("ЮридическиеРасходы2",Текса);
	ТаблСоответсвия.Вставить("ИзменениеОклада16",Текса);  
	ТаблСоответсвия.Вставить("ИзмОкл16",Текса);       
	ТаблСоответсвия.Вставить("Прочие3",Текса);  
	ТаблСоответсвия.Вставить("Вакансии14",Текса); 
	//--}          
	
	//{ОЛ ++   
	ТаблСоответсвия.Вставить("ИзмОклад_Сводный",ОЛ); 
	ТаблСоответсвия.Вставить("ИзменениеОклада13",ОЛ);  
	ТаблСоответсвия.Вставить("Аренда_Группа_ОЛ",ОЛ);   
	ТаблСоответсвия.Вставить("ЮридическиеРасходы7",ОЛ); 
	ТаблСоответсвия.Вставить("РазвитиеБизнеса4",ОЛ); 
	ТаблСоответсвия.Вставить("ИТПостоянные11",ОЛ); 
	ТаблСоответсвия.Вставить("Аренда8",ОЛ);
	//--}
	
	Возврат ТаблСоответсвия;	
КонецФункции // ПолучениеСоотвествияВидОтчетаОрагнизационнаяЕдиница()
// <Возвращает список значений принаджлежности технического проекта к обобщенному проекту по группе компаний>
//
//
// Возвращаемое значение:
//   <СписокЗначений>   - <Список значений принаджлежности технического проекта к обобщенному проекту по группе компаний>
//
Функция СоответствиеПроектовБЛ()
    ВладелецСправочника = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Проект");

	СоответствиеПроектов = Новый Соответствие;    
	СоответствиеПроектов.Вставить("Sales Tech3",Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Sales Tech",,,ВладелецСправочника));    
	СоответствиеПроектов.Вставить("ST+НСИ2",Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("ST+НСИ",,,ВладелецСправочника));
	СоответствиеПроектов.Вставить("Капитал2",Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Капитал",,,ВладелецСправочника));
	СоответствиеПроектов.Вставить("Капитал3",Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Капитал",,,ВладелецСправочника));
	СоответствиеПроектов.Вставить("Косвенные2",Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Косвенные",,,ВладелецСправочника));
	СоответствиеПроектов.Вставить("Косвенные4",Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Косвенные",,,ВладелецСправочника));
	СоответствиеПроектов.Вставить("Поставщики2",Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Поставщики",,,ВладелецСправочника));
	
    Возврат СоответствиеПроектов;
КонецФункции // СоответствиеПроектовБЛ()
// <Возвращает массив кодов групп отчетов для формирования отчета>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <Массив кодов групп отчетов>
//
Функция ПолучениеМассиваКодовГруппОтчетов()

	МассивКодовГруппОтчетов = Новый Массив; 
	//{РТСТ ++   
	МассивКодовГруппОтчетов.Добавить("Аренда_Группа_РТС"); 
	МассивКодовГруппОтчетов.Добавить("CAPEX_Группа_РТС");  
	МассивКодовГруппОтчетов.Добавить("ИБ_Группа_РТС"); 
	МассивКодовГруппОтчетов.Добавить("ИТРазработкаИСопровождениеПО1");   
	МассивКодовГруппОтчетов.Добавить("ИТПостоянные1");
	МассивКодовГруппОтчетов.Добавить("Прочие");    
	МассивКодовГруппОтчетов.Добавить("ПрочиеКадры");
	МассивКодовГруппОтчетов.Добавить("ЮридическиеРасходы_Группа_РТС");
	МассивКодовГруппОтчетов.Добавить("РазвитиеБизнеса_Группа_РТС");
	МассивКодовГруппОтчетов.Добавить("Обучение_Группа_РТС");
	МассивКодовГруппОтчетов.Добавить("ИзменениеОклада10");   
	МассивКодовГруппОтчетов.Добавить("ИзмОкл10"); 
	МассивКодовГруппОтчетов.Добавить("Вакансии11");

	//--}
	
	//{ЦРЭ ++   
	МассивКодовГруппОтчетов.Добавить("Аренда_Группа_ЦРЭ");
	МассивКодовГруппОтчетов.Добавить("CAPEX_Группа_ЦРЭ");  
	МассивКодовГруппОтчетов.Добавить("ИБ_Группа_ЦРЭ"); 
	МассивКодовГруппОтчетов.Добавить("ИТРазработкаИСопровождениеПО2"); //Обрабатываем отдельно 
	МассивКодовГруппОтчетов.Добавить("ИТПостоянные6");
	МассивКодовГруппОтчетов.Добавить("Прочие_ЦРЭ"); 
	МассивКодовГруппОтчетов.Добавить("Обучение_Группа_ЦРЭ");
	МассивКодовГруппОтчетов.Добавить("РазвитиеБизнеса_Группа_ЦРЭ");   
	МассивКодовГруппОтчетов.Добавить("ЮридическиеРасходы_Группа_ЦРЭ");
	МассивКодовГруппОтчетов.Добавить("ИзменениеОклада11");  
	МассивКодовГруппОтчетов.Добавить("ИзмОкл11");
	МассивКодовГруппОтчетов.Добавить("Вакансии12"); 
	МассивКодовГруппОтчетов.Добавить("МазуринАВГрейдыЦРЭ");	
	//--}   
	
	//{ОТС ++   
	МассивКодовГруппОтчетов.Добавить("Аренда_Группа_ОТС"); 
	МассивКодовГруппОтчетов.Добавить("CAPEX_Группа_ОТС");  
	МассивКодовГруппОтчетов.Добавить("ИБ_Группа_ОТС"); 
	МассивКодовГруппОтчетов.Добавить("ИТПостоянные7");   
	МассивКодовГруппОтчетов.Добавить("Прочие_ОТС");
	МассивКодовГруппОтчетов.Добавить("РазвитиеБизнеса_Группа_ОТС");  
	МассивКодовГруппОтчетов.Добавить("ЮридическиеРасходы_Группа_ОТС"); 
	МассивКодовГруппОтчетов.Добавить("Обучение_Группа_ОТС"); 
	МассивКодовГруппОтчетов.Добавить("ИзменениеОклада12");    
	МассивКодовГруппОтчетов.Добавить("ИзмОкл12");
	МассивКодовГруппОтчетов.Добавить("Вакансии13");
	//--}  
	
	//{РТС-А ++ 
	МассивКодовГруппОтчетов.Добавить("Аренда");
	МассивКодовГруппОтчетов.Добавить("ИТПостоянные2");  
	МассивКодовГруппОтчетов.Добавить("РазвитиеБизнеса"); 
	МассивКодовГруппОтчетов.Добавить("ЮридическиеРасходы");
	МассивКодовГруппОтчетов.Добавить("ИзменениеОклада14");   
	МассивКодовГруппОтчетов.Добавить("ИзмОкл14");
	//--}  
	
	//{Холдинг ++ 
	МассивКодовГруппОтчетов.Добавить("Аренда3");
	МассивКодовГруппОтчетов.Добавить("ИТПостоянные5");  
	МассивКодовГруппОтчетов.Добавить("ЮридическиеРасходы3");  
	МассивКодовГруппОтчетов.Добавить("ИзменениеОклада17");
	//--}    
	
	//{Силуэт ++ 
	МассивКодовГруппОтчетов.Добавить("Аренда1"); 
	МассивКодовГруппОтчетов.Добавить("ИТПостоянные3");  
	МассивКодовГруппОтчетов.Добавить("ЮридическиеРасходы1"); 
	МассивКодовГруппОтчетов.Добавить("ИзменениеОклада15");  
	МассивКодовГруппОтчетов.Добавить("ИзмОкл15"); 
	//--}

    //{Текса ++    
	МассивКодовГруппОтчетов.Добавить("Аренда2");
	МассивКодовГруппОтчетов.Добавить("ИТПостоянные4");  
	МассивКодовГруппОтчетов.Добавить("РазвитиеБизнесаТекса");  
	МассивКодовГруппОтчетов.Добавить("ЮридическиеРасходы2");  
	МассивКодовГруппОтчетов.Добавить("ИзменениеОклада16"); 	
	МассивКодовГруппОтчетов.Добавить("ИзмОкл16");    
	МассивКодовГруппОтчетов.Добавить("Прочие3");      
	МассивКодовГруппОтчетов.Добавить("Вакансии14");
	//--}  
	
	//{ОЛ ++    
	МассивКодовГруппОтчетов.Добавить("ИзмОклад_Сводный"); 
	МассивКодовГруппОтчетов.Добавить("ИзменениеОклада13"); 
	МассивКодовГруппОтчетов.Добавить("Аренда_Группа_ОЛ"); 
	МассивКодовГруппОтчетов.Добавить("ЮридическиеРасходы7");
    МассивКодовГруппОтчетов.Добавить("РазвитиеБизнеса4"); 
	МассивКодовГруппОтчетов.Добавить("ИТПостоянные11"); 
	МассивКодовГруппОтчетов.Добавить("Аренда8");
	//--}

	Возврат МассивКодовГруппОтчетов;

КонецФункции // ПолучениеМассиваКодовГруппОтчетов()
// <Возращает текст запроса по показателям>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Строка>   - <Текст запроса>
//
Функция ТекстЗапросаПоПоказателям()

	Возврат "ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетов6.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6 КАК Аналитика6,
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) КАК Значение,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки КАК ПравилоОбработки,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец КАК ПравилоОбработкиВладелец
	        |ПОМЕСТИТЬ ВТ_Аренда
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК ЗначенияПоказателейОтчетов6
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код В(&ПоказателиЧисловые)
	        |	И ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	        |	И НЕ ЗначенияПоказателейОтчетов6.ПравилоОбработки.Наименование В (&МассивПравилОбработки_НеВключаемВОтчет)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов6.Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетов6.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6 КАК Аналитика6,
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) КАК Значение,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки КАК ПравилоОбработки,
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код КАК ПоказательКод,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец.Родитель.Код КАК ПравилоОбработкиВладелецРодительКод,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец КАК ПравилоОбработкиВладелец,
	        |	ЗначенияПоказателейОтчетов6.Показатель.Владелец КАК ПоказательВладелец
	        |ПОМЕСТИТЬ ВТ_НДС
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК ЗначенияПоказателейОтчетов6
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код В(&ПоказателиНДС)
	        |	И ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетов6.Значение <> 0
	        |	И ЗначенияПоказателейОтчетов6.ПравилоОбработки.Наименование <> ""Полиграфия_РТС_Деп.АХО_Косвенные_Прогноз (РТС)""
	        |	И НЕ ЗначенияПоказателейОтчетов6.ПравилоОбработки.Наименование В (&МассивПравилОбработки_НеВключаемВОтчет)
	        |	И ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета = &ПериодПолученияНДС
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов6.Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки,
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец.Родитель.Код,
	        |	ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец,
	        |	ЗначенияПоказателейОтчетов6.Показатель.Владелец
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6 КАК Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение КАК Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки КАК ПравилоОбработки,
	        |	ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец КАК ПравилоОбработкиВладелец,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Владелец КАК ПоказательВладелец
	        |ПОМЕСТИТЬ ВТ_Справочно_Аренда
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиСтроковые)
	        |	И ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ОсновнаяВерсия
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета = &ПериодПолученияНДС
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки,
	        |	ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Владелец
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6 КАК Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение КАК Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки КАК ПравилоОбработки,
	        |	ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец КАК ПравилоОбработкиВладелец,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Владелец КАК ПоказательВладелец
	        |ПОМЕСТИТЬ ВТ_РасходыКонтактЦентра_Аренда
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиБулево)
	        |	И ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Значение = ИСТИНА
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета = &ПериодПолученияНДС
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки,
	        |	ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Владелец
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Аренда.Показатель КАК Показатель,
	        |	ВТ_Аренда.Аналитика1 КАК Аналитика1,
	        |	ВТ_Аренда.Аналитика2 КАК Аналитика2,
	        |	ВТ_Аренда.Аналитика3 КАК Аналитика3,
	        |	ВТ_Аренда.Аналитика4 КАК Аналитика4,
	        |	ВТ_Аренда.Аналитика5 КАК Аналитика5,
	        |	ВТ_Аренда.Аналитика6 КАК Аналитика6,
	        |	ВТ_Аренда.Значение КАК ЗначениеСуммма,
	        |	ВТ_Аренда.ВерсияПериодОтчета КАК ВерсияПериодОтчета,
	        |	ВТ_Аренда.ПравилоОбработки КАК ПравилоОбработки,
	        |	ВТ_Справочно_Аренда.Значение КАК Справочно,
	        |	ВТ_РасходыКонтактЦентра_Аренда.Значение КАК РасходыКонтактЦентра,
	        |	ВТ_Аренда.ПравилоОбработки.Владелец.Родитель.Код КАК КодГруппыВидаОтчета,
	        |	ВТ_НДС.Значение КАК НДС
	        |ПОМЕСТИТЬ ВТ_Итог_Аренда
	        |ИЗ
	        |	ВТ_Аренда КАК ВТ_Аренда
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Справочно_Аренда КАК ВТ_Справочно_Аренда
	        |		ПО ВТ_Аренда.ПравилоОбработкиВладелец = ВТ_Справочно_Аренда.ПоказательВладелец
	        |			И ВТ_Аренда.Аналитика1 = ВТ_Справочно_Аренда.Аналитика1
	        |			И ВТ_Аренда.Аналитика2 = ВТ_Справочно_Аренда.Аналитика2
	        |			И ВТ_Аренда.Аналитика3 = ВТ_Справочно_Аренда.Аналитика3
	        |			И ВТ_Аренда.Аналитика4 = ВТ_Справочно_Аренда.Аналитика4
	        |			И ВТ_Аренда.Аналитика5 = ВТ_Справочно_Аренда.Аналитика5
	        |			И ВТ_Аренда.Аналитика6 = ВТ_Справочно_Аренда.Аналитика6
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходыКонтактЦентра_Аренда КАК ВТ_РасходыКонтактЦентра_Аренда
	        |		ПО ВТ_Аренда.ПравилоОбработкиВладелец = ВТ_РасходыКонтактЦентра_Аренда.ПоказательВладелец
	        |			И ВТ_Аренда.Аналитика1 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика1
	        |			И ВТ_Аренда.Аналитика2 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика2
	        |			И ВТ_Аренда.Аналитика3 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика3
	        |			И ВТ_Аренда.Аналитика4 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика4
	        |			И ВТ_Аренда.Аналитика5 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика5
	        |			И ВТ_Аренда.Аналитика6 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика6
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НДС КАК ВТ_НДС
	        |		ПО ВТ_Аренда.ПравилоОбработкиВладелец = ВТ_НДС.ПоказательВладелец
	        |			И ВТ_Аренда.Аналитика1 = ВТ_НДС.Аналитика1
	        |			И ВТ_Аренда.Аналитика2 = ВТ_НДС.Аналитика2
	        |			И ВТ_Аренда.Аналитика3 = ВТ_НДС.Аналитика3
	        |			И ВТ_Аренда.Аналитика4 = ВТ_НДС.Аналитика4
	        |			И ВТ_Аренда.Аналитика5 = ВТ_НДС.Аналитика5
	        |			И ВТ_Аренда.Аналитика6 = ВТ_НДС.Аналитика6
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Итог_Аренда.Показатель КАК Показатель,
	        |	ВТ_Итог_Аренда.Аналитика1 КАК Аналитика1,
	        |	ВТ_Итог_Аренда.Аналитика2 КАК Аналитика2,
	        |	ВТ_Итог_Аренда.Аналитика3 КАК Аналитика3,
	        |	ВТ_Итог_Аренда.Аналитика4 КАК Аналитика4,
	        |	ВТ_Итог_Аренда.Аналитика5 КАК Аналитика5,
	        |	ВТ_Итог_Аренда.Аналитика6 КАК Аналитика6,
	        |	ВТ_Итог_Аренда.ЗначениеСуммма КАК ЗначениеСуммма,
	        |	ВТ_Итог_Аренда.ВерсияПериодОтчета КАК ПериодОтчета,
	        |	ВТ_Итог_Аренда.ПравилоОбработки КАК ПравилоОбработки,
	        |	ВЫБОР
	        |		КОГДА ВТ_Итог_Аренда.Справочно ЕСТЬ NULL
	        |			ТОГДА """"
	        |		ИНАЧЕ ВТ_Итог_Аренда.Справочно
	        |	КОНЕЦ КАК Справочно,
	        |	ВЫБОР
	        |		КОГДА ВТ_Итог_Аренда.РасходыКонтактЦентра ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ВТ_Итог_Аренда.РасходыКонтактЦентра
	        |	КОНЕЦ КАК РасходыКонтактЦентра,
	        |	ВЫБОР
	        |		КОГДА ВТ_Итог_Аренда.НДС = 20
	        |			ТОГДА 0.2
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТ_Итог_Аренда.НДС = 0.4
	        |					ТОГДА 0.2
	        |				ИНАЧЕ ВТ_Итог_Аренда.НДС
	        |			КОНЕЦ
	        |	КОНЕЦ КАК НДС,
	        |	ВТ_Итог_Аренда.КодГруппыВидаОтчета КАК КодГруппыВидаОтчета,
	        |	ВТ_Итог_Аренда.ПравилоОбработки.Владелец.Наименование КАК ВидОтчета
	        |ИЗ
	        |	ВТ_Итог_Аренда КАК ВТ_Итог_Аренда
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Аналитика1,
	        |	Аналитика2,
	        |	Аналитика3,
	        |	Аналитика4,
	        |	Аналитика5,
	        |	Аналитика6";	

КонецФункции // ТекстЗапросаПоПоказателям()  
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПроверкаНовогоЗапроса() 	
	Возврат "ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетов6.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6 КАК Аналитика6,
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) КАК Значение,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета КАК ПравилоОбработкиВладелец
	        |ПОМЕСТИТЬ ВТ_ОсновныеДанныеПоСуммам
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК ЗначенияПоказателейОтчетов6
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код В(&ПоказателиЧисловые)
	        |	И ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.Родитель.Код В(&МассивПравилОбработки)
	        |	И НЕ ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.Наименование В (&МассивПравилОбработки_НеВключаемВОтчет)
	        |	И ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов6.Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетов6.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6 КАК Аналитика6,
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) КАК Значение,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код КАК ПоказательКод,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.Родитель.Код КАК ПравилоОбработкиВладелецРодительКод,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета КАК ПравилоОбработкиВладелец,
	        |	ЗначенияПоказателейОтчетов6.Показатель.Владелец КАК ПоказательВладелец
	        |ПОМЕСТИТЬ ВТ_НДС
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК ЗначенияПоказателейОтчетов6
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код В(&ПоказателиНДС)
	        |	И ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетов6.Значение <> 0
	        |	И ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.Наименование <> ""Полиграфия_РТС_Деп.АХО_Косвенные_Прогноз (РТС)""
	        |	И НЕ ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.Наименование В (&МассивПравилОбработки_НеВключаемВОтчет)
	        |	И ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета = &ПериодПолученияНДС
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов6.Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.Родитель.Код,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета,
	        |	ЗначенияПоказателейОтчетов6.Показатель.Владелец
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6 КАК Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение КАК Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ВидОтчета КАК ПравилоОбработкиВладелец,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Владелец КАК ПоказательВладелец
	        |ПОМЕСТИТЬ ВТ_Справочно_Аренда
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиСтроковые)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ВидОтчета.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ОсновнаяВерсия
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета = &ПериодПолученияНДС
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ВидОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Владелец
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6 КАК Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение КАК Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ВидОтчета КАК ПравилоОбработкиВладелец,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Владелец КАК ПоказательВладелец
	        |ПОМЕСТИТЬ ВТ_РасходыКонтактЦентра_Аренда
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиБулево)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ВидОтчета.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Значение = ИСТИНА
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета = &ПериодПолученияНДС
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ВидОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Владелец
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ОсновныеДанныеПоСуммам.Показатель КАК Показатель,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика1 КАК Аналитика1,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика2 КАК Аналитика2,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика3 КАК Аналитика3,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика4 КАК Аналитика4,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика5 КАК Аналитика5,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика6 КАК Аналитика6,
	        |	ВТ_ОсновныеДанныеПоСуммам.Значение КАК ЗначениеСуммма,
	        |	ВТ_ОсновныеДанныеПоСуммам.ВерсияПериодОтчета КАК ПериодОтчета,
	        |	ВЫБОР
	        |		КОГДА ВТ_Справочно_Аренда.Значение ЕСТЬ NULL
	        |			ТОГДА """"
	        |		ИНАЧЕ ВТ_Справочно_Аренда.Значение
	        |	КОНЕЦ КАК Справочно,
	        |	ВЫБОР
	        |		КОГДА ВТ_РасходыКонтактЦентра_Аренда.Значение ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ВТ_РасходыКонтактЦентра_Аренда.Значение
	        |	КОНЕЦ КАК РасходыКонтактЦентра,
	        |	ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец.Родитель.Код КАК КодГруппыВидаОтчета,
	        |	ВЫБОР
	        |		КОГДА ВТ_НДС.Значение = 20
	        |			ТОГДА 0.2
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТ_НДС.Значение = 0.4
	        |					ТОГДА ВТ_НДС.Значение = 0.2
	        |				ИНАЧЕ ВТ_НДС.Значение
	        |			КОНЕЦ
	        |	КОНЕЦ КАК НДС,
	        |	ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец КАК ВидОтчета,
	        |	ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец КАК ПравилоОбработки
	        |ИЗ
	        |	ВТ_ОсновныеДанныеПоСуммам КАК ВТ_ОсновныеДанныеПоСуммам
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Справочно_Аренда КАК ВТ_Справочно_Аренда
	        |		ПО ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец = ВТ_Справочно_Аренда.ПоказательВладелец
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика1 = ВТ_Справочно_Аренда.Аналитика1
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика2 = ВТ_Справочно_Аренда.Аналитика2
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика3 = ВТ_Справочно_Аренда.Аналитика3
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика4 = ВТ_Справочно_Аренда.Аналитика4
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика5 = ВТ_Справочно_Аренда.Аналитика5
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика6 = ВТ_Справочно_Аренда.Аналитика6
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходыКонтактЦентра_Аренда КАК ВТ_РасходыКонтактЦентра_Аренда
	        |		ПО ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец = ВТ_РасходыКонтактЦентра_Аренда.ПоказательВладелец
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика1 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика1
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика2 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика2
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика3 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика3
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика4 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика4
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика5 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика5
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика6 = ВТ_РасходыКонтактЦентра_Аренда.Аналитика6
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НДС КАК ВТ_НДС
	        |		ПО ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец = ВТ_НДС.ПоказательВладелец
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика1 = ВТ_НДС.Аналитика1
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика2 = ВТ_НДС.Аналитика2
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика3 = ВТ_НДС.Аналитика3
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика4 = ВТ_НДС.Аналитика4
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика5 = ВТ_НДС.Аналитика5
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика6 = ВТ_НДС.Аналитика6
			|ГДЕ &ПользовательскиеОтборы
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Аналитика1,
	        |	Аналитика2,
	        |	Аналитика3,
	        |	Аналитика4,
	        |	Аналитика5,
	        |	Аналитика6";

	
КонецФункции

Функция ПолучитьТекстЗапросаДляСбораКонсолидированныхРасходов()   	
	Возврат "ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетов6.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6 КАК Аналитика6,
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) КАК СуммаРуб,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета КАК ПравилоОбработкиВладелец,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета КАК ПравилоОбработки
	        |ПОМЕСТИТЬ ВТ_ОсновныеДанныеПоСуммам
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК ЗначенияПоказателейОтчетов6
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код В(&ПоказателиЧисловые)
	        |	И ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	        |	И НЕ ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.ПометкаУдаления
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов6.Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияНечисловые.Показатель КАК Показатель,
	        |	ЗначенияНечисловые.Аналитика1 КАК Аналитика1,
	        |	ЗначенияНечисловые.Аналитика2 КАК Аналитика2,
	        |	ЗначенияНечисловые.Аналитика3 КАК Аналитика3,
	        |	ЗначенияНечисловые.Аналитика4 КАК Аналитика4,
	        |	ЗначенияНечисловые.Аналитика5 КАК Аналитика5,
	        |	ЗначенияНечисловые.Аналитика6 КАК Аналитика6,
	        |	ЗначенияНечисловые.Версия.ПериодОтчета КАК ВерсияПериодОтчета,
	        |	ЗначенияНечисловые.Версия.ВидОтчета КАК ПравилоОбработкиВладелец,
	        |	ЗначенияНечисловые.Показатель.Владелец КАК ПоказательВладелец,
	        |	ЗначенияНечисловые.Версия КАК Версия,
	        |	ЗначенияНечисловые.Значение КАК Справочно
	        |ПОМЕСТИТЬ ВТ_Справочно_Итог
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияНечисловые
	        |ГДЕ
	        |	ЗначенияНечисловые.Версия.ПериодОтчета = &ПериодПолученияНечисловыхПоказателей
	        |	И ЗначенияНечисловые.Версия.ВидОтчета.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияНечисловые.Значение <> НЕОПРЕДЕЛЕНО
	        |	И ЗначенияНечисловые.Значение <> """"
	        |	И ЗначенияНечисловые.Показатель.Колонка.Код = ""Справочно""
	        |	И НЕ ЗначенияНечисловые.Версия.ВидОтчета.ПометкаУдаления
	        |	И НЕ ЗначенияНечисловые.Версия.ОсновнаяВерсия
	        |	И ЗначенияНечисловые.Версия В
	        |			(ВЫБРАТЬ
	        |				МАКСИМУМ(ЗначенияНечисловые2.Версия)
	        |			ИЗ
	        |				РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияНечисловые2
	        |			ГДЕ
	        |				ЗначенияНечисловые2.Показатель = ЗначенияНечисловые.Показатель
	        |				И ЗначенияНечисловые2.Аналитика1 = ЗначенияНечисловые.Аналитика1
	        |				И ЗначенияНечисловые2.Аналитика2 = ЗначенияНечисловые.Аналитика2
	        |				И ЗначенияНечисловые2.Аналитика3 = ЗначенияНечисловые.Аналитика3
	        |				И ЗначенияНечисловые2.Аналитика4 = ЗначенияНечисловые.Аналитика4
	        |				И ЗначенияНечисловые2.Аналитика5 = ЗначенияНечисловые.Аналитика5
	        |				И ЗначенияНечисловые2.Аналитика6 = ЗначенияНечисловые.Аналитика6
	        |				И ЗначенияНечисловые2.Версия.ВидОтчета = ЗначенияНечисловые.Версия.ВидОтчета
	        |				И ЗначенияНечисловые2.Версия.ПериодОтчета = &ПериодПолученияНечисловыхПоказателей
	        |				И ЗначенияНечисловые2.Версия.ВидОтчета.Родитель.Код В (&МассивПравилОбработки)
	        |				И ЗначенияНечисловые2.Значение <> НЕОПРЕДЕЛЕНО
	        |				И ЗначенияНечисловые2.Значение <> """"
	        |				И ЗначенияНечисловые2.Показатель.Колонка.Код = ""Справочно""
	        |				И НЕ ЗначенияНечисловые2.Версия.ВидОтчета.ПометкаУдаления
	        |				И НЕ ЗначенияНечисловые2.Версия.ОсновнаяВерсия)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетов6.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6 КАК Аналитика6,
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) КАК СтавкаНДС,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета КАК ПравилоОбработкиВладелец
	        |ПОМЕСТИТЬ ВТ_НДСИзЭО
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК ЗначенияПоказателейОтчетов6
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов6.Показатель.Колонка.Код = ""НДС""
	        |	И ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	        |	И НЕ ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.ПометкаУдаления
	        |	И ЗначенияПоказателейОтчетов6.Версия.ВидОтчета.Родитель.Код В(&МассивПравилОбработки)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов6.Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6,
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика1 КАК Аналитика1,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика2 КАК Аналитика2,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика3 КАК Аналитика3,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика4 КАК Аналитика4,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика5 КАК Аналитика5,
	        |	ВТ_ОсновныеДанныеПоСуммам.Аналитика6 КАК Аналитика6,
	        |	ВТ_ОсновныеДанныеПоСуммам.ВерсияПериодОтчета КАК ПериодОтчета,
	        |	ВТ_ОсновныеДанныеПоСуммам.СуммаРуб КАК ЗначениеСуммма,
	        |	ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец КАК ВидОтчета,
	        |	ВТ_Справочно_Итог.Справочно КАК Справочно,
	        |	ВТ_ОсновныеДанныеПоСуммам.Показатель КАК Показатель,
	        |	ВЫБОР
	        |		КОГДА Контрагенты.СтавкаНДС >= 0.2
	        |			ТОГДА 0.22
	        |		КОГДА Контрагенты.СтавкаНДС = 0
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_НДСИзЭО.СтавкаНДС >= 0.2
	        |						ТОГДА 0.22
	        |					ИНАЧЕ ВТ_НДСИзЭО.СтавкаНДС
	        |				КОНЕЦ
	        |		ИНАЧЕ Контрагенты.СтавкаНДС
	        |	КОНЕЦ КАК НДС,
	        |	ЕСТЬNULL(КонтрагентыДополнительныеРеквизиты.Значение, ЛОЖЬ) КАК РасходыКонтактЦентра,
	        |	ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец.Родитель.Код КАК КодГруппыВидаОтчета,
	        |	ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработки КАК ПравилоОбработки
	        |ИЗ
	        |	ВТ_ОсновныеДанныеПоСуммам КАК ВТ_ОсновныеДанныеПоСуммам
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Справочно_Итог КАК ВТ_Справочно_Итог
	        |		ПО ВТ_ОсновныеДанныеПоСуммам.Аналитика1 = ВТ_Справочно_Итог.Аналитика1
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика2 = ВТ_Справочно_Итог.Аналитика2
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика3 = ВТ_Справочно_Итог.Аналитика3
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика4 = ВТ_Справочно_Итог.Аналитика4
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика5 = ВТ_Справочно_Итог.Аналитика5
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика6 = ВТ_Справочно_Итог.Аналитика6
	        |			И ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец = ВТ_Справочно_Итог.ПравилоОбработкиВладелец
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НДСИзЭО КАК ВТ_НДСИзЭО
	        |		ПО ВТ_ОсновныеДанныеПоСуммам.Аналитика1 = ВТ_НДСИзЭО.Аналитика1
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика2 = ВТ_НДСИзЭО.Аналитика2
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика3 = ВТ_НДСИзЭО.Аналитика3
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика4 = ВТ_НДСИзЭО.Аналитика4
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика5 = ВТ_НДСИзЭО.Аналитика5
	        |			И ВТ_ОсновныеДанныеПоСуммам.Аналитика6 = ВТ_НДСИзЭО.Аналитика6
	        |			И ВТ_ОсновныеДанныеПоСуммам.ПравилоОбработкиВладелец = ВТ_НДСИзЭО.ПравилоОбработкиВладелец
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	        |			ПО (КонтрагентыДополнительныеРеквизиты.Ссылка = Контрагенты.Ссылка)
	        |				И (КонтрагентыДополнительныеРеквизиты.Свойство.Имя = ""КонтрагентКонтактЦентра"")
	        |		ПО ВТ_ОсновныеДанныеПоСуммам.Аналитика5 = Контрагенты.Ссылка
	        |ГДЕ &ПользовательскиеОтборы";   
	
КонецФункции		
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция МассивЭООбрабатываемыхОтдельно()
		
	СоответсвиеЭО = Новый Соответствие; 
	СоответсвиеЭО.Вставить("Сводный отчет Изменение окладов Многопериодный (ЦРЭ)","ПоПоказателю");
	СоответсвиеЭО.Вставить("Командировочные_Представительские_Косвенные_Прогноз (ЦРЭ)","ПоАналитике"); 
	СоответсвиеЭО.Вставить("ИТ_ЦРЭ_Косвенные_Постоянные_Прогноз (ЦРЭ)","ПоАналитике");
    СоответсвиеЭО.Вставить("Сводный отчет Изменение окладов Многопериодный (ОТС)","ПоПоказателю");
                      
    Возврат СоответсвиеЭО;	

КонецФункции // СоответсвиеЭООбрабатываемыхОтдельно()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПоказателейЧисловых()
	МассивПоказателиЧисловые = Новый Массив;
	МассивПоказателиЧисловые.Добавить("CAPEX_СуммаМесРубСНДС");
	МассивПоказателиЧисловые.Добавить("ИзменениеОкладов_СуммаРуб"); 
	МассивПоказателиЧисловые.Добавить("ИзменениеОклада_СуммаМесРубСНДС");
	МассивПоказателиЧисловые.Добавить("ИТПостоянные_СуммаМесРубСНДС");
	МассивПоказателиЧисловые.Добавить("OPEX_СуммаМесРубСНДС");
	МассивПоказателиЧисловые.Добавить("Аренда_СуммаМесРубСНДС");
	МассивПоказателиЧисловые.Добавить("CAPEX_СуммаМесВалюта");
	МассивПоказателиЧисловые.Добавить("ИТПостоянные_СуммаМесВалюта"); 
	МассивПоказателиЧисловые.Добавить("Вакансии_СреднеПремияРубGross");
	МассивПоказателиЧисловые.Добавить("Вакансии_ОкладРубGross"); 
	МассивПоказателиЧисловые.Добавить("ИТ_ИТ");   
	МассивПоказателиЧисловые.Добавить("ПрочиеАХО1_Расходники");
	МассивПоказателиЧисловые.Добавить("Питание_Питание");  
	МассивПоказателиЧисловые.Добавить("Вакансии_ФОТНалоги");
	Возврат МассивПоказателиЧисловые; 
КонецФункции // ПолучениеПоказателейЧисловых()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПоказателейБулево()
	МассивПоказателиБулево = Новый Массив;
	МассивПоказателиБулево.Добавить("CAPEX_РасходыКонтактЦентра"); 
	МассивПоказателиБулево.Добавить("Аренда_РасходыКонтактЦентра");
    МассивПоказателиБулево.Добавить("ИТПостоянные_РасходыКонтактЦентра");	
    Возврат МассивПоказателиБулево; 
КонецФункции // ПолучениеПоказателейБулево()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПоказателейСтроковые()
	МассивПоказателиСтроковые = Новый Массив;
	МассивПоказателиСтроковые.Добавить("Аренда_Справочно");
	МассивПоказателиСтроковые.Добавить("ИзменениеОкладов_ПроектТрансферт");	
    Возврат МассивПоказателиСтроковые;
КонецФункции // ПолучениеПоказателейСтроковые()  
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПоказателейНДС()
	МассивПоказателиСтроковые = Новый Массив;
	МассивПоказателиСтроковые.Добавить("Аренда_НДС");
	МассивПоказателиСтроковые.Добавить("CAPEX_НДС");
	МассивПоказателиСтроковые.Добавить("OPEX_НДС");
	МассивПоказателиСтроковые.Добавить("ИТПостоянные_НДС");
    Возврат МассивПоказателиСтроковые;	
КонецФункции // ПолучениеПоказателейНДС()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеЭОНеВключаемыхВОбщийОтчет()
	МассивПравилОбработки_НеВключаемВОтчет = Новый Массив;
	МассивПравилОбработки_НеВключаемВОтчет.Добавить("Платеж_Переведенные_РТС_Разработка и Сопров.ПО_Прогноз");	
	МассивПравилОбработки_НеВключаемВОтчет.Добавить("Аренда_ЦРЭ_ЦФО и ПФО_Процентный расхУУ_Прогноз (ЦРЭ)");   
	МассивПравилОбработки_НеВключаемВОтчет.Добавить("ФОТ_Прогноз (ОЛ)");
	Возврат МассивПравилОбработки_НеВключаемВОтчет;
КонецФункции // ПолучениеЭОНеВключаемыхВОбщийОтчет() 
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//
Процедура ОбработаемОтдельноОтчетыИзГруппы_ИТРазработкаИСопровождениеПО2(ТаблицаДанных,ТаблицаДанных_Косвенные,ДатаНачалаОтчета,ДатаОкончанияОтчета)

	СценарииОтчета = Справочники.Сценарии.НайтиПоНаименованию("Сценарий месячный (2025 год)"); 
	тПериодыОтчета = Справочники.Периоды.НайтиПоНаименованию("2025 г.");
	СтруктураПараметровОтбора   = Новый Структура("ВидОтчета,ПериодОтчета,Сценарий",  
	Справочники.ВидыОтчетов.НайтиПоКоду("РПРазработкаПрогнозЦРЭ"),тПериодыОтчета,СценарииОтчета);	
	РаскрываемыеАналитики       = Новый Структура("Аналитика1,Аналитика2,Аналитика3");	
	тЗначенияПоказателейВидаОтчета = СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(
	СтруктураПараметровОтбора,РаскрываемыеАналитики);    	
	
	ТаблицаПроцентов = Новый ТаблицаЗначений;       
	ТаблицаПроцентов.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));//Контрагент
	ТаблицаПроцентов.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));//Проект 
	ТаблицаПроцентов.Колонки.Добавить("ПроцентБЛ",Новый ОписаниеТипов("Число"));//ПроцентБЛ
	
	ВладелецСправочника = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Проект");
	
	Для Каждого Стр Из тЗначенияПоказателейВидаОтчета Цикл  
		НовСтр = ТаблицаПроцентов.Добавить();	    
		//НовСтр.Контрагент = СокрЛП(Стр.Аналитика3);   
		НовСтр.Контрагент = Стр.Аналитика3; 
		
		Если Стр.ПоказательОтчета.Колонка.Наименование = "GМаркет" Тогда
			НовСтр.Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("G-Маркет",,,ВладелецСправочника);     
		ИначеЕсли Стр.ПоказательОтчета.Колонка.Наименование = "Обучение" Или Стр.ПоказательОтчета.Колонка.Наименование = "Поставщики" 
			Или Стр.ПоказательОтчета.Колонка.Наименование = "ЭЦП" Тогда     
			НовСтр.Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию(Стр.ПоказательОтчета.Колонка.Наименование,,,ВладелецСправочника);
		Иначе
			НовСтр.Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию(Стр.ПоказательОтчета.Колонка.Наименование,,,ВладелецСправочника); 	
		КонецЕсли;
		НовСтр.ПроцентБЛ = Стр.Значение;
	КонецЦикла; 
	
	СоответствиеПроектовБЛ = СоответствиеПроектовБЛ();
	Организация = Справочники.Организации.НайтиПоНаименованию("АО ""ЦРЭ""");
	
	МассивКодовГруппОтчетов = Новый Массив;
	МассивКодовГруппОтчетов.Добавить("ИТРазработкаИСопровождениеПО2");   	
	МассивПравилОбработки_НеВключаемВОтчет = Новый Массив;   
	ПоказателиБулево = Новый Массив;
	ПоказателиСтроковые = Новый Массив; 
	
	ПоказателиЧисловые = Новый Массив;
	ПоказателиЧисловые.Добавить("CAPEX_СуммаМесРубСНДС");  
	
	ПоказателиНДС = Новый Массив;    
	ПоказателиНДС.Добавить("CAPEX_НДС");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивПравилОбработки", МассивКодовГруппОтчетов);   
	Запрос.УстановитьПараметр("МассивПравилОбработки_НеВключаемВОтчет", МассивПравилОбработки_НеВключаемВОтчет = Новый Массив);	
	Запрос.УстановитьПараметр("ПоказателиБулево", ПоказателиБулево = Новый Массив);
	Запрос.УстановитьПараметр("ПоказателиСтроковые", ПоказателиСтроковые = Новый Массив);
	Запрос.УстановитьПараметр("ПоказателиЧисловые", ПоказателиЧисловые);      
	Запрос.УстановитьПараметр("ПоказателиНДС", ПоказателиНДС);    
	Запрос.УстановитьПараметр("ПериодПолученияНДС",Справочники.Периоды.НайтиПоНаименованию("Январь 2025 г."));    
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачалаОтчета); 
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончанияОтчета);
 
	Запрос.Текст = ПроверкаНовогоЗапроса();  

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ &ПользовательскиеОтборы","");
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();   
	
	СоответствияПорядкаСортировкиСтатьиЗатрат = ПолучениеСоответствияПорядкаСортировкиСтатьиЗатрат();
	
	SalesTech_Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Sales Tech",,,ВладелецСправочника); 
	Поставщики_Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоНаименованию("Поставщики",,,ВладелецСправочника);

	Для Каждого Стр Из РезультатЗапроса Цикл   
		
		Если Стр.ПериодОтчета.ДатаНачала >= Дата(2026,01,01) Тогда       
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("Контрагент",Стр.Аналитика5);
		МассивОтобранныхСтрок = ТаблицаПроцентов.НайтиСтроки(СтруктураОтбора);
		
		Если МассивОтобранныхСтрок.Количество() > 0 Тогда       
			Для Каждого Эл Из МассивОтобранныхСтрок Цикл   
				
				АналитикаПроектНаименование = Эл.Проект.Наименование;
				АналитикаПроект = Эл.Проект; 
				ПроцентБЛ = Эл.ПроцентБЛ;
				
				СтруктураПараметров = Новый Структура("АналитикаПроектНаименование,АналитикаПроект,ПроцентБЛ,ПризнакПереводаПроекта,ПроектПеревода_Косвенные,Организация,SalesTech_Проект,Поставщики_Проект,ДляПлана",
				АналитикаПроектНаименование,АналитикаПроект,ПроцентБЛ,Ложь,Неопределено,Организация,SalesTech_Проект,Поставщики_Проект);
				
				ДобавлениеСтрокиВОбщийОтчет(Стр,СтруктураПараметров,ТаблицаДанных,СоответствиеПроектовБЛ,СоответствияПорядкаСортировкиСтатьиЗатрат);    
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ОбработаемОтдельноОтчетыИзГруппы_ИТРазработкаИСопровождениеПО2()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеСоответствияКомпанийВГО()		
	РТСТ = Справочники.Организации.НайтиПоНаименованию("РТС-ТЕНДЕР ООО");
	ЦРЭ = Справочники.Организации.НайтиПоНаименованию("АО ""ЦРЭ""");
	ОТС = Справочники.Организации.НайтиПоНаименованию("АО ""ОТС""");
	Академия = Справочники.Организации.НайтиПоНаименованию("РТС-АКАДЕМИЯ ООО");
	Холдинг = Справочники.Организации.НайтиПоНаименованию("АО ""РТС-холдинг""");
	Силует = Справочники.Организации.НайтиПоНаименованию("Силуэт");
	Текса = Справочники.Организации.НайтиПоНаименованию("ТЕКСА АО");
	
	СоответствиеВГО = Новый Соответствие;
	СоответствиеВГО.Вставить("РТС-ТЕНДЕР ООО_ВГО",РТСТ); 
	СоответствиеВГО.Вставить("РТС-ТЕНДЕР ООО_ВГО",Академия);
	СоответствиеВГО.Вставить("РТС-ТЕНДЕР ООО_ВГО",Холдинг);  
	СоответствиеВГО.Вставить("РТС-ТЕНДЕР ООО_ВГО",Силует);
	СоответствиеВГО.Вставить("РТС-ТЕНДЕР ООО_ВГО",Текса);
    СоответствиеВГО.Вставить("РТС-ТЕНДЕР ООО_ВГО",ОТС);
	СоответствиеВГО.Вставить("ЦРЭ АО_ВГО",ЦРЭ);	
	Возврат СоответствиеВГО;
КонецФункции // ПолучениеТаблицыСоответствийВГО()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеСоответствияПорядкаСортировкиСтатьиЗатрат()
	СоответствиеПорядкаСортировкиСтатьиЗатрат	= Новый Соответствие;
	СоответствиеПорядкаСортировкиСтатьиЗатрат.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000017"),1); //ФОТ	
	СоответствиеПорядкаСортировкиСтатьиЗатрат.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("РТ-000040"),2); //ФОТ Налоги    
	СоответствиеПорядкаСортировкиСтатьиЗатрат.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("ТЕ-000017"),3); //Аренда
	СоответствиеПорядкаСортировкиСтатьиЗатрат.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000012"),4); //ИТ  
	СоответствиеПорядкаСортировкиСтатьиЗатрат.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("РТ-000018"),5); //Развитие бизнеса   
	СоответствиеПорядкаСортировкиСтатьиЗатрат.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000018"),6); //Мотивация
	СоответствиеПорядкаСортировкиСтатьиЗатрат.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000019"),7); //Годовой бонус 
	СоответствиеПорядкаСортировкиСтатьиЗатрат.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000011"),8); //Прочие
	СоответствиеПорядкаСортировкиСтатьиЗатрат.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000020"),9); //Косвенные расходы
    Возврат СоответствиеПорядкаСортировкиСтатьиЗатрат;
КонецФункции // ПолучениеМассиваПорядкаСортировкиСтатьиЗатрат()      
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеСоответсвияПорядкаСортировкиНаправление()	
		
	ВладелецСправочника = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Проект");
	
	СоответствиеПорядкаСортировкиНаправление= Новый Соответствие;
	СоответствиеПорядкаСортировкиНаправление.Вставить("Комиссии",1);	
	СоответствиеПорядкаСортировкиНаправление.Вставить("Агентские",2);    
	СоответствиеПорядкаСортировкиНаправление.Вставить("ОРЕХ",3); 
	СоответствиеПорядкаСортировкиНаправление.Вставить("Мотивация",4);   
	СоответствиеПорядкаСортировкиНаправление.Вставить("Прочие доходы/расходы",5);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Январь 2025 г."),1);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Февраль 2025 г."),2);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Март 2025 г."),3); 
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Апрель 2025 г."),4);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Май 2025 г."),5);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Июнь 2025 г."),6);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Июль 2025 г."),7);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Август 2025 г."),8);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Сентябрь 2025 г."),9);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Октябрь 2025 г."),10);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Ноябрь 2025 г."),11);
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.Периоды.НайтиПоНаименованию("Декабрь 2025 г."),12);
	
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000017"),1); //ФОТ
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000021"),2); //Резерв на отпуск  
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("РТ-000040"),3); //ФОТ Налоги    
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("ТЕ-000017"),4); //Аренда
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000012"),5); //ИТ  
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("РТ-000018"),6); //Развитие бизнеса   
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000018"),7); //Мотивация
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000019"),8); //Годовой бонус 
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000011"),9); //Прочие
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000020"),10); //Косвенные расходы    
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.СтатьиЗатрат.НайтиПоКоду("00-000023"),11); //Прочие доходы/расходы 
			
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000002",,,ВладелецСправочника),1); //44-ФЗ	
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000001",,,ВладелецСправочника),2); //223-ФЗ    
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000004",,,ВладелецСправочника),3); //Имущество
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000003",,,ВладелецСправочника),4); //615-ПП  
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000007",,,ВладелецСправочника),5); //Поставщики   
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000009",,,ВладелецСправочника),6); //G-Маркет
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000010",,,ВладелецСправочника),7); //Обучение 
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000008",,,ВладелецСправочника),8); //МИК
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000015",,,ВладелецСправочника),9); //ЭТП 	
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000018",,,ВладелецСправочника),10); //ЭЦП
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000017",,,ВладелецСправочника),11); //S2P
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000021",,,ВладелецСправочника),12); //Казахстан     
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000006",,,ВладелецСправочника),13); //Косвенные 
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000019",,,ВладелецСправочника),14); //НСИ/ST
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000022",,,ВладелецСправочника),15); //ОЛ
	СоответствиеПорядкаСортировкиНаправление.Вставить(Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000005",,,ВладелецСправочника),16); //Капитал
	

	Возврат СоответствиеПорядкаСортировкиНаправление;
КонецФункции // ПолучениеСоответсвияПорядкаСортировкиНаправление()()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция РассчитаемКосвенныеРасходыОтдельно(ТаблицаДанных_Косвенные,ТаблицаПроцентов_РаспределениеКосвенные,СоответствияПорядкаСортировкиСтатьиЗатрат,ПризнакРасчетаПланФакт)
	
	КосвенныеРасходы_СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("00-000020");
	
	ТаблицаДанныхОтчета = ПолучениеТаблицыЗаполненияДанныхКосвенные(); 
		
	ТаблицаОрганизаций = ТаблицаДанных_Косвенные.Скопировать();
	ТаблицаОрганизаций.Свернуть("Организация");   
	
	ТаблицаПроектов = ТаблицаПроцентов_РаспределениеКосвенные.Скопировать();
	ТаблицаПроектов.Свернуть("Проект,Организация");      
	
	
	ТаблицаЗатрат = Новый ТаблицаЗначений;
	ТаблицаЗатрат.Колонки.Добавить("Затраты",Новый ОписаниеТипов("Строка"));
	
	НовСтрЗатр = ТаблицаЗатрат.Добавить();
	НовСтрЗатр.Затраты = "ОРЕХ"; 
	
	НовСтрЗатр = ТаблицаЗатрат.Добавить();
	НовСтрЗатр.Затраты = "Мотивация";      
	
	Для Каждого СтрОрг Из ТаблицаОрганизаций Цикл   
		
		СтруктураОтбораПроектов = Новый Структура("Организация",СтрОрг.Организация);	
		МассивПроектов = ТаблицаПроектов.НайтиСтроки(СтруктураОтбораПроектов); 
		Если МассивПроектов.Количество() > 0 Тогда   
			
			Для Каждого ЭлПроект Из МассивПроектов Цикл   
				
				СуммаНарастающая = 0;
				СуммаПроцентовНарастающая = 0; 
				
				Для Каждого СтрЗтр Из ТаблицаЗатрат Цикл
					
					СтруктураОтбораДанных = Новый Структура("Организация,Направление",СтрОрг.Организация,СтрЗтр.Затраты);    
					МассивДанных = ТаблицаДанных_Косвенные.НайтиСТроки(СтруктураОтбораДанных);    
					
					//СтруктураОтбораДанных = Новый Структура("Организация",СтрОрг.Организация);    
					//МассивДанных = ТаблицаДанных_Косвенные.НайтиСТроки(СтруктураОтбораДанных); 

					
					Если МассивДанных.Количество() > 0 Тогда  
						
						Для Каждого ЭлДанных Из МассивДанных Цикл  
							
							СтруктураОтобораПроцентов = Новый Структура("Организация,Проект,ПериодОтчета",ЭлДанных.Организация,ЭлПроект.Проект,ЭлДанных.ПериодОтчета);	
							ДанныеПроцентовЗаМесяц = ТаблицаПроцентов_РаспределениеКосвенные.НайтиСтроки(СтруктураОтобораПроцентов);   
							
							Если ДанныеПроцентовЗаМесяц.Количество() > 0 Тогда    
								
								ПроцентЗаМесяц = ДанныеПроцентовЗаМесяц[0].ПроцентБЛ;
							Иначе  
								//Если Год(ЭлДанных.ПериодОтчета.ДатаНачала) < 2026 Тогда    
								СуммаНарастающая = СуммаНарастающая + ЭлДанных[ПризнакРасчетаПланФакт];    
								//КонецЕсли;
								Продолжить;
							КонецЕсли;  
							
							НовСтр = ТаблицаДанныхОтчета.Добавить();
							НовСтр.Направление = ЭлДанных.Направление; 
							НовСтр.Проект = ЭлПроект.Проект;  						
							НовСтр.СтатьяЗатрат = КосвенныеРасходы_СтатьяЗатрат;
							СуммаЗаМесяц = ЭлДанных[ПризнакРасчетаПланФакт]; 
						   						
							НовСтр[ПризнакРасчетаПланФакт] = ((СуммаНарастающая + СуммаЗаМесяц) * ПроцентЗаМесяц) - СуммаПроцентовНарастающая; 
							НовСтр.ПериодОтчета = ЭлДанных.ПериодОтчета;    
							НовСтр.ПериодЗаписи = НовСтр.ПериодОтчета.ДатаНачала; 
							НовСтр.Организация = ЭлДанных.Организация;  
																					
							СуммаПроцентовНарастающая = СуммаПроцентовНарастающая + НовСтр[ПризнакРасчетаПланФакт];  				
							СуммаНарастающая = СуммаНарастающая + СуммаЗаМесяц;	
																									
						КонецЦикла;
						
					КонецЕсли;  
					
				КонецЦикла;
				
			КонецЦикла; 
			
		КонецЕсли;  
		
	КонецЦикла;	
	
	Возврат ТаблицаДанныхОтчета;   
	
	//КосвенныеРасходы_СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("00-000020");
	//
	//ТаблицаДанныхОтчета = ПолучениеТаблицыЗаполненияДанныхКосвенные(); 
	//	
	//// Создаем список организаций
	//ТаблицаОрганизаций = ТаблицаДанных_Косвенные.Скопировать();
	//ТаблицаОрганизаций.Свернуть("Организация");   
	//
	//// Создаем список проектов для распределения
	//ТаблицаПроектов = ТаблицаПроцентов_РаспределениеКосвенные.Скопировать();
	//ТаблицаПроектов.Свернуть("Проект,Организация");      
	//
	//// Создаем таблицу направлений затрат
	//ТаблицаЗатрат = Новый ТаблицаЗначений;
	//ТаблицаЗатрат.Колонки.Добавить("Затраты", Новый ОписаниеТипов("Строка"));
	//
	//НовСтрЗатр = ТаблицаЗатрат.Добавить();
	//НовСтрЗатр.Затраты = "ОРЕХ"; 
	//
	//НовСтрЗатр = ТаблицаЗатрат.Добавить();
	//НовСтрЗатр.Затраты = "Мотивация";      
	//
	//// Создаем таблицу для накопленных сумм по проектам
	//ТаблицаНакопленныхСумм = Новый ТаблицаЗначений;
	//ТаблицаНакопленныхСумм.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));
	//ТаблицаНакопленныхСумм.Колонки.Добавить("СуммаНарастающая", Новый ОписаниеТипов("Число"));
	//ТаблицаНакопленныхСумм.Колонки.Добавить("СуммаПроцентовНарастающая", Новый ОписаниеТипов("Число"));
	//
	//// Обрабатываем каждую организацию
	//Для Каждого СтрОрг Из ТаблицаОрганизаций Цикл   
	//	
	//	СтруктураОтбораПроектов = Новый Структура("Организация", СтрОрг.Организация);	
	//	МассивПроектов = ТаблицаПроектов.НайтиСтроки(СтруктураОтбораПроектов); 
	//	
	//	Если МассивПроектов.Количество() > 0 Тогда   
	//		
	//		// Для каждого проекта в организации
	//		Для Каждого ЭлПроект Из МассивПроектов Цикл   
	//			
	//			// Создаем уникальный ключ для проекта (чтобы хранить накопленные суммы отдельно)
	//			КлючПроекта = Строка(ЭлПроект.Организация) + "|" + Строка(ЭлПроект.Проект);
	//			
	//			// Находим или создаем запись о накопленных суммах для этого проекта
	//			НайденныеНакопления = ТаблицаНакопленныхСумм.НайтиСтроки(Новый Структура("Ключ", КлючПроекта));
	//			Если НайденныеНакопления.Количество() = 0 Тогда
	//				НоваяСтрока = ТаблицаНакопленныхСумм.Добавить();
	//				НоваяСтрока.Ключ = КлючПроекта;
	//				НоваяСтрока.СуммаНарастающая = 0;
	//				НоваяСтрока.СуммаПроцентовНарастающая = 0;
	//			КонецЕсли;
	//			
	//			// Получаем накопленные суммы для этого проекта
	//			СтрокаНакоплений = ТаблицаНакопленныхСумм.Найти(КлючПроекта, "Ключ");
	//			
	//			// Создаем временные переменные для этого проекта
	//			СуммаНарастающая = СтрокаНакоплений.СуммаНарастающая;
	//			СуммаПроцентовНарастающая = СтрокаНакоплений.СуммаПроцентовНарастающая;
	//			
	//			// Для каждого типа затрат ("ОРЕХ" и "Мотивация")
	//			Для Каждого СтрЗтр Из ТаблицаЗатрат Цикл
	//				
	//				// Находим все данные по этому направлению затрат
	//				СтруктураОтбораДанных = Новый Структура("Организация, Направление", СтрОрг.Организация, СтрЗтр.Затраты);    
	//				МассивДанных = ТаблицаДанных_Косвенные.НайтиСТроки(СтруктураОтбораДанных);    
	//				
	//				Если МассивДанных.Количество() > 0 Тогда  
	//					
	//					// Сортируем данные по периоду (от старых к новым)
	//					МассивДанных.Сортировать("ПериодОтчета");
	//					
	//					// Обрабатываем каждый месяц
	//					Для Каждого ЭлДанных Из МассивДанных Цикл  
	//						
	//						// Ищем процент распределения для этого месяца и проекта
	//						СтруктураОтобораПроцентов = Новый Структура("Организация, Проект, ПериодОтчета", 
	//							ЭлДанных.Организация, ЭлПроект.Проект, ЭлДанных.ПериодОтчета);	
	//						ДанныеПроцентовЗаМесяц = ТаблицаПроцентов_РаспределениеКосвенные.НайтиСтроки(СтруктураОтобораПроцентов);   
	//						
	//						Если ДанныеПроцентовЗаМесяц.Количество() > 0 Тогда    
	//							
	//							ПроцентЗаМесяц = ДанныеПроцентовЗаМесяц[0].ПроцентБЛ;
	//							
	//							// Рассчитываем распределенную сумму
	//							СуммаЗаМесяц = ЭлДанных[ПризнакРасчетаПланФакт]; 
	//							РаспределеннаяСумма = ((СуммаНарастающая + СуммаЗаМесяц) * ПроцентЗаМесяц) - СуммаПроцентовНарастающая;
	//							
	//							// Создаем запись в результатах
	//							НовСтр = ТаблицаДанныхОтчета.Добавить();
	//							НовСтр.Направление = ЭлДанных.Направление; 
	//							НовСтр.Проект = ЭлПроект.Проект;  						
	//							НовСтр.СтатьяЗатрат = КосвенныеРасходы_СтатьяЗатрат;
	//							НовСтр[ПризнакРасчетаПланФакт] = РаспределеннаяСумма;
	//							НовСтр.ПериодОтчета = ЭлДанных.ПериодОтчета;    
	//							НовСтр.ПериодЗаписи = НовСтр.ПериодОтчета.ДатаНачала; 
	//							НовСтр.Организация = ЭлДанных.Организация;  
	//							
	//							// Обновляем накопленные суммы
	//							СуммаПроцентовНарастающая = СуммаПроцентовНарастающая + РаспределеннаяСумма;
	//							СуммаНарастающая = СуммаНарастающая + СуммаЗаМесяц;
	//							
	//						Иначе  
	//							// Если нет процента за этот месяц, просто накапливаем сумму
	//							СуммаНарастающая = СуммаНарастающая + ЭлДанных[ПризнакРасчетаПланФакт];    
	//						КонецЕсли;  
	//						
	//					КонецЦикла;
	//					
	//				КонецЕсли;  
	//				
	//			КонецЦикла;  				
	//			
	//			СтрокаНакоплений.СуммаНарастающая = СуммаНарастающая;
	//			СтрокаНакоплений.СуммаПроцентовНарастающая = СуммаПроцентовНарастающая;
	//			
	//		КонецЦикла;  
	//		
	//	КонецЕсли;  
	//	
	//КонецЦикла;  
	//
	//Возврат ТаблицаДанныхОтчета;
			
КонецФункции // РассчитаемКосвенныеРасходыОтдельно()
			 
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция РассчитаемКосвенныеРасходыОтдельноФакт(ТаблицаДанных_Косвенные,ТаблицаПроцентов_РаспределениеКосвенные,СоответствияПорядкаСортировкиСтатьиЗатрат,ПризнакРасчетаПланФакт,ПериодыОтчетаМесяц)
	
	КосвенныеРасходы_СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("00-000020");
		
	ТаблицаДанныхОтчета = ПолучениеТаблицыЗаполненияДанныхКосвенные();  
		
	ТаблицаОрганизаций = ТаблицаДанных_Косвенные.Скопировать();
	ТаблицаОрганизаций.Свернуть("Организация");   
	
	ТаблицаПроектов = ТаблицаПроцентов_РаспределениеКосвенные.Скопировать();
	ТаблицаПроектов.Свернуть("Проект,Организация");      
		
	ТаблицаЗатрат = Новый ТаблицаЗначений;
	ТаблицаЗатрат.Колонки.Добавить("Затраты",Новый ОписаниеТипов("Строка"));
	
	НовСтрЗатр = ТаблицаЗатрат.Добавить();
	НовСтрЗатр.Затраты = "ОРЕХ"; 
	
	НовСтрЗатр = ТаблицаЗатрат.Добавить();
	НовСтрЗатр.Затраты = "Мотивация";     
	
	ТаблицаРасчета = ТаблицаДанных_Косвенные.Скопировать();
	ТаблицаРасчета.Свернуть("Организация,Направление,Проект,СтатьяЗатрат,СтатьяДоходовРасходов,НазначениеПлатежа,Контрагент,Регион");   
	
	ТаблицаДанных_Косвенные.Сортировать("ПериодЗаписи");
	
	Для Каждого СтрРасч Из ТаблицаРасчета Цикл   
		
		Если СтрРасч.СтатьяДоходовРасходов.Наименование <> "Сервера, сетевое оборуд-е" Тогда   
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбораПроектов = Новый Структура("Организация",СтрРасч.Организация);	
		ДанныеПоПроектам = ТаблицаПроектов.НайтиСтроки(СтруктураОтбораПроектов);
		
		Для Каждого ЭлПроект Из ДанныеПоПроектам Цикл
			
			СуммаНарастающая = 0;
			СуммаПроцентовНарастающая = 0;    
			
			СтруктураОтбораДанных = Новый Структура("Организация,Направление,Проект,СтатьяЗатрат,СтатьяДоходовРасходов,НазначениеПлатежа,Контрагент,Регион",
			СтрРасч.Организация,СтрРасч.Направление,СтрРасч.Проект,СтрРасч.СтатьяЗатрат,СтрРасч.СтатьяДоходовРасходов,СтрРасч.НазначениеПлатежа,СтрРасч.Контрагент,СтрРасч.Регион);
			
			ДанныеПоСотруднику = ТаблицаДанных_Косвенные.НайтиСТроки(СтруктураОтбораДанных); 
			
			Для Каждого СтрПоСотр Из ДанныеПоСотруднику Цикл 
				СтруктураОтбораПроцентов = Новый Структура("Организация,Проект,ПериодОтчета",СтрРасч.Организация,ЭлПроект.Проект,СтрПоСотр.ПериодОтчета);	
				ДанныеПроцентовЗаМесяц = ТаблицаПроцентов_РаспределениеКосвенные.НайтиСтроки(СтруктураОтбораПроцентов); 
				
				Если ДанныеПроцентовЗаМесяц.Количество() > 0 Тогда    			
					ПроцентЗаМесяц = ДанныеПроцентовЗаМесяц[0].ПроцентБЛ;
				Иначе     
					СуммаНарастающая = СуммаНарастающая + СтрПоСотр[ПризнакРасчетаПланФакт]; 
					Продолжить;
				КонецЕсли;  
				
				НовСтр = ТаблицаДанныхОтчета.Добавить();
				НовСтр.Направление = СтрПоСотр.Направление; 
				НовСтр.Проект = ЭлПроект.Проект;  						
				НовСтр.СтатьяЗатрат = КосвенныеРасходы_СтатьяЗатрат;    
				
				//++
				НовСтр.СтатьяДоходовРасходов = СтрПоСотр.СтатьяДоходовРасходов;
				//--
				
				СуммаЗаМесяц = СтрПоСотр[ПризнакРасчетаПланФакт];    
				
				НовСтр[ПризнакРасчетаПланФакт] = ((СуммаНарастающая + СуммаЗаМесяц) * ПроцентЗаМесяц) - СуммаПроцентовНарастающая; 
				
				НовСтр.ПериодОтчета = СтрПоСотр.ПериодОтчета;    
				НовСтр.ПериодЗаписи = НовСтр.ПериодОтчета.ДатаНачала; 
				НовСтр.Организация = СтрПоСотр.Организация;  
								
				СуммаПроцентовНарастающая = СуммаПроцентовНарастающая + НовСтр[ПризнакРасчетаПланФакт];  
				
				СуммаНарастающая = СуммаНарастающая + СуммаЗаМесяц;	
				
			КонецЦикла;	  
						
		КонецЦикла;
		
	КонецЦикла;    
		
	//Возврат ТаблицаДанныхОтчета;
	
	//{Воронков А.Д. 06.08.2025 ++
	
	//ДанныеПоКосвеннымРасходам = ТаблицаДанныхОтчета.Скопировать();
	//ДанныеПоКосвеннымРасходам.Свернуть("Направление,Проект,СтатьяЗатрат,Организация,ПериодОтчета,ПериодЗаписи,Сумма","СуммаФакт");  
	
	//{Воронков А.Д. 01.09.2025 ++
	ПериодыОтчета = ПериодыОтчетаМесяц;
	//ПериодыОтчета = Новый Массив;
	//ПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Январь 2025 г."));
	//ПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Февраль 2025 г.")); 
	//ПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Март 2025 г."));
	//ПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Апрель 2025 г."));
	//ПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Май 2025 г."));
	//ПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Июнь 2025 г."));   
	//ПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("Июль 2025 г."));
	// --}

	
	ТаблицаСрезПомесячный = Новый ТаблицаЗначений;
	
	ТаблицаСрезПомесячный.Колонки.Добавить("ПериодОтчета", Новый ОписаниеТипов("СправочникСсылка.Периоды"));
	ТаблицаСрезПомесячный.Колонки.Добавить("СуммаФакт", Новый ОписаниеТипов("Число"));      
	
	Для Каждого ЭлМесяц Из ПериодыОтчета Цикл   
		Для Каждого СтрДанных Из ТаблицаДанных_Косвенные Цикл    
			Если ЭлМесяц = СтрДанных.ПериодОтчета Тогда  
				ЗаполнитьЗначенияСвойств(ТаблицаСрезПомесячный.Добавить(),СтрДанных);  
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаСрезПомесячный.Свернуть("ПериодОтчета","СуммаФакт");  
	
	ТаблицаОрганизаций = ТаблицаДанных_Косвенные.Скопировать();
	ТаблицаОрганизаций.Свернуть("Организация");  
	
	ТаблицаДанныхОтчета.Очистить();
	Для Каждого СтрРасч Из ТаблицаОрганизаций Цикл  
		
		СтруктураОтбораПроектов = Новый Структура("Организация",СтрРасч.Организация);	
		ДанныеПоПроектам = ТаблицаПроектов.НайтиСтроки(СтруктураОтбораПроектов);
		
		Для Каждого ЭлПроект Из ДанныеПоПроектам Цикл           
			
			СуммаНарастающая = 0;
			СуммаПроцентовНарастающая = 0; 
			
			Для Каждого ЭлМесяц Из ПериодыОтчета Цикл   
				
				СтруктураОтбораДанных = Новый Структура("Организация,ПериодОтчета",СтрРасч.Организация,ЭлМесяц);		
				ДанныеКосвенные = ТаблицаДанных_Косвенные.НайтиСтроки(СтруктураОтбораДанных); 	
				
				СтруктураОтбораПроцентов = Новый Структура("Организация,Проект,ПериодОтчета",СтрРасч.Организация,ЭлПроект.Проект,ЭлМесяц);	
				ДанныеПроцентовЗаМесяц = ТаблицаПроцентов_РаспределениеКосвенные.НайтиСтроки(СтруктураОтбораПроцентов); 
				
				
				Для Каждого СтрДанные Из ДанныеКосвенные Цикл        
								
						
					Если ДанныеПроцентовЗаМесяц.Количество() > 0 Тогда    			
						ПроцентЗаМесяц = ДанныеПроцентовЗаМесяц[0].ПроцентБЛ;
					Иначе     
						СуммаНарастающая = СуммаНарастающая + СтрДанные[ПризнакРасчетаПланФакт]; 
						Продолжить;
					КонецЕсли;  
					
					НовСтр = ТаблицаДанныхОтчета.Добавить();
					НовСтр.Направление = СтрДанные.Направление; 
					НовСтр.Проект = ЭлПроект.Проект;  						
					НовСтр.СтатьяЗатрат = КосвенныеРасходы_СтатьяЗатрат;    
					
					//++
					НовСтр.СтатьяДоходовРасходов = СтрДанные.СтатьяДоходовРасходов;
					//--
					
					СуммаЗаМесяц = СтрДанные[ПризнакРасчетаПланФакт];    
					
					НовСтр[ПризнакРасчетаПланФакт] = ((СуммаНарастающая + СуммаЗаМесяц) * ПроцентЗаМесяц) - СуммаПроцентовНарастающая; 
					
					НовСтр.ПериодОтчета = СтрДанные.ПериодОтчета;    
					НовСтр.ПериодЗаписи = НовСтр.ПериодОтчета.ДатаНачала; 
					НовСтр.Организация = СтрДанные.Организация;  
					
					СуммаПроцентовНарастающая = СуммаПроцентовНарастающая + НовСтр[ПризнакРасчетаПланФакт];  
					
					СуммаНарастающая = СуммаНарастающая + СуммаЗаМесяц;	
				
					
				КонецЦикла;
				
			КонецЦикла;	  
			
		КонецЦикла;   						
					
	КонецЦикла;
	
	Возврат ТаблицаДанныхОтчета;
	//ТаблицаДанныхОтчета.Свернуть("Направление,Проект,СтатьяЗатрат,Организация,ПериодОтчета,ПериодЗаписи,Сумма","СуммаФакт");
	//Для Каждого Стр Из 
	//--}
	
КонецФункции // РассчитаемКосвенныеРасходыОтдельно()   
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеТаблицыЗаполненияДанныхКосвенные()
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	ТаблицаДанныхКосвенные = Новый ТаблицаЗначений;
	ТаблицаДанныхКосвенные.Колонки.Добавить("Направление",Новый ОписаниеТипов("Строка"));//Направление
	ТаблицаДанныхКосвенные.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));//Проект
	ТаблицаДанныхКосвенные.Колонки.Добавить("Сумма",ОписаниеТипаЧисло);//Сумма
	ТаблицаДанныхКосвенные.Колонки.Добавить("ПериодОтчета",Новый ОписаниеТипов("СправочникСсылка.Периоды"));   
	ТаблицаДанныхКосвенные.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));//Организация		
	ТаблицаДанныхКосвенные.Колонки.Добавить("СтатьяЗатрат",Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));//СтатьяЗатрат  	
	ТаблицаДанныхКосвенные.Колонки.Добавить("ПорядокСортировки_СтатьяЗатрат",ОписаниеТипаЧисло);//СтатьяЗатрат
	ТаблицаДанныхКосвенные.Колонки.Добавить("ПериодЗаписи",Новый ОписаниеТипов("Дата"));    	
	ТаблицаДанныхКосвенные.Колонки.Добавить("СуммаФакт",ОписаниеТипаЧисло);//Сумма       
	
	ТаблицаДанныхКосвенные.Колонки.Добавить("СтатьяДоходовРасходов",Новый ОписаниеТипов("СправочникСсылка.СтатьиДоходовИРасходов"));//Сумма 
	
		
	Возврат ТаблицаДанныхКосвенные;
КонецФункции // ПолучениеТаблицыЗаполненияДанныхКосвенные()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПроцентоДляРаспеределенияБЛКосвенные(ПериодыОтчетаМесяц,ПризнакПолученияПроцентов)
	
	ТаблицаПроцентов_РаспределениеКосвенные = Новый ТаблицаЗначений;
	ТаблицаПроцентов_РаспределениеКосвенные.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));  
	ТаблицаПроцентов_РаспределениеКосвенные.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));   
	ТаблицаПроцентов_РаспределениеКосвенные.Колонки.Добавить("ПроцентБЛ",Новый ОписаниеТипов("Число"));  
	ТаблицаПроцентов_РаспределениеКосвенные.Колонки.Добавить("ПериодОтчета",Новый ОписаниеТипов("СправочникСсылка.Периоды"));

	
	СценарииОтчета = Справочники.Сценарии.НайтиПоНаименованию("Сценарий месячный (2025 год)");       
	//тПериодыОтчета = ПолучениеПеридовОтчета();  
	тПериодыОтчета = ПериодыОтчетаМесяц;
	
	РТСТ = Справочники.Организации.НайтиПоНаименованию("РТС-ТЕНДЕР ООО");
	ЦРЭ = Справочники.Организации.НайтиПоНаименованию("АО ""ЦРЭ""");
	ОТС = Справочники.Организации.НайтиПоНаименованию("АО ""ОТС""");
	Академия = Справочники.Организации.НайтиПоНаименованию("РТС-АКАДЕМИЯ ООО");
	Холдинг = Справочники.Организации.НайтиПоНаименованию("АО ""РТС-холдинг""");
	Силует = Справочники.Организации.НайтиПоНаименованию("Силуэт");
	Текса = Справочники.Организации.НайтиПоНаименованию("ТЕКСА АО");     	
	
	СоответствиеКодовОтчетовКОрганизации_РаспределениеКосвенные = Новый Соответствие;  
	СоответствиеКодовОтчетовКОрганизации_РаспределениеКосвенные.Вставить("РаспределениеКосвенныхРТС",РТСТ); 
	СоответствиеКодовОтчетовКОрганизации_РаспределениеКосвенные.Вставить("РаспределениеКосвенныхЦРЭ",ЦРЭ);
	СоответствиеКодовОтчетовКОрганизации_РаспределениеКосвенные.Вставить("РаспределениеКосвенныхОТС",ОТС);
	СоответствиеКодовОтчетовКОрганизации_РаспределениеКосвенные.Вставить("РаспределениеКосвенныхРТСА",Академия);
	СоответствиеКодовОтчетовКОрганизации_РаспределениеКосвенные.Вставить("РаспределениеКосвенныхХолдинг",Холдинг);
	СоответствиеКодовОтчетовКОрганизации_РаспределениеКосвенные.Вставить("РаспределениеКосвенныхСилуэт",Силует);
	СоответствиеКодовОтчетовКОрганизации_РаспределениеКосвенные.Вставить("РаспределениеКосвенныхТекса",Текса);
	
	Для Каждого ЭлСоответствия Из СоответствиеКодовОтчетовКОрганизации_РаспределениеКосвенные Цикл  
		
		СтруктураПараметровОтбора   = Новый Структура("ВидОтчета,ПериодОтчета,Сценарий",  
		Справочники.ВидыОтчетов.НайтиПоКоду(ЭлСоответствия.Ключ),тПериодыОтчета,СценарииОтчета);	
		РаскрываемыеАналитики       = Новый Структура("Аналитика1");	
		тЗначенияПоказателейВидаОтчета = СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(
		СтруктураПараметровОтбора,РаскрываемыеАналитики);    	
		
		Если  тЗначенияПоказателейВидаОтчета.Количество() > 0 Тогда  
			Для Каждого СтрПоказателя Из  тЗначенияПоказателейВидаОтчета Цикл   
				Если СтрПоказателя.ПоказательОтчета.Наименование = ПризнакПолученияПроцентов Тогда
					НовСтр = ТаблицаПроцентов_РаспределениеКосвенные.Добавить();
					НовСтр.Проект = СтрПоказателя.Аналитика1;
					НовСтр.Организация = ЭлСоответствия.Значение;
					НовСтр.ПроцентБЛ = СтрПоказателя.Значение;   
					НовСтр.ПериодОтчета = СтрПоказателя.ПериодОтчета;  
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПроцентов_РаспределениеКосвенные;
	
КонецФункции // ПолучениеПроцентоДляРаспеределенияБЛКосвенные()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция СопоставлениеДанныхПланФакт(ТаблицаДанных_План,ДатаНачалаОтчета,ДатаОкончанияОтчета,ОбрабатыватьКосвенные,ВложенаяСхемаВариантОтчета,МассивПериодовОтчета)   
		
	//ТаблицаДанных_Факт = ПолучениеДанныхФакта();   
	ТаблицаДанных_Факт = ПолучениеДанныхФакта(ДатаНачалаОтчета,ДатаОкончанияОтчета,МассивПериодовОтчета);
	//{Воронков А.Д. 13.05.2025 ++
	//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409001/?workitem=409668
	ТаблицаДанных_План.Свернуть("Направление,Проект,СтатьяЗатрат,СтатьяЗатратКод,СтатьяДоходовРасходов,НазначениеПлатежа,Контрагент,Регион,ПериодОтчета,Организация,ПериодЗаписи,ПериодОтчетаРодитель","Сумма");
	//--}
		
	ПризнакПолученияПроцентов = "Данные процентов процент факт";//Факт
	ПризнакРасчетаПланФакт = "СуммаФакт"; //Сумма фактического значения 	    
	СоответствиеПроектовБЛ = СоответствиеПроектовБЛ();	
	ВладелецСправочника = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Проект");  
	ST_НСИ_Проект = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000019",,,ВладелецСправочника); //ST+НСИ	
	G_Маркет_Проект =  Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000009",,,ВладелецСправочника); //G-Маркет 
	
	Поставщики =  Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000007",,,ВладелецСправочника); //Проектный офис

	СтруктураТаблиц = ОтбремКосвенныеРасходыФактаОтдельно(ТаблицаДанных_Факт,ПризнакПолученияПроцентов,ОбрабатыватьКосвенные);
	
	//Обработка косвенных расходов
	//{Воронков А.Д. 18.06.2025 ++ 
	//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/408999/  
	ПериодыОтчетаМесяц = ПериодыУХ.ПолучитьПодчиненныеПериоды(ДатаНачалаОтчета,ДатаОкончанияОтчета,Перечисления.Периодичность.Месяц);
	
	ОбработаемКосвенныеРасходыОтдельно(СтруктураТаблиц.ТаблицаДанных_Факт,СтруктураТаблиц.ТаблицаДанных_Косвенные,ПризнакРасчетаПланФакт,ПризнакПолученияПроцентов,ПериодыОтчетаМесяц,ДатаНачалаОтчета);   	
	ДозаполнитьДанныеФактПередОбъединениемСПланом(СтруктураТаблиц.ТаблицаДанных_Факт);
	//--}
	
	//Выполнение запроса для объединения плана и факта
	РезультатЗапроса = ВыполнитьЗапросОбъединениеПланФакт(ТаблицаДанных_План,СтруктураТаблиц.ТаблицаДанных_Факт,ДатаНачалаОтчета,ДатаОкончанияОтчета);
	
	//Обработка несопоставленных данных
	ОбработаемНесопоставленныйФактОтдельно(РезультатЗапроса,СтруктураТаблиц.ТаблицаДанных_Факт);       
	
	//{Воронков А.Д. 18.06.2025 ++ 
	//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/408999/
	//ОбработаемКосвенныеРасходыОтдельно(РезультатЗапроса,СтруктураТаблиц.ТаблицаДанных_Косвенные,ПризнакРасчетаПланФакт,ПризнакПолученияПроцентов);	
	//--} 
	
	// Подготовка данных для сортировки
	//{Воронков А.Д. 14.05.2025 ++   
	//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409720/
	//Сортировка по затратам (Комиссии,Агентские,ОРЕХ,Мотивация,Прочие доходы/расходы) и т.д.
	СоответствиеПорядкаСортировкиНаправление = ПолучениеСоответсвияПорядкаСортировкиНаправление();  
	ДополнитьТаблицуКолонкамиДляСортировки(РезультатЗапроса);
	//--}
	
	//Обработка строк результата
	ОбработатьСтрокиРезультатаОбъединенияПланФакт(РезультатЗапроса,ST_НСИ_Проект,G_Маркет_Проект,Поставщики,СоответствиеПорядкаСортировкиНаправление,СоответствиеПроектовБЛ);
	
	//Сортировка результата
	//{Воронков А.Д. 19.05.2025 ++
	//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409720/
	РезультатЗапроса = ОтсортируемТаблицуДанныхПередВыводом(РезультатЗапроса,ДатаНачалаОтчета,ДатаОкончанияОтчета,ВложенаяСхемаВариантОтчета);
	//РезультатЗапроса.Сортировать("ПериодОтчета");
	//--}	
	
	Возврат РезультатЗапроса;

КонецФункции // СопоставлениеДанныхПланФакт()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеДанныхФакта(ДатаНачалаОтчета,ДатаОкончанияОтчета,МассивПериодовНечисловыеПоказатели)
	
	МассивПравилОбработки = Новый Массив;
	МассивПравилОбработки.Добавить("ЗагрузкаФакта");     
	
	ПоказателиЧисловые = Новый Массив;
	ПоказателиЧисловые.Добавить("ДанныеФакт_Сумма");  
	
	ПоказателиНечисловые = Новый Массив;
	ПоказателиНечисловые.Добавить("ДанныеФакт_РасходыДоходы");      
	
	ПоказателиНечисловые_ПроектПеревод = Новый Массив;
	ПоказателиНечисловые_ПроектПеревод.Добавить("ДанныеФакт_ПроектТрансферт");

	
	ЗначенияИсключения = Новый Массив;
	ЗначенияИсключения.Добавить("Компенсация ЦРЭ"); 
	ЗначенияИсключения.Добавить("ВГО");   	
	ЗначенияИсключения.Добавить("Дельта ФОТ-Компенсация");  
	ЗначенияИсключения.Добавить("Капитал3");
	
	МассивСценариев = Новый Массив;
	МассивСценариев.Добавить(Справочники.Сценарии.НайтиПоНаименованию("Сценарий месячный (2025 год)"));
	МассивСценариев.Добавить(Справочники.Сценарии.НайтиПоНаименованию("Сценарий месячный (2025 год) - SA Компания"));   
	   
	Запрос = Новый Запрос;     
	Запрос.УстановитьПараметр("МассивПравилОбработки", МассивПравилОбработки);
	Запрос.УстановитьПараметр("ПоказателиЧисловые", ПоказателиЧисловые);  
	Запрос.УстановитьПараметр("ПоказателиНечисловые", ПоказателиНечисловые);   
	Запрос.УстановитьПараметр("ПоказателиНечисловые_ПроектПеревод", ПоказателиНечисловые_ПроектПеревод); 
	Запрос.УстановитьПараметр("ЗначенияИсключения", ЗначенияИсключения);
	Запрос.УстановитьПараметр("Сценарий", МассивСценариев); 
		
	//{Воронков А.Д. 26.05.2025 ++    
	//Добавляем ЭО, которые загружены отдельно за Апрель 2025 г.
	МассивСценариев.Добавить(Справочники.Сценарии.НайтиПоНаименованию("Сценарий помесячный (2025 год)"));
	МассивСценариев.Добавить(Справочники.Сценарии.НайтиПоНаименованию("Сценарий помесячный (2025 год) - SA Компания"));  
	
	//МассивПериодовНечисловыеПоказатели = Новый Массив;   
	//Если ЭлМесяц = Неопределено Тогда
	//	МассивПериодовНечисловыеПоказатели.Добавить(Справочники.Периоды.НайтиПоНаименованию("Январь 2025 г."));  
	//	МассивПериодовНечисловыеПоказатели.Добавить(Справочники.Периоды.НайтиПоНаименованию("Февраль 2025 г."));
	//	МассивПериодовНечисловыеПоказатели.Добавить(Справочники.Периоды.НайтиПоНаименованию("Март 2025 г."));
	//	МассивПериодовНечисловыеПоказатели.Добавить(Справочники.Периоды.НайтиПоНаименованию("Апрель 2025 г."));  
	//Иначе  
	//	МассивПериодовНечисловыеПоказатели = ЭлМесяц;   
	//КонецЕсли;
	//--}
	
	//{Воронков А.Д. 26.05.2025 ++    
	//Добавляем ЭО, которые загружены отдельно за Апрель 2025 г.
	Запрос.УстановитьПараметр("МассивПериодовНечисловыеПоказатели", МассивПериодовНечисловыеПоказатели);     	
	//Запрос.УстановитьПараметр("НачПер", ДатаНачалаОтчета); 
	//Запрос.УстановитьПараметр("КонПер", ДатаОкончанияОтчета);
	//--}

	
	//{Воронков А.Д. 13.05.2025 ++
	//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409540
	//Запрос.Текст = ПолучениеЗапросаВыборкаДанныхФакта();  
	Запрос.Текст = ПолучениеЗапросаВыборкаДанныхФактаПомесячно();
	//--}   
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();    
	
	ДополнитьТаблицу(ПолучениеДанныхЗначенияФактическихПоказателейРассчитанный(МассивПериодовНечисловыеПоказатели),РезультатЗапроса);
	
	Возврат РезультатЗапроса;	

КонецФункции  
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеЗапросаОбъединенияПланФакт()
	
	Возврат "ВЫБРАТЬ
	        |	ВТ_ТаблицаПлан.Проект КАК Проект,
	        |	ВТ_ТаблицаПлан.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	ВТ_ТаблицаПлан.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	        |	ВТ_ТаблицаПлан.НазначениеПлатежа КАК НазначениеПлатежа,
	        |	ВЫРАЗИТЬ(ВТ_ТаблицаПлан.Контрагент КАК СТРОКА(150)) КАК Контрагент,
	        |	ВТ_ТаблицаПлан.Регион КАК Регион,
	        |	ВТ_ТаблицаПлан.Сумма КАК Сумма,
	        |	ВТ_ТаблицаПлан.ПериодОтчета КАК ПериодОтчета,
	        |	ВТ_ТаблицаПлан.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
	        |	ВЫРАЗИТЬ(ВТ_ТаблицаПлан.Направление КАК СТРОКА(30)) КАК Направление,
	        |	ВТ_ТаблицаПлан.Организация КАК Организация,
	        |	ВТ_ТаблицаПлан.ПериодЗаписи КАК ПериодЗаписи
	        |ПОМЕСТИТЬ ВТ_ТаблицаПлан
	        |ИЗ
	        |	&ВТ_ТаблицаПлан КАК ВТ_ТаблицаПлан
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТаблицаФакт.Проект КАК Проект,
	        |	ВТ_ТаблицаФакт.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	ВТ_ТаблицаФакт.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	        |	ВТ_ТаблицаФакт.НазначениеПлатежа КАК НазначениеПлатежа,
	        |	ВЫРАЗИТЬ(ВТ_ТаблицаФакт.Контрагент КАК СТРОКА(150)) КАК Контрагент,
	        |	ВТ_ТаблицаФакт.Регион КАК Регион,
	        |	ВТ_ТаблицаФакт.СуммаФакт КАК СуммаФакт,
	        |	ВТ_ТаблицаФакт.ПериодОтчета КАК ПериодОтчета,
	        |	ВТ_ТаблицаФакт.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
	        |	ВТ_ТаблицаФакт.Организация КАК Организация,
	        |	ВТ_ТаблицаФакт.ПериодЗаписи  КАК ПериодЗаписи,
			|	ВЫРАЗИТЬ(ВТ_ТаблицаФакт.Направление КАК СТРОКА(30)) КАК Направление
	        |ПОМЕСТИТЬ ВТ_ТаблицаФакт
	        |ИЗ
	        |	&ВТ_ТаблицаФакт КАК ВТ_ТаблицаФакт
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТаблицаПлан.Проект КАК Проект,
	        |	ВТ_ТаблицаПлан.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	ВТ_ТаблицаПлан.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	        |	ВТ_ТаблицаПлан.НазначениеПлатежа КАК НазначениеПлатежа,
	        |	ВТ_ТаблицаПлан.Контрагент КАК Контрагент,
	        |	ВТ_ТаблицаПлан.Регион КАК Регион,
	        |	ВТ_ТаблицаПлан.Сумма КАК Сумма,
	        |	ВТ_ТаблицаПлан.ПериодОтчета КАК ПериодОтчета,
	        |	ВТ_ТаблицаПлан.Направление КАК Направление,
	        |	ВТ_ТаблицаПлан.Организация КАК Организация,
	        |	ВТ_ТаблицаФакт.СуммаФакт КАК СуммаФакт,
	        |	ВТ_ТаблицаПлан.Сумма - ВТ_ТаблицаФакт.СуммаФакт КАК СуммаОтклонение,   
			//|	ВТ_ТаблицаФакт.СуммаФакт КАК ОтклонениеПроцент,
	        |	0 КАК ОтклонениеПроцент,
	        |	ВТ_ТаблицаПлан.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель
	        |ИЗ
	        |	ВТ_ТаблицаПлан КАК ВТ_ТаблицаПлан
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаФакт КАК ВТ_ТаблицаФакт
	        |		ПО ВТ_ТаблицаПлан.Проект = ВТ_ТаблицаФакт.Проект
	        |			И ВТ_ТаблицаПлан.СтатьяЗатрат = ВТ_ТаблицаФакт.СтатьяЗатрат
	        |			И ВТ_ТаблицаПлан.СтатьяДоходовРасходов = ВТ_ТаблицаФакт.СтатьяДоходовРасходов
	        |			И ВТ_ТаблицаПлан.НазначениеПлатежа = ВТ_ТаблицаФакт.НазначениеПлатежа
	        |			И ВТ_ТаблицаПлан.Контрагент = ВТ_ТаблицаФакт.Контрагент
	        |			И ВТ_ТаблицаПлан.Регион = ВТ_ТаблицаФакт.Регион
	        |			И ВТ_ТаблицаПлан.ПериодОтчета = ВТ_ТаблицаФакт.ПериодОтчета
	        |			И ВТ_ТаблицаПлан.Организация = ВТ_ТаблицаФакт.Организация
	        |			И ВТ_ТаблицаПлан.ПериодОтчетаРодитель = ВТ_ТаблицаФакт.ПериодОтчетаРодитель 
			|			И ВТ_ТаблицаПлан.Направление = ВТ_ТаблицаФакт.Направление
	        |ГДЕ  
			|	ВЫБОР
			|			КОГДА ВТ_ТаблицаПлан.ПериодЗаписи = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ВТ_ТаблицаПлан.ПериодЗаписи МЕЖДУ &НачПер И &КонПер
			|		КОНЕЦ
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ПериодОтчета";
	

КонецФункции // ПолучениеЗапросаОбъединенияПланФакт()   
// <Описание Процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Процедура ОбработаемНесопоставленныйФактОтдельно(РезультатЗапроса,ТаблицаДанных_Факт)
		
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("ВТ_Факт",РезультатЗапроса);
	Запрос.Текст = ПолучениеЗапросаАналитикиСопоставленногоФакта();
			
	ТаблФакт = Запрос.Выполнить().Выгрузить();
		
	ТаблицаДанных_Факт_Копия = ТаблицаДанных_Факт.Скопировать();
	
	ЗапросНесопоставленныйФакт = Новый Запрос; 
	ЗапросНесопоставленныйФакт.УстановитьПараметр("ВТ_ДанныеФактСопоставленный",ТаблФакт); //Сворачиваем строки по аналитикам, чтобы исключить строки, которые сметчились с план/фактом
	ЗапросНесопоставленныйФакт.УстановитьПараметр("ВТ_ДанныеФакт",ТаблицаДанных_Факт_Копия); //Таблица Факта, по которой будем искать уже смечтченные строки, и исключать их из повторной обработки
	ЗапросНесопоставленныйФакт.Текст = ПолучениеЗапросаОбработаемНесопоставленныйФакт();   
	
	РезультатЗапроса_НесопоставленныйФакт = ЗапросНесопоставленныйФакт.Выполнить().Выгрузить();  		
	
	Для Каждого СтрокаФакт Из РезультатЗапроса_НесопоставленныйФакт Цикл  
		Если СтрокаФакт.СтатьяЗатрат.Код = "00-000018" Тогда //Мотивация  
			СтрокаФакт.Направление = "Мотивация";	
		Иначе 
			СтрокаФакт.Направление = "ОРЕХ";	
		КонецЕсли;
	КонецЦикла;
	
	ДополнитьТаблицу(РезультатЗапроса_НесопоставленныйФакт,РезультатЗапроса); 
	
КонецПроцедуры // ОбработаемНесопоставленныйФактОтдельно()  
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеЗапросаОбработаемНесопоставленныйФакт()
	
	Возврат "ВЫБРАТЬ
	        |	ВТ_ДанныеФактСопоставленный.Проект КАК Проект,
	        |	ВТ_ДанныеФактСопоставленный.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	ВТ_ДанныеФактСопоставленный.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	        |	ВТ_ДанныеФактСопоставленный.НазначениеПлатежа КАК НазначениеПлатежа,
			|	ВТ_ДанныеФактСопоставленный.Контрагент КАК Контрагент,
			|	ВТ_ДанныеФактСопоставленный.Регион КАК Регион,
			|	ВТ_ДанныеФактСопоставленный.СуммаФакт КАК СуммаФакт,
			|	ВТ_ДанныеФактСопоставленный.ПериодОтчета КАК ПериодОтчета,  
			|	ВТ_ДанныеФактСопоставленный.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель, 
			|	ВТ_ДанныеФактСопоставленный.Организация КАК Организация,
	        |	0 КАК Сумма,
	        |	0 КАК СуммаОтклонение,
	        |	0 КАК ОтклонениеПроцент
	        |ПОМЕСТИТЬ ВТ_ДанныеФактСопоставленный
	        |ИЗ
	        |	&ВТ_ДанныеФактСопоставленный КАК ВТ_ДанныеФактСопоставленный
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДанныеФакт.Проект КАК Проект,
	        |	ВТ_ДанныеФакт.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	ВТ_ДанныеФакт.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	        |	ВТ_ДанныеФакт.НазначениеПлатежа КАК НазначениеПлатежа,
	        |	ВТ_ДанныеФакт.Контрагент КАК Контрагент,
	        |	ВТ_ДанныеФакт.Регион КАК Регион,
	        |	ВТ_ДанныеФакт.СуммаФакт КАК СуммаФакт,
	        |	ВТ_ДанныеФакт.ПериодОтчета КАК ПериодОтчета,  
			|	ВТ_ДанныеФакт.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель, 
			|	ВТ_ДанныеФакт.Организация КАК Организация,
	        |	0 КАК Сумма,
	        |	0 КАК СуммаОтклонение,
	        |	0 КАК ОтклонениеПроцент
	        |ПОМЕСТИТЬ ВТ_ДанныеФакт
	        |ИЗ
	        |	&ВТ_ДанныеФакт КАК ВТ_ДанныеФакт
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДанныеФакт.Проект КАК Проект,
	        |	ВТ_ДанныеФакт.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	ВТ_ДанныеФакт.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	        |	ВТ_ДанныеФакт.НазначениеПлатежа КАК НазначениеПлатежа,
	        |	ВТ_ДанныеФакт.Контрагент КАК Контрагент,
	        |	ВТ_ДанныеФакт.Регион КАК Регион,
	        |	ВТ_ДанныеФакт.СуммаФакт КАК СуммаФакт,
	        |	ВТ_ДанныеФакт.ПериодОтчета КАК ПериодОтчета,
			|	ВТ_ДанныеФакт.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
	        |	ВЫБОР
	        |		КОГДА НЕ ВТ_ДанныеФактСопоставленный.Проект ЕСТЬ NULL
	        |				И НЕ ВТ_ДанныеФактСопоставленный.СтатьяЗатрат ЕСТЬ NULL
	        |				И НЕ ВТ_ДанныеФактСопоставленный.СтатьяДоходовРасходов ЕСТЬ NULL
	        |				И НЕ ВТ_ДанныеФактСопоставленный.НазначениеПлатежа ЕСТЬ NULL
	        |				И НЕ ВТ_ДанныеФактСопоставленный.Контрагент ЕСТЬ NULL
	        |				И НЕ ВТ_ДанныеФактСопоставленный.Регион ЕСТЬ NULL
	        |				И НЕ ВТ_ДанныеФактСопоставленный.ПериодОтчета ЕСТЬ NULL  
			|				И НЕ ВТ_ДанныеФактСопоставленный.ПериодОтчетаРодитель ЕСТЬ NULL     
			//{Воронков А.Д. 24.06.2025 ++
			| 			    И НЕ ВТ_ДанныеФактСопоставленный.Организация ЕСТЬ NULL
			//--}
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК НеОбрабатываем,
	        |	ВТ_ДанныеФакт.Сумма - ВТ_ДанныеФакт.СуммаФакт КАК СуммаОтклонение,
	        |	ВТ_ДанныеФакт.Сумма КАК Сумма,
	        |	ВТ_ДанныеФакт.ОтклонениеПроцент КАК ОтклонениеПроцент,
			|	ВТ_ДанныеФакт.Организация КАК Организация
	        |ПОМЕСТИТЬ ВТ_ВыборкаДанных
	        |ИЗ
	        |	ВТ_ДанныеФакт КАК ВТ_ДанныеФакт
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеФактСопоставленный КАК ВТ_ДанныеФактСопоставленный
	        |		ПО ВТ_ДанныеФакт.Проект = ВТ_ДанныеФактСопоставленный.Проект
	        |			И ВТ_ДанныеФакт.СтатьяЗатрат = ВТ_ДанныеФактСопоставленный.СтатьяЗатрат
	        |			И ВТ_ДанныеФакт.СтатьяДоходовРасходов = ВТ_ДанныеФактСопоставленный.СтатьяДоходовРасходов
	        |			И ВТ_ДанныеФакт.НазначениеПлатежа = ВТ_ДанныеФактСопоставленный.НазначениеПлатежа
	        |			И ВТ_ДанныеФакт.Контрагент = ВТ_ДанныеФактСопоставленный.Контрагент
	        |			И ВТ_ДанныеФакт.Регион = ВТ_ДанныеФактСопоставленный.Регион
	        |			И ВТ_ДанныеФакт.ПериодОтчета = ВТ_ДанныеФактСопоставленный.ПериодОтчета 
			|			И ВТ_ДанныеФакт.ПериодОтчетаРодитель = ВТ_ДанныеФактСопоставленный.ПериодОтчетаРодитель  
			//{Воронков А.Д. 24.06.2025 ++
			| 			И ВТ_ДанныеФакт.Организация = ВТ_ДанныеФактСопоставленный.Организация 
			//--}
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ВыборкаДанных.Проект КАК Проект,
			|	ВТ_ВыборкаДанных.СтатьяЗатрат КАК СтатьяЗатрат,
			|	ВТ_ВыборкаДанных.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
			|	ВТ_ВыборкаДанных.НазначениеПлатежа КАК НазначениеПлатежа,
			|	ВТ_ВыборкаДанных.Контрагент КАК Контрагент,
			|	ВТ_ВыборкаДанных.Регион КАК Регион,
			|	ВТ_ВыборкаДанных.СуммаФакт КАК СуммаФакт,
			|	ВТ_ВыборкаДанных.ПериодОтчета КАК ПериодОтчета,  
			|	ВТ_ВыборкаДанных.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
			|	ВТ_ВыборкаДанных.Организация КАК Организация,		
			|	ВТ_ВыборкаДанных.НеОбрабатываем КАК НеОбрабатываем,
			|	ВЫРАЗИТЬ("""" КАК СТРОКА(15)) КАК Направление,
			|	ВТ_ВыборкаДанных.СуммаОтклонение КАК СуммаОтклонение,
			|	ВТ_ВыборкаДанных.Сумма КАК Сумма,
	        |	ВТ_ВыборкаДанных.ОтклонениеПроцент КАК ОтклонениеПроцент
	        |ИЗ
	        |	ВТ_ВыборкаДанных КАК ВТ_ВыборкаДанных
	        |ГДЕ
	        |	НЕ ВТ_ВыборкаДанных.НеОбрабатываем";
	
			

КонецФункции // ПолучениеЗапросаОбработаемНесопоставленныйФакт()   
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеЗапросаАналитикиСопоставленногоФакта()

	Возврат "ВЫБРАТЬ
		|	ВТ_Факт.Проект КАК Проект,
		|	ВТ_Факт.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВТ_Факт.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
		|	ВТ_Факт.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ВТ_Факт.Контрагент КАК Контрагент,
		|	ВТ_Факт.Регион КАК Регион,
		|	ВТ_Факт.СуммаФакт КАК СуммаФакт,
		|	ВТ_Факт.ПериодОтчета КАК ПериодОтчета,
		|	ВТ_Факт.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
		|	ВТ_Факт.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_Факт
		|ИЗ
		|	&ВТ_Факт КАК ВТ_Факт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Факт.Проект КАК Проект,
		|	ВТ_Факт.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВТ_Факт.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
		|	ВТ_Факт.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ВТ_Факт.Контрагент КАК Контрагент,
		|	ВТ_Факт.Регион КАК Регион,
		|	СУММА(ВТ_Факт.СуммаФакт) КАК СуммаФакт,
		|	ВТ_Факт.ПериодОтчета КАК ПериодОтчета,
		|	ВТ_Факт.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
		|	ВТ_Факт.Организация КАК Организация
		|ИЗ
		|	ВТ_Факт КАК ВТ_Факт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Факт.Проект,
		|	ВТ_Факт.СтатьяЗатрат,
		|	ВТ_Факт.СтатьяДоходовРасходов,
		|	ВТ_Факт.Регион,
		|	ВТ_Факт.ПериодОтчета,
		|	ВТ_Факт.Контрагент,
		|	ВТ_Факт.НазначениеПлатежа,
		|	ВТ_Факт.ПериодОтчетаРодитель,
		|	ВТ_Факт.Организация
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_Факт.СуммаФакт) <> 0";
	
КонецФункции // ПолучениеЗапросаСопоставленногоПланФакта()     
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеЗапросаВыборкаДанныхФакта()     
				
		Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	ЗначенияПоказателейОтчетов6.Показатель КАК Показатель,
	    |	ЗначенияПоказателейОтчетов6.Аналитика1 КАК Проект,
	    |	ЗначенияПоказателейОтчетов6.Аналитика2 КАК СтатьяЗатрат,
	    |	ЗначенияПоказателейОтчетов6.Аналитика3 КАК СтатьяДоходовРасходов,
	    |	ЗначенияПоказателейОтчетов6.Аналитика4 КАК НазначениеПлатежа,
	    |	ЗначенияПоказателейОтчетов6.Аналитика5.Наименование КАК Контрагент,
	    |	ЗначенияПоказателейОтчетов6.Аналитика6 КАК Регион,
	    |	СУММА(ЗначенияПоказателейОтчетов6.Значение) КАК СуммаФакт,
	    |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета КАК ПериодОтчета,
	    |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.Родитель КАК ПериодОтчетаРодитель,
	    |	ЗначенияПоказателейОтчетов6.Версия.Организация КАК Организация,
	    |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.ДатаНачала КАК ПериодЗаписи,
	    |	ЗначенияПоказателейОтчетов6.Версия.Сценарий КАК ВерсияСценарий,
	    |	ЗначенияПоказателейОтчетов6.Версия.ЭкземплярОтчета КАК ВерсияЭкземплярОтчета
	    |ПОМЕСТИТЬ ВТ_ЧисловыеПоказатели
	    |ИЗ
	    |	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК ЗначенияПоказателейОтчетов6
	    |ГДЕ
	    |	ЗначенияПоказателейОтчетов6.Показатель.Код В(&ПоказателиЧисловые)
	    |	И ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	    |	И ЗначенияПоказателейОтчетов6.Версия.Сценарий В(&Сценарий) 
		//{Воронков А.Д. 26.05.2025 ++    
		//Добавляем ЭО, которые загружены отдельно за Апрель 2025 г.
		|	И ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета В(&МассивПериодовНечисловыеПоказатели)    
		//--}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ЗначенияПоказателейОтчетов6.Версия.Организация,
	    |	ЗначенияПоказателейОтчетов6.Аналитика4,
	    |	ЗначенияПоказателейОтчетов6.Аналитика3,
	    |	ЗначенияПоказателейОтчетов6.Показатель,
	    |	ЗначенияПоказателейОтчетов6.Аналитика1,
	    |	ЗначенияПоказателейОтчетов6.Аналитика2,
	    |	ЗначенияПоказателейОтчетов6.Аналитика6,
	    |	ЗначенияПоказателейОтчетов6.Аналитика5.Наименование,
	    |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета,
	    |	ЗначенияПоказателейОтчетов6.Версия.Сценарий,
	    |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.Родитель,
	    |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.ДатаНачала,
	    |	ЗначенияПоказателейОтчетов6.Версия.ЭкземплярОтчета
	    |
	    |ИМЕЮЩИЕ
	    |	СУММА(ЗначенияПоказателейОтчетов6.Значение) <> 0
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	ЗначенияПоказателейОтчетовНечисловые.Показатель КАК Показатель,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1 КАК Проект,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2 КАК СтатьяЗатрат,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3 КАК СтатьяДоходовРасходов,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4 КАК НазначениеПлатежа,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5.Наименование КАК Контрагент,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6 КАК Регион,
	    |	ЗначенияПоказателейОтчетовНечисловые.Значение КАК Значение,
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета КАК ПериодОтчета,
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.Организация КАК Организация
	    |ПОМЕСТИТЬ ВТ_НечисловыеПоказатели
	    |ИЗ
	    |	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	    |ГДЕ
	    |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиНечисловые)
	    |	И ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	    |	И ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий В(&Сценарий)
	    |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ОсновнаяВерсия
	    |	И ЗначенияПоказателейОтчетовНечисловые.Значение В(&ЗначенияИсключения)
	    | 
		//{Воронков А.Д. 26.05.2025 ++    
		//Добавляем ЭО, которые загружены отдельно за Апрель 2025 г.
		|	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета В(&МассивПериодовНечисловыеПоказатели)    
		//--}
	    |СГРУППИРОВАТЬ ПО
	    |	ЗначенияПоказателейОтчетовНечисловые.Показатель,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6,
	    |	ЗначенияПоказателейОтчетовНечисловые.Значение,
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета,
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.Организация,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5.Наименование
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.ЭкземплярОтчета КАК ВерсияЭкземплярОтчета,
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий КАК ВерсияСценарий,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1 КАК Аналитика1,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2 КАК Аналитика2,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3 КАК Аналитика3,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4 КАК Аналитика4,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5 КАК Аналитика5,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6 КАК Аналитика6,
	    |	МАКСИМУМ(ЗначенияПоказателейОтчетовНечисловые.ДатаИзменения) КАК ДатаИзменения,
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.Организация КАК ВерсияОрганизация,
	    |	ЗначенияПоказателейОтчетовНечисловые.Показатель КАК Показатель
	    |ПОМЕСТИТЬ ВТ_ПроектТрансферт_Максимум
	    |ИЗ
	    |	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	    |ГДЕ
	    |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиНечисловые_ПроектПеревод)
	    |	И ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	    |	И ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий В(&Сценарий)
	    |	И НЕ ЗначенияПоказателейОтчетовНечисловые.Значение В (&ЗначенияИсключения)    
		//{Воронков А.Д. 26.05.2025 ++    
		//Добавляем ЭО, которые загружены отдельно за Апрель 2025 г.
		|	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета В(&МассивПериодовНечисловыеПоказатели)    
		//--}
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.ЭкземплярОтчета,
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5,
	    |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6,
	    |	ЗначенияПоказателейОтчетовНечисловые.Версия.Организация,
	    |	ЗначенияПоказателейОтчетовНечисловые.Показатель
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ВТ_ПроектТрансферт_Максимум.ВерсияЭкземплярОтчета КАК ВерсияЭкземплярОтчета,
	    |	ВТ_ПроектТрансферт_Максимум.ВерсияСценарий КАК ВерсияСценарий,
	    |	ВТ_ПроектТрансферт_Максимум.Аналитика1 КАК Аналитика1,
	    |	ВТ_ПроектТрансферт_Максимум.Аналитика2 КАК Аналитика2,
	    |	ВТ_ПроектТрансферт_Максимум.Аналитика3 КАК Аналитика3,
	    |	ВТ_ПроектТрансферт_Максимум.Аналитика4 КАК Аналитика4,
	    |	ВТ_ПроектТрансферт_Максимум.Аналитика5 КАК Аналитика5,
	    |	ВТ_ПроектТрансферт_Максимум.Аналитика6 КАК Аналитика6,
	    |	ВТ_ПроектТрансферт_Максимум.ДатаИзменения КАК ДатаИзменения,
	    |	ВТ_ПроектТрансферт_Максимум.ВерсияОрганизация КАК ВерсияОрганизация,
	    |	ЗначенияПоказателейОтчетовНечисловые.Значение КАК Значение
	    |ПОМЕСТИТЬ ВТ_ПроектТрансферт_Итог
	    |ИЗ
	    |	ВТ_ПроектТрансферт_Максимум КАК ВТ_ПроектТрансферт_Максимум
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	    |		ПО ВТ_ПроектТрансферт_Максимум.ВерсияЭкземплярОтчета = ЗначенияПоказателейОтчетовНечисловые.Версия.ЭкземплярОтчета
	    |			И ВТ_ПроектТрансферт_Максимум.ВерсияСценарий = ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий
	    |			И ВТ_ПроектТрансферт_Максимум.Аналитика1 = ЗначенияПоказателейОтчетовНечисловые.Аналитика1
	    |			И ВТ_ПроектТрансферт_Максимум.Аналитика2 = ЗначенияПоказателейОтчетовНечисловые.Аналитика2
	    |			И ВТ_ПроектТрансферт_Максимум.Аналитика3 = ЗначенияПоказателейОтчетовНечисловые.Аналитика3
	    |			И ВТ_ПроектТрансферт_Максимум.Аналитика4 = ЗначенияПоказателейОтчетовНечисловые.Аналитика4
	    |			И ВТ_ПроектТрансферт_Максимум.Аналитика5 = ЗначенияПоказателейОтчетовНечисловые.Аналитика5
	    |			И ВТ_ПроектТрансферт_Максимум.Аналитика6 = ЗначенияПоказателейОтчетовНечисловые.Аналитика6
	    |			И ВТ_ПроектТрансферт_Максимум.ВерсияОрганизация = ЗначенияПоказателейОтчетовНечисловые.Версия.Организация
	    |			И ВТ_ПроектТрансферт_Максимум.ДатаИзменения = ЗначенияПоказателейОтчетовНечисловые.ДатаИзменения
	    |ГДЕ
	    |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиНечисловые_ПроектПеревод)
	    |	И ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	    |	И ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий В(&Сценарий)
	    |	И НЕ ЗначенияПоказателейОтчетовНечисловые.Значение В (&ЗначенияИсключения)
	    |	И (ВЫРАЗИТЬ(ЗначенияПоказателейОтчетовНечисловые.Значение КАК СТРОКА(20))) <> """"  
		//{Воронков А.Д. 26.05.2025 ++    
		//Добавляем ЭО, которые загружены отдельно за Апрель 2025 г.
		|	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета В(&МассивПериодовНечисловыеПоказатели)    
		//--}
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	ВТ_ЧисловыеПоказатели.Показатель КАК Показатель,
	    |	ВТ_ЧисловыеПоказатели.Проект КАК Проект,
	    |	ВТ_ЧисловыеПоказатели.СтатьяЗатрат КАК СтатьяЗатрат,  
		|	ВТ_ЧисловыеПоказатели.СтатьяЗатрат.Код КАК СтатьяЗатратКод,
	    |	ВТ_ЧисловыеПоказатели.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	    |	ВТ_ЧисловыеПоказатели.НазначениеПлатежа КАК НазначениеПлатежа,
	    |	ВТ_ЧисловыеПоказатели.Контрагент КАК Контрагент,
	    |	ВТ_ЧисловыеПоказатели.Регион КАК Регион,
	    |	ВТ_ЧисловыеПоказатели.СуммаФакт КАК СуммаФакт,
	    |	ВТ_ЧисловыеПоказатели.ПериодОтчета КАК ПериодОтчета,
	    |	ВТ_ЧисловыеПоказатели.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
	    |	ВТ_ЧисловыеПоказатели.Организация КАК Организация,
	    |	ВТ_ЧисловыеПоказатели.ПериодЗаписи КАК ПериодЗаписи,
	    |	ВТ_НечисловыеПоказатели.Значение КАК Значение,
	    |	ВТ_ПроектТрансферт_Итог.Значение КАК ПереводПроект,
		|	""ЗначениеДляПодстановки"" КАК Направление
		|ИЗ
	    |	ВТ_ЧисловыеПоказатели КАК ВТ_ЧисловыеПоказатели
	    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НечисловыеПоказатели КАК ВТ_НечисловыеПоказатели
	    |		ПО (ВТ_ЧисловыеПоказатели.Проект = ВТ_НечисловыеПоказатели.Проект)
	    |			И (ВТ_ЧисловыеПоказатели.СтатьяЗатрат = ВТ_НечисловыеПоказатели.СтатьяЗатрат)
	    |			И (ВТ_ЧисловыеПоказатели.СтатьяДоходовРасходов = ВТ_НечисловыеПоказатели.СтатьяДоходовРасходов)
	    |			И (ВТ_ЧисловыеПоказатели.НазначениеПлатежа = ВТ_НечисловыеПоказатели.НазначениеПлатежа)
	    |			И (ВТ_ЧисловыеПоказатели.Контрагент = ВТ_НечисловыеПоказатели.Контрагент)
	    |			И (ВТ_ЧисловыеПоказатели.Регион = ВТ_НечисловыеПоказатели.Регион)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроектТрансферт_Итог КАК ВТ_ПроектТрансферт_Итог
	    |		ПО (ВТ_ЧисловыеПоказатели.Организация = ВТ_ПроектТрансферт_Итог.ВерсияОрганизация
	    |				И ВТ_ЧисловыеПоказатели.ВерсияСценарий = ВТ_ПроектТрансферт_Итог.ВерсияСценарий
	    |				И ВТ_ЧисловыеПоказатели.ВерсияЭкземплярОтчета = ВТ_ПроектТрансферт_Итог.ВерсияЭкземплярОтчета
	    |				И ВТ_ЧисловыеПоказатели.Проект = ВТ_ПроектТрансферт_Итог.Аналитика1
	    |				И ВТ_ЧисловыеПоказатели.СтатьяЗатрат = ВТ_ПроектТрансферт_Итог.Аналитика2
	    |				И ВТ_ЧисловыеПоказатели.СтатьяДоходовРасходов = ВТ_ПроектТрансферт_Итог.Аналитика3
	    |				И ВТ_ЧисловыеПоказатели.НазначениеПлатежа = ВТ_ПроектТрансферт_Итог.Аналитика4
	    |				И ВТ_ЧисловыеПоказатели.Контрагент = ВТ_ПроектТрансферт_Итог.Аналитика5.Наименование
	    |				И ВТ_ЧисловыеПоказатели.Регион = ВТ_ПроектТрансферт_Итог.Аналитика6)
	    |ГДЕ
	    |	ВТ_НечисловыеПоказатели.Значение ЕСТЬ NULL";

		
КонецФункции  
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеЗапросаВыборкаДанныхФактаПомесячно()     
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ЗначенияПоказателейОтчетов6.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1 КАК Проект,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2 КАК СтатьяЗатрат,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3 КАК СтатьяДоходовРасходов,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4 КАК НазначениеПлатежа,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5.Наименование КАК Контрагент,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6 КАК Регион,
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) КАК СуммаФакт,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета КАК ПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.Родитель КАК ПериодОтчетаРодитель,
	        |	ЗначенияПоказателейОтчетов6.Версия.Организация КАК Организация,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.ДатаНачала КАК ПериодЗаписи,
	        |	ЗначенияПоказателейОтчетов6.Версия.Сценарий КАК ВерсияСценарий,
	        |	ЗначенияПоказателейОтчетов6.Версия.ЭкземплярОтчета КАК ВерсияЭкземплярОтчета
	        |ПОМЕСТИТЬ ВТ_ЧисловыеПоказатели
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК ЗначенияПоказателейОтчетов6
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов6.Показатель.Код В(&ПоказателиЧисловые)
	        |	И ЗначенияПоказателейОтчетов6.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетов6.Версия.Сценарий В(&Сценарий)
	        |	И ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета В(&МассивПериодовНечисловыеПоказатели)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов6.Версия.Организация,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Показатель,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5.Наименование,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Версия.Сценарий,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.Родитель,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.ДатаНачала,
	        |	ЗначенияПоказателейОтчетов6.Версия.ЭкземплярОтчета
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1 КАК Проект,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2 КАК СтатьяЗатрат,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3 КАК СтатьяДоходовРасходов,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4 КАК НазначениеПлатежа,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5.Наименование КАК Контрагент,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6 КАК Регион,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение КАК Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета КАК ПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.Организация КАК Организация
	        |ПОМЕСТИТЬ ВТ_НечисловыеПоказатели
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиНечисловые)
	        |	И ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий В(&Сценарий)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ОсновнаяВерсия
	        |	И ЗначенияПоказателейОтчетовНечисловые.Значение В(&ЗначенияИсключения)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета В(&МассивПериодовНечисловыеПоказатели)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.Организация,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5.Наименование
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ЭкземплярОтчета КАК ВерсияЭкземплярОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий КАК ВерсияСценарий,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2 КАК Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3 КАК Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4 КАК Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5 КАК Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6 КАК Аналитика6,
	        |	МАКСИМУМ(ЗначенияПоказателейОтчетовНечисловые.ДатаИзменения) КАК ДатаИзменения,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.Организация КАК ВерсияОрганизация,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель КАК Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета КАК ВерсияПериодОтчета
	        |ПОМЕСТИТЬ ВТ_ПроектТрансферт_Максимум
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиНечисловые_ПроектПеревод)
	        |	И ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий В(&Сценарий)
	        |	И НЕ ЗначенияПоказателейОтчетовНечисловые.Значение В (&ЗначенияИсключения)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета В(&МассивПериодовНечисловыеПоказатели)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ЭкземплярОтчета,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика1,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика2,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика3,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика4,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика5,
	        |	ЗначенияПоказателейОтчетовНечисловые.Аналитика6,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.Организация,
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель,
	        |	ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПроектТрансферт_Максимум.ВерсияЭкземплярОтчета КАК ВерсияЭкземплярОтчета,
	        |	ВТ_ПроектТрансферт_Максимум.ВерсияСценарий КАК ВерсияСценарий,
	        |	ВТ_ПроектТрансферт_Максимум.Аналитика1 КАК Аналитика1,
	        |	ВТ_ПроектТрансферт_Максимум.Аналитика2 КАК Аналитика2,
	        |	ВТ_ПроектТрансферт_Максимум.Аналитика3 КАК Аналитика3,
	        |	ВТ_ПроектТрансферт_Максимум.Аналитика4 КАК Аналитика4,
	        |	ВТ_ПроектТрансферт_Максимум.Аналитика5 КАК Аналитика5,
	        |	ВТ_ПроектТрансферт_Максимум.Аналитика6 КАК Аналитика6,
	        |	ВТ_ПроектТрансферт_Максимум.ДатаИзменения КАК ДатаИзменения,
	        |	ВТ_ПроектТрансферт_Максимум.ВерсияОрганизация КАК ВерсияОрганизация,
	        |	ЗначенияПоказателейОтчетовНечисловые.Значение КАК Значение,
	        |	ВТ_ПроектТрансферт_Максимум.ВерсияПериодОтчета КАК ВерсияПериодОтчета
	        |ПОМЕСТИТЬ ВТ_ПроектТрансферт_Итог
	        |ИЗ
	        |	ВТ_ПроектТрансферт_Максимум КАК ВТ_ПроектТрансферт_Максимум
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	        |		ПО ВТ_ПроектТрансферт_Максимум.ВерсияЭкземплярОтчета = ЗначенияПоказателейОтчетовНечисловые.Версия.ЭкземплярОтчета
	        |			И ВТ_ПроектТрансферт_Максимум.ВерсияСценарий = ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий
	        |			И ВТ_ПроектТрансферт_Максимум.Аналитика1 = ЗначенияПоказателейОтчетовНечисловые.Аналитика1
	        |			И ВТ_ПроектТрансферт_Максимум.Аналитика2 = ЗначенияПоказателейОтчетовНечисловые.Аналитика2
	        |			И ВТ_ПроектТрансферт_Максимум.Аналитика3 = ЗначенияПоказателейОтчетовНечисловые.Аналитика3
	        |			И ВТ_ПроектТрансферт_Максимум.Аналитика4 = ЗначенияПоказателейОтчетовНечисловые.Аналитика4
	        |			И ВТ_ПроектТрансферт_Максимум.Аналитика5 = ЗначенияПоказателейОтчетовНечисловые.Аналитика5
	        |			И ВТ_ПроектТрансферт_Максимум.Аналитика6 = ЗначенияПоказателейОтчетовНечисловые.Аналитика6
	        |			И ВТ_ПроектТрансферт_Максимум.ВерсияОрганизация = ЗначенияПоказателейОтчетовНечисловые.Версия.Организация
	        |			И ВТ_ПроектТрансферт_Максимум.ВерсияПериодОтчета = ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета 
			|			И ВТ_ПроектТрансферт_Максимум.ДатаИзменения = ЗначенияПоказателейОтчетовНечисловые.ДатаИзменения
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код В(&ПоказателиНечисловые_ПроектПеревод)
	        |	И ЗначенияПоказателейОтчетовНечисловые.ПравилоОбработки.Владелец.Родитель.Код В(&МассивПравилОбработки)
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.Сценарий В(&Сценарий)
	        |	И НЕ ЗначенияПоказателейОтчетовНечисловые.Значение В (&ЗначенияИсключения)
	        |	И (ВЫРАЗИТЬ(ЗначенияПоказателейОтчетовНечисловые.Значение КАК СТРОКА(20))) <> """"
	        |	И ЗначенияПоказателейОтчетовНечисловые.Версия.ПериодОтчета В(&МассивПериодовНечисловыеПоказатели)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_ЧисловыеПоказатели.Показатель КАК Показатель,
	        |	ВТ_ЧисловыеПоказатели.Проект КАК Проект,
	        |	ВТ_ЧисловыеПоказатели.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	ВТ_ЧисловыеПоказатели.СтатьяЗатрат.Код КАК СтатьяЗатратКод,
	        |	ВТ_ЧисловыеПоказатели.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	        |	ВТ_ЧисловыеПоказатели.НазначениеПлатежа КАК НазначениеПлатежа,
	        |	ВТ_ЧисловыеПоказатели.Контрагент КАК Контрагент,
	        |	ВТ_ЧисловыеПоказатели.Регион КАК Регион,
	        |	ВТ_ЧисловыеПоказатели.СуммаФакт КАК СуммаФакт,
	        |	ВТ_ЧисловыеПоказатели.ПериодОтчета КАК ПериодОтчета,
	        |	ВТ_ЧисловыеПоказатели.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
	        |	ВТ_ЧисловыеПоказатели.Организация КАК Организация,
	        |	ВТ_ЧисловыеПоказатели.ПериодЗаписи КАК ПериодЗаписи,
	        |	ВТ_НечисловыеПоказатели.Значение КАК Значение,
	        |	ВТ_ПроектТрансферт_Итог.Значение КАК ПереводПроект,
	        |	""ЗначениеДляПодстановки"" КАК Направление,
			|	ВЫРАЗИТЬ(""ЗначенияПоказателейОтчетовНечисловые"" КАК СТРОКА(70)) КАК РасчетКосвенныхПоРегистру
	        |ИЗ
	        |	ВТ_ЧисловыеПоказатели КАК ВТ_ЧисловыеПоказатели
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НечисловыеПоказатели КАК ВТ_НечисловыеПоказатели
	        |		ПО ВТ_ЧисловыеПоказатели.Проект = ВТ_НечисловыеПоказатели.Проект
	        |			И ВТ_ЧисловыеПоказатели.СтатьяЗатрат = ВТ_НечисловыеПоказатели.СтатьяЗатрат
	        |			И ВТ_ЧисловыеПоказатели.СтатьяДоходовРасходов = ВТ_НечисловыеПоказатели.СтатьяДоходовРасходов
	        |			И ВТ_ЧисловыеПоказатели.НазначениеПлатежа = ВТ_НечисловыеПоказатели.НазначениеПлатежа
	        |			И ВТ_ЧисловыеПоказатели.Контрагент = ВТ_НечисловыеПоказатели.Контрагент
	        |			И ВТ_ЧисловыеПоказатели.Регион = ВТ_НечисловыеПоказатели.Регион
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроектТрансферт_Итог КАК ВТ_ПроектТрансферт_Итог
	        |		ПО ВТ_ЧисловыеПоказатели.Организация = ВТ_ПроектТрансферт_Итог.ВерсияОрганизация
	        |			И ВТ_ЧисловыеПоказатели.ВерсияСценарий = ВТ_ПроектТрансферт_Итог.ВерсияСценарий
	        |			И ВТ_ЧисловыеПоказатели.ВерсияЭкземплярОтчета = ВТ_ПроектТрансферт_Итог.ВерсияЭкземплярОтчета
	        |			И ВТ_ЧисловыеПоказатели.Проект = ВТ_ПроектТрансферт_Итог.Аналитика1
	        |			И ВТ_ЧисловыеПоказатели.СтатьяЗатрат = ВТ_ПроектТрансферт_Итог.Аналитика2
	        |			И ВТ_ЧисловыеПоказатели.СтатьяДоходовРасходов = ВТ_ПроектТрансферт_Итог.Аналитика3
	        |			И ВТ_ЧисловыеПоказатели.НазначениеПлатежа = ВТ_ПроектТрансферт_Итог.Аналитика4
	        |			И ВТ_ЧисловыеПоказатели.Контрагент = ВТ_ПроектТрансферт_Итог.Аналитика5.Наименование
	        |			И ВТ_ЧисловыеПоказатели.Регион = ВТ_ПроектТрансферт_Итог.Аналитика6
	        |			И ВТ_ЧисловыеПоказатели.ПериодОтчета = ВТ_ПроектТрансферт_Итог.ВерсияПериодОтчета
	        |ГДЕ
	        |	ВТ_НечисловыеПоказатели.Значение ЕСТЬ NULL";	
КонецФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник)
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл	
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);	
	КонецЦикла;
КонецПроцедуры // ДополнитьТаблицу() 
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеТаблицыРаскрываемыхАналитикВидаОтчета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыРаскрытия.Владелец КАК Владелец,
		|	ГруппыРаскрытия.ВидАналитики1 КАК ВидАналитики1,
		|	ГруппыРаскрытия.ВидАналитики2 КАК ВидАналитики2,
		|	ГруппыРаскрытия.ВидАналитики3 КАК ВидАналитики3,
		|	ГруппыРаскрытия.ВидАналитики4 КАК ВидАналитики4,
		|	ГруппыРаскрытия.ВидАналитики5 КАК ВидАналитики5,
		|	ГруппыРаскрытия.ВидАналитики6 КАК ВидАналитики6,
		|	ГруппыРаскрытия.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ГруппыРаскрытия.ЧислоАналитик КАК ЧислоАналитик,
		|	ГруппыРаскрытия.ВидАналитики1.Наименование КАК ВидАналитики1Наименование,
		|	ГруппыРаскрытия.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ГруппыРаскрытия КАК ГруппыРаскрытия";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;		

КонецФункции // ПолучениеРаскрываемыхАналитикВидаОтчета()  
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеСпискаРаскрываемыхАналитикВидаОтчета(ТаблицаРаскрываемыхАналитик,ВидОтчета)
	
	ВидОтчета = Справочники.ВидыОтчетов.ПустаяСсылка();
	МассивСтрокАналитик = Новый Массив;
	НайденнаяСтрока = ТаблицаРаскрываемыхАналитик.Найти(ВидОтчета,"Владелец");    	
	СтрокаРаскрытияАналитик = Неопределено;   
	Если НайденнаяСтрока <> Неопределено Тогда		
		Для Сч=1 По НайденнаяСтрока.ЧислоАналитик Цикл  
			МассивСтрокАналитик.Добавить("Аналитика"+Сч);				
		КонецЦикла;  
	КонецЕсли;   
	
	СтрокаРаскрытияАналитик = СтрСоединить(МассивСтрокАналитик,",");
	
	Возврат СтрокаРаскрытияАналитик;

КонецФункции // ПолучениеСпискаРаскрываемыхАналитикВидаОтчета()   
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ОтбремКосвенныеРасходыФактаОтдельно(ТаблицаДанных_Факт,ПризнакПолученияПроцентов,ОбрабатыватьКосвенные)

	//Отберем косвенные для отельной обработки ++   
	//Добавим их в отдельную таблицу для обработки, и удалим из метчинга план факт   
	
	//ТаблицаДанных_Косвенные = ПолучениеТаблицыЗаполненияКосвенные("");  
	
	ТаблицаДанных_Косвенные = ПолучениеТаблицыЗаполненияКосвенныеФакт("");
	СтрокиДляУдаления = Новый Массив;
	

	РТСТ = Справочники.Организации.НайтиПоНаименованию("РТС-ТЕНДЕР ООО");
	ЦРЭ = Справочники.Организации.НайтиПоНаименованию("АО ""ЦРЭ""");
	ОТС = Справочники.Организации.НайтиПоНаименованию("АО ""ОТС""");

	ВладелецСправочника = ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НайтиПоНаименованию("Проект");
	G_Маркет_Проект =  Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000009",,,ВладелецСправочника); //G-Маркет  
		
	СтруктураПараметров = Новый Структура("ДляФакта");
	РазвитиеБизнесаСтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("РТ-000018");
	
	Для Каждого Стр Из ТаблицаДанных_Факт Цикл     
		
		Стр.Направление = ПолучениеПризнакаНаправления(Стр,,СтруктураПараметров);  		 
		
		Если Стр.СтатьяЗатрат.Код = "РТ-000018" Или  Стр.СтатьяЗатрат.Код = "00-000016" Тогда     
			Стр.СтатьяЗатрат = РазвитиеБизнесаСтатьяЗатрат;	 
		КонецЕсли;   

		
		Если Стр.Проект.Код = "000000006" ИЛИ //Косвенные
			Стр.Проект.Код = "000000045" Тогда
			
			Если ОбрабатыватьКосвенные Тогда
				
				Если СокрЛП(Стр.РасчетКосвенныхПоРегистру) <> "ЗначенияФактическихПоказателейРассчитанный" Тогда
					Если Стр.ПереводПроект = "" Или ПустаяСтрока(Стр.ПереводПроект) Тогда 
						Продолжить;
					КонецЕсли;
				КонецЕсли;       
				
				СтрКосвенные = ТаблицаДанных_Косвенные.Добавить(); 
				
				
				СтрКосвенные.Проект = Стр.Проект;
				СтрКосвенные.СтатьяЗатрат = Стр.СтатьяЗатрат;
				СтрКосвенные.СтатьяЗатратКод = СтрКосвенные.СтатьяЗатрат.Код;  
				СтрКосвенные.СтатьяДоходовРасходов = Стр.СтатьяДоходовРасходов;
				СтрКосвенные.НазначениеПлатежа = Стр.НазначениеПлатежа; 
				СтрКосвенные.Контрагент = Стр.Контрагент;
				СтрКосвенные.Регион = Стр.Регион;
				СтрКосвенные.СуммаФакт = Стр.СуммаФакт;	
				
				СтрКосвенные.Направление = ПолучениеПризнакаНаправления(СтрКосвенные,,СтруктураПараметров);
				
				Если Стр.ПереводПроект = "Перевод РТС" Тогда          				
					Организация = РТСТ;	
				ИначеЕсли Стр.ПереводПроект = "Перевод ЦРЭ" Тогда 
					Организация = ЦРЭ;	
				ИначеЕсли Стр.ПереводПроект = "Перевод ОТС" Тогда
					Организация = ОТС;	
				Иначе
					Организация	= Стр.Организация;
				КонецЕсли; 
				
				СтрКосвенные.Организация = Организация;
				СтрКосвенные.ПериодОтчета = Стр.ПериодОтчета; 
				СтрКосвенные.ПериодЗаписи = Стр.ПериодЗаписи;
				СтрКосвенные.ПериодОтчетаРодитель = Стр.ПериодОтчетаРодитель;
				
				СтрКосвенные.ПереводПроект = Стр.ПереводПроект;   
				
				СтрокиДляУдаления.Добавить(Стр);    
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого Стр Из СтрокиДляУдаления Цикл  
		ТаблицаДанных_Факт.Удалить(Стр);	
	КонецЦикла;      
	
	СтруктураВозврата = Новый Структура("ТаблицаДанных_Факт,ТаблицаДанных_Косвенные",ТаблицаДанных_Факт,ТаблицаДанных_Косвенные);
	Возврат СтруктураВозврата;

КонецФункции // ОтбремКосвенныеРасходыФактаОтдельно()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Процедура ОбработаемКосвенныеРасходыОтдельно(РезультатЗапроса,ТаблицаДанных_Косвенные,ПризнакРасчетаПланФакт,ПризнакПолученияПроцентов,ПериодыОтчетаМесяц,ДатаНачалаОтчета)
	ТаблицаПроцентов_РаспределениеКосвенные = ПолучениеПроцентоДляРаспеределенияБЛКосвенные(ПериодыОтчетаМесяц,ПризнакПолученияПроцентов);
	СоответствияПорядкаСортировкиСтатьиЗатрат = ПолучениеСоответствияПорядкаСортировкиСтатьиЗатрат();    	
	ТаблицаДанных_Косвенные.Сортировать("ПериодОтчета УБЫВ");  
	
	//ДанныеПоКосвеннымРасходам = РассчитаемКосвенныеРасходыОтдельно(ТаблицаДанных_Косвенные,ТаблицаПроцентов_РаспределениеКосвенные,СоответствияПорядкаСортировкиСтатьиЗатрат,ПризнакРасчетаПланФакт);
	
	ДанныеПоКосвеннымРасходам = РассчитаемКосвенныеРасходыОтдельноФакт(ТаблицаДанных_Косвенные,ТаблицаПроцентов_РаспределениеКосвенные,СоответствияПорядкаСортировкиСтатьиЗатрат,ПризнакРасчетаПланФакт,ПериодыОтчетаМесяц);	
	//{Воронков А.Д. 18.06.2025 ++ 
	//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/408999/
	ДанныеПоКосвеннымРасходам.Свернуть("Направление,Проект,СтатьяЗатрат,Организация,ПериодОтчета,ПериодЗаписи,Сумма","СуммаФакт");     
	//--}	
	ДополнитьТаблицу(ДанныеПоКосвеннымРасходам,РезультатЗапроса);
КонецПроцедуры // ОбработаемКосвенныеРасходыОтдельно()
// <Сортирует таблицу данных по заданным полям перед выводом>
//
// Параметры:
//  <РезультатЗапроса>  - <ТаблицаЗначений> - <Исходная таблица данных, которую необходимо отсортировать>
//                 <Должна содержать все поля, указанные в тексте запроса, включая поля для сортировки (с префиксом "Сортировка")>
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - <Отсортированная таблица данных с теми же колонками, что и входная таблица>
//
//                     Сортировка выполняется по полям:
//                     1. СортировкаНаправление (по возрастанию)
//                     2. СортировкаПроект (по возрастанию)
//                     3. СортировкаСтатьяЗатрат (по возрастанию)
//                     4. СортировкаПериод (по возрастанию)
//                     5. Сумма (по убыванию)
Функция ОтсортируемТаблицуДанныхПередВыводом(РезультатЗапроса,ДатаНачалаОтчета,ДатаОкончанияОтчета,ВложенаяСхемаВариантОтчета)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВТ_Табл",РезультатЗапроса);  
	Запрос.УстановитьПараметр("НачПер",ДатаНачалаОтчета);  
	Запрос.УстановитьПараметр("КонПер",ДатаОкончанияОтчета);
	Если ВложенаяСхемаВариантОтчета = "ОтчетConsoСтатьяЗатрат" Тогда  
		//ПорядокСортировки = "УПОРЯДОЧИТЬ ПО СортировкаПериод, СуммаФакт УБЫВ";	
		ПорядокСортировки = "УПОРЯДОЧИТЬ ПО СортировкаПериод";
	ИначеЕсли ВложенаяСхемаВариантОтчета = "ОтчетConsoСтатьяДоходовРасходов" Тогда 
		//ПорядокСортировки = "УПОРЯДОЧИТЬ ПО СтатьяДоходовРасходов, НазначениеПлатежа, Контрагент, СортировкаПериод, СуммаФакт УБЫВ";
		ПорядокСортировки = "УПОРЯДОЧИТЬ ПО СтатьяДоходовРасходов, НазначениеПлатежа, Контрагент, СортировкаПериод";
	ИначеЕсли ВложенаяСхемаВариантОтчета = "ОтчетConsoНазначениеПлатежа" Тогда   
		//ПорядокСортировки = "УПОРЯДОЧИТЬ ПО НазначениеПлатежа, Контрагент, СортировкаПериод, СуммаФакт УБЫВ";	
		ПорядокСортировки = "УПОРЯДОЧИТЬ ПО НазначениеПлатежа, Контрагент, СортировкаПериод";
	Иначе 
		//ПорядокСортировки = "УПОРЯДОЧИТЬ ПО СортировкаПроект, СортировкаНаправление, СортировкаСтатьяЗатрат, СортировкаПериод, СуммаФакт УБЫВ";    
		ПорядокСортировки = "УПОРЯДОЧИТЬ ПО ПериодОтчета ВОЗР";
	КонецЕсли;    	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_Табл.Контрагент КАК Контрагент,
		|	ВТ_Табл.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ВТ_Табл.Направление КАК Направление,
		|	ВТ_Табл.Организация КАК Организация,
		|	ВТ_Табл.ОтклонениеПроцент КАК ОтклонениеПроцент,
		|	ВТ_Табл.ПериодОтчета КАК ПериодОтчета,
		|	ВТ_Табл.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
		|	ВТ_Табл.Проект КАК Проект,
		|	ВТ_Табл.Регион КАК Регион,
		|	ВТ_Табл.СортировкаНаправление КАК СортировкаНаправление,
		|	ВТ_Табл.СортировкаПериод КАК СортировкаПериод,
		|	ВТ_Табл.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
		|	ВТ_Табл.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВТ_Табл.Сумма КАК Сумма,
		|	ВТ_Табл.СуммаОтклонение КАК СуммаОтклонение,
		|	ВТ_Табл.СуммаФакт КАК СуммаФакт,
		|	ВТ_Табл.СортировкаСтатьяЗатрат КАК СортировкаСтатьяЗатрат,
		|	ВТ_Табл.СортировкаПроект КАК СортировкаПроект,
		|	ВТ_Табл.ПериодЗаписи КАК ПериодЗаписи
		|ПОМЕСТИТЬ ВТ_Табл
		|ИЗ
		|	&ВТ_Табл КАК ВТ_Табл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Табл.Контрагент КАК Контрагент,
		|	ВТ_Табл.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ВТ_Табл.Направление КАК Направление,
		|	ВТ_Табл.Организация КАК Организация,
		|	ВТ_Табл.ОтклонениеПроцент КАК ОтклонениеПроцент,
		|	ВТ_Табл.ПериодОтчета КАК ПериодОтчета,
		//|	ВТ_Табл.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
		|	ВТ_Табл.Проект КАК Проект,
		|	ВТ_Табл.Регион КАК Регион,
		//|	ВТ_Табл.СортировкаНаправление КАК СортировкаНаправление,
		//|	ВТ_Табл.СортировкаПериод КАК СортировкаПериод,
		|	ВТ_Табл.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
		|	ВТ_Табл.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВТ_Табл.Сумма КАК Сумма,
		|	ВТ_Табл.СуммаОтклонение КАК СуммаОтклонение,
		|	ВТ_Табл.СуммаФакт КАК СуммаФакт,
		|	ВТ_Табл.СортировкаСтатьяЗатрат КАК СортировкаСтатьяЗатрат,
		//|	ВТ_Табл.СортировкаПроект КАК СортировкаПроект,
		|	ВТ_Табл.ПериодЗаписи КАК ПериодЗаписи
		|ИЗ
		|	ВТ_Табл КАК ВТ_Табл
		|ГДЕ
		|	ВТ_Табл.ПериодЗаписи МЕЖДУ &НачПер И &КонПер
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодЗаписи,
		|   СортировкаСтатьяЗатрат";
		//|
		//|	&УсловиеСортировки";
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеСортировки",ПорядокСортировки);
	
		Возврат  Запрос.Выполнить().Выгрузить();	

КонецФункции // ОтсортируемТаблицуДанныхПередВыводом()  
// Процедура - Сбросить пользовательский кэш отборов
//
// Параметры:
//  КэшЗначенийОтборов	 - 	 - 
//
Процедура СброситьПользовательскийКэшОтборов(КэшЗначенийОтборов) 
	Для Каждого КэшОтбора Из КэшЗначенийОтборов Цикл  
		КэшОтбора.Значение.Очистить();		
	КонецЦикла;	
КонецПроцедуры 
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПризнакаТрансфертаПоСотрудникуОтчетConso()
	
	СтруктураНастроекТрансфертов = Новый Структура;
	ПроектыПользователя = Справочники.ПроектыПользователей.НайтиПоРеквизиту("Пользователь",ПользователиКлиентСервер.ТекущийПользователь());    
	Если ПроектыПользователя = Справочники.ПроектыПользователей.ПустаяСсылка() Тогда        
		СтруктураНастроекТрансфертов = Неопределено;
	Иначе      
		Проекты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектыПользователя,"Проекты").Выгрузить();
		Трансферты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектыПользователя,"Трансферты").Выгрузить();   
		СтруктураНастроекТрансфертов = Новый Структура("Проекты,Трансферты",Проекты,Трансферты);
	КонецЕсли;
	Возврат СтруктураНастроекТрансфертов;

КонецФункции // ПолучениеПризнакаТрансфертаПоСотрудникуОтчетConso() 
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеСоотвествияВложенныхСхем()
	СоответсвиеСхем = Новый Соответствие;
	СоответсвиеСхем.Вставить("Отчет Conso (Статья затрат)","ОтчетConsoСтатьяЗатрат");
	СоответсвиеСхем.Вставить("Отчет Conso (Статья доходов расходов)","ОтчетConsoСтатьяДоходовРасходов");
	СоответсвиеСхем.Вставить("Отчет Conso (Назначение платежа)","ОтчетConsoНазначениеПлатежа"); 
	СоответсвиеСхем.Вставить("Отчет Conso (Статья затрат, статья доходов расходов)","ОтчетConsoСтатьяЗатратСтатьяДоходовРасходов");   
	СоответсвиеСхем.Вставить("Отчет1","ОтчетConsoСтатьяЗатрат");  
	СоответсвиеСхем.Вставить("Отчет Conso (Проект) Итоги по годам","ОтчетConsoПроектИтогиПоГодам");    
	СоответсвиеСхем.Вставить("Отчет Conso (Статья затат) Итоги по годам","ОтчетConsoСтатьяЗатратИтогиПоГодам");
    Возврат СоответсвиеСхем;                                                                          
КонецФункции // ПолучениеСоотвествияВложенныхСхем()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеПризнакаОбработкиКосвенных()
	НастройкаВариантОтчета = Справочники.ПроектыПользователей.НайтиПоРеквизиту("Пользователь",ПользователиКлиентСервер.ТекущийПользователь());   
	Если НастройкаВариантОтчета = Справочники.ПроектыПользователей.ПустаяСсылка() Тогда   
		ОбрабатыватьКосвенные = Истина;	
	Иначе
		ОбрабатыватьКосвенные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаВариантОтчета,"ОбрабатыватьКосвенные");     
	КонецЕсли;  
	Возврат ОбрабатыватьКосвенные; 
КонецФункции // ПолучениеПризнакаОбработкиКосвенных() 
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Процедура ДополнитьТаблицуКолонкамиДляСортировки(РезультатЗапроса)
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");	
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата");
	РезультатЗапроса.Колонки.Добавить("СортировкаНаправление", ОписаниеТиповЧисло);
	РезультатЗапроса.Колонки.Добавить("СортировкаПериод", ОписаниеТиповЧисло); 
	РезультатЗапроса.Колонки.Добавить("СортировкаСтатьяЗатрат", ОписаниеТиповЧисло);   
	РезультатЗапроса.Колонки.Добавить("СортировкаПроект", ОписаниеТиповЧисло);  
	РезультатЗапроса.Колонки.Добавить("ПериодЗаписи", ОписаниеТиповДата);	
КонецПроцедуры // ДополнитьТаблицуКолонкамиДляСортировки() 
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ВыполнитьЗапросОбъединениеПланФакт(ТаблицаДанных_План,ТаблицаДанных_Факт,ДатаНачалаОтчета,ДатаОкончанияОтчета)
   	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВТ_ТаблицаПлан",ТаблицаДанных_План);  
	Запрос.УстановитьПараметр("ВТ_ТаблицаФакт",ТаблицаДанных_Факт); 
	Запрос.УстановитьПараметр("НачПер",ДатаНачалаОтчета); 
	Запрос.УстановитьПараметр("КонПер",ДатаОкончанияОтчета);
	Запрос.Текст = ПолучениеЗапросаОбъединенияПланФакт();	
	Попытка
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	Исключение     
		Сообщение = ОписаниеОшибки();
	КонецПопытки;   	
	Возврат РезультатЗапроса;
КонецФункции // ВыполнитьЗапросОбъединениеПланФакт()   
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ДозаполнитьДанныеФактПередОбъединениемСПланом(ТаблицаДанных_Факт)
	Для Каждого СтрФакт Из ТаблицаДанных_Факт Цикл   
		Если СтрФакт.СтатьяЗатрат.Код = "00-000020" Тогда   
			СтрФакт.Контрагент = "";
			СтрФакт.НазначениеПлатежа = Справочники.ПроизвольныйКлассификаторУХ.ПустаяСсылка(); 
			СтрФакт.Регион = Справочники.ПроизвольныйКлассификаторУХ.ПустаяСсылка(); 
			СтрФакт.СтатьяДоходовРасходов = Справочники.СтатьиДоходовИРасходов.ПустаяСсылка(); 
			СтрФакт.ПериодОтчетаРодитель = Справочники.Периоды.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;	  
КонецПроцедуры // ДозаполнитьДанныеФактПередОбъединениемСПланом()
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОбработатьСтрокиРезультатаОбъединенияПланФакт(РезультатЗапроса,ST_НСИ_Проект,G_Маркет_Проект,Поставщики,СоответствиеПорядкаСортировкиНаправление,СоответствиеПроектовБЛ)
	Для Каждого Стр Из РезультатЗапроса Цикл  
		
		ПроектБЛ = СоответствиеПроектовБЛ.Получить(Стр.Проект.Наименование);   
		
		//{Воронков А.Д. 14.05.2025 ++   
		//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409937
		Если Стр.Проект.Код = "000000031" Тогда //Маркет 
			Стр.Проект = G_Маркет_Проект;		
		КонецЕсли; 
		//--}
		
		//{Воронков А.Д. 12.05.2025 ++
		//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409415/ 
		Если Стр.СтатьяЗатрат.Код =  "00-000015" Или Стр.СтатьяЗатрат.Код = "00-000024" Тогда      
			Стр.Направление = "Агентские";			
		ИначеЕсли Стр.СтатьяЗатрат.Код =  "00-000023" Тогда  
			Стр.Направление = "Прочие доходы/расходы";	
		КонецЕсли;   
		//--}    
		
		//{Воронков А.Д. 12.05.2025 ++
		//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409003/
		Если Стр.Проект.Код = "000000011" ИЛИ Стр.Проект.Код = "000000044" Тогда //Sales Tech ИЛИ НСИ       
			Стр.Проект = ST_НСИ_Проект;	
		КонецЕсли;
		//--}   
		
		//{Воронков А.Д. 30.06.2025 ++
		//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/415978/
		Если Стр.Проект.Код = "000000012" Тогда
			Стр.Проект = Поставщики;	
		КонецЕсли;
		//--}

		
		Стр.Проект = ?(ПроектБЛ<>Неопределено,ПроектБЛ,Стр.Проект); 
		
		//{Воронков А.Д. 19.05.2025 ++
		//Задача:https://tfs.rts-tender.ru/tfs/DefaultCollection/RTS.1C/_workitems/edit/409720/
		Стр.СортировкаНаправление = СоответствиеПорядкаСортировкиНаправление.Получить(СокрЛП(Стр.Направление));  
		Стр.СортировкаПериод = СоответствиеПорядкаСортировкиНаправление.Получить(Стр.ПериодОтчета);
		Стр.СортировкаСтатьяЗатрат = СоответствиеПорядкаСортировкиНаправление.Получить(Стр.СтатьяЗатрат);				      	
		Стр.СортировкаПроект = СоответствиеПорядкаСортировкиНаправление.Получить(Стр.Проект); 
		//--}
		
		Стр.Контрагент = СокрЛП(Стр.Контрагент);  		
		Стр.ПериодЗаписи = Стр.ПериодОтчета.ДатаНачала; 		
	КонецЦикла;	
КонецПроцедуры // ОбработатьСтрокиРезультатаОбъединенияПланФакт()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучениеДанныхЗначенияФактическихПоказателейРассчитанный(МассивПериодовОтчета)	    	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("МассивПериодовОтчета",МассивПериодовОтчета);
	Запрос.Текст = ТекстЗапросаЗначенияФактическихПоказателейРассчитанный();	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучениеДанныхЗначенияФактическихПоказателейРассчитанный()
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ТекстЗапросаЗначенияФактическихПоказателейРассчитанный()

	Возврат "ВЫБРАТЬ
	        |	ЗначенияФактическихПоказателейРассчитанный.Проект КАК Проект,
	        |	ЗначенияФактическихПоказателейРассчитанный.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	ЗначенияФактическихПоказателейРассчитанный.СтатьяЗатрат.Код КАК СтатьяЗатратКод,
	        |	ЗначенияФактическихПоказателейРассчитанный.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	        |	ЗначенияФактическихПоказателейРассчитанный.НазначениеПлатежа КАК НазначениеПлатежа,
	        |	ЗначенияФактическихПоказателейРассчитанный.Контрагент КАК Контрагент,
	        |	ЗначенияФактическихПоказателейРассчитанный.Регион КАК Регион,
	        |	ЗначенияФактическихПоказателейРассчитанный.Организация КАК Организация,
	        |	ЗначенияФактическихПоказателейРассчитанный.ПериодОтчета.ДатаНачала КАК ПериодЗаписи,
	        |	ЗначенияФактическихПоказателейРассчитанный.ПериодОтчета КАК ПериодОтчета,
	        |	ЗначенияФактическихПоказателейРассчитанный.ПериодОтчета.Родитель КАК ПериодОтчетаРодитель,
	        |	""ЗначениеДляПодстановки"" КАК Направление,
	        |	""ЗначенияФактическихПоказателейРассчитанный"" КАК РасчетКосвенныхПоРегистру,
	        |	СУММА(ЗначенияФактическихПоказателейРассчитанный.Сумма) КАК СуммаФакт,
	        |	ВЫБОР
	        |		КОГДА ЗначенияФактическихПоказателейРассчитанный.Проект.Код = ""000000006""
	        |			ТОГДА ""Косвенные""
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК ПереводПроект
	        |ИЗ
	        |	РегистрСведений.ЗначенияФактическихПоказателейРассчитанный КАК ЗначенияФактическихПоказателейРассчитанный
	        |ГДЕ
	        |	ЗначенияФактическихПоказателейРассчитанный.ПериодОтчета В(&МассивПериодовОтчета)
	        |	И ЗначенияФактическихПоказателейРассчитанный.СтатьяЗатрат <> ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияФактическихПоказателейРассчитанный.Проект,
	        |	ЗначенияФактическихПоказателейРассчитанный.СтатьяЗатрат,
	        |	ЗначенияФактическихПоказателейРассчитанный.СтатьяЗатрат.Код,
	        |	ЗначенияФактическихПоказателейРассчитанный.СтатьяДоходовРасходов,
	        |	ЗначенияФактическихПоказателейРассчитанный.НазначениеПлатежа,
	        |	ЗначенияФактическихПоказателейРассчитанный.Контрагент,
	        |	ЗначенияФактическихПоказателейРассчитанный.Регион,
	        |	ЗначенияФактическихПоказателейРассчитанный.Организация,
	        |	ЗначенияФактическихПоказателейРассчитанный.ПериодОтчета.ДатаНачала,
	        |	ЗначенияФактическихПоказателейРассчитанный.ПериодОтчета,
	        |	ЗначенияФактическихПоказателейРассчитанный.ПериодОтчета.Родитель,
	        |	ВЫБОР
	        |		КОГДА ЗначенияФактическихПоказателейРассчитанный.Проект.Код = ""000000006""
	        |			ТОГДА ""Косвенные""
	        |		ИНАЧЕ """"
	        |	КОНЕЦ";
	

КонецФункции // ТекстЗапросаЗначенияФактическихПоказателейРассчитанный()      

Функция СравнитьДанныеКонсолидированногоОтчета(ТаблицаДанных,ДатаНачалаОтчета,ДатаОкончанияОтчета)  
	// Если сравниваются данные за несколько лет, добавляем колонки для анализа	
	ТаблицаДанных.Колонки.Добавить("ПрогнозТекГод", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("ПрогнозСледГод", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("ФактТекГод", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("ФактСледГод", Новый ОписаниеТипов("Число"));  
	//ТаблицаДанных.Колонки.Добавить("ДельтаПрогнозТекГодСледГод");  ???
	//ТаблицаДанных.Колонки.Добавить("ДельтаФактТекГодСледГод");     ???
	
	НачалоТекГода = НачалоГода(ДатаНачалаОтчета);
	НачалоСледГода = НачалоГода(ДатаОкончанияОтчета);
	
	// Обработаем суммы и дозапишем в нужные колонки для сравнения
	Для Каждого СтрДанных Из ТаблицаДанных Цикл
		НачалоПериода = НачалоГода(СтрДанных.ПериодОтчета.ДатаНачала);
		
		Если НачалоПериода = НачалоТекГода Тогда
			СтрДанных.ПрогнозТекГод = СтрДанных.Сумма;
			СтрДанных.ФактТекГод = СтрДанных.СуммаФакт;
		ИначеЕсли НачалоПериода = НачалоСледГода Тогда
			СтрДанных.ПрогнозСледГод = СтрДанных.Сумма;
			СтрДанных.ФактСледГод = СтрДанных.СуммаФакт;
		КонецЕсли;
	КонецЦикла;
КонецФункции     

Функция ДополнитьДаннымиПоФОТСотрудниковРуководителя(ДатаНачалаОтчета, ТаблицаДанныхОтчета)     
	
	// Получим данные по ФОТ сотрудников руководителя
	ДанныеФОТ = ПолучитьДанныеПоФОТСотрудниковРуководителя(ДатаНачалаОтчета); 	
	
	// Удалим строки по отборам связанным с ФОТ из общей таблицы
	УдалитьМотивациюИИсключенныеСтатьи(ТаблицаДанныхОтчета);	
	
	// Доплним таблицу ДанныеФОТ колонками, для возможности сортировки в запросе
	ДополнитьТаблицуДанныхФотКолонками(ДанныеФОТ);
	
	// Определим порядок сортировки данных в запросе, для вывода в макет
	ОпределитьПорядокСортирокиДанныхПоФОТ(ДанныеФОТ);

	// Объединим текущие данные, с данными ФОТ сотрудников руководителя
	ДополнитьТаблицу(ДанныеФОТ, ТаблицаДанныхОтчета);
			
	Возврат ПрименитьСортировкуДанныхТаблицы(ДатаНачалаОтчета,ТаблицаДанныхОтчета);	
	
КонецФункции   

Функция ПолучитьДанныеПоФОТСотрудниковРуководителя(ДатаНачалаОтчета)   
	
	мВидыОтчетов = ОбщегоПользованияУХ.ПолучитьВидыОтчетовПоПользователю();

	мИсточникиДанныхФОТ = Новый Массив;
	мИсточникиДанныхФОТ.Добавить(Справочники.ВидыОтчетов.НайтиПоНаименованию("Сводный отчет Изменение окладов Многопериодный (ЦРЭ)"));  
	мИсточникиДанныхФОТ.Добавить(Справочники.ВидыОтчетов.НайтиПоНаименованию("Сводный отчет Изменение окладов Многопериодный (РТС)"));

	
	Запрос = Новый Запрос;   	 
	Запрос.УстановитьПараметр("ВидОтчета",мВидыОтчетов);
	Запрос.УстановитьПараметр("ПериодОтчета",ПериодыУХ.ПолучитьПодчиненныеПериоды(ДатаНачалаОтчета,КонецГода(ДатаНачалаОтчета),Перечисления.Периодичность.Год)[0]);
	Запрос.УстановитьПараметр("мПериодов",ПериодыУХ.ПолучитьПодчиненныеПериоды(ДатаНачалаОтчета,КонецГода(ДатаНачалаОтчета),Перечисления.Периодичность.Месяц));
	Запрос.УстановитьПараметр("ВидОтчетаСводный",мИсточникиДанныхФОТ);
	Запрос.Текст = ПолучитьТекстЗапросаФОТСотрудниковРуководителя();
	
	Возврат Запрос.Выполнить().Выгрузить();       
	
КонецФункции                                             

Функция ПолучитьТекстЗапросаФОТСотрудниковРуководителя()   
	
	Возврат "ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетов5.Аналитика1 КАК Аналитика1,
	        |	ЗначенияПоказателейОтчетов5.Аналитика3 КАК Аналитика3,
	        |	СУММА(ЗначенияПоказателейОтчетов5.Значение) КАК Значение
	        |ПОМЕСТИТЬ ВТ_1
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетов5 КАК ЗначенияПоказателейОтчетов5
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов5.Версия.ВидОтчета В(&ВидОтчета)
	        |	И ЗначенияПоказателейОтчетов5.Версия.ПериодОтчета = &ПериодОтчета
	        |	И ТИПЗНАЧЕНИЯ(ЗначенияПоказателейОтчетов5.Аналитика1) = ТИП(Справочник.Сотрудники)
	        |	И ЗначенияПоказателейОтчетов5.Показатель.Код = ""ИзменениеОклада_НовыйОкладРубМес""
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов5.Аналитика1,
	        |	ЗначенияПоказателейОтчетов5.Аналитика3
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов5.Значение) >= 0
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетов5.Аналитика1,
	        |	ЗначенияПоказателейОтчетов5.Аналитика3,
	        |	СУММА(ЗначенияПоказателейОтчетов5.Значение)
	        |ИЗ
	        |	РегистрСведений.ЗначенияПоказателейОтчетов5 КАК ЗначенияПоказателейОтчетов5
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов5.Версия.ВидОтчета В(&ВидОтчета)
	        |	И ЗначенияПоказателейОтчетов5.Версия.ПериодОтчета = &ПериодОтчета
	        |	И ТИПЗНАЧЕНИЯ(ЗначенияПоказателейОтчетов5.Аналитика1) = ТИП(Справочник.Сотрудники)
	        |	И ЗначенияПоказателейОтчетов5.Показатель.Код = ""ИзменениеОклада_ОкладПредыдущий""
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов5.Аналитика1,
	        |	ЗначенияПоказателейОтчетов5.Аналитика3
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов5.Значение) >= 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_1.Аналитика1 КАК Сотрудник,
	        |	ВТ_1.Аналитика3 КАК РуководительФизическоеЛицо
	        |ПОМЕСТИТЬ ВТ_СотрудикиЦФО
	        |ИЗ
	        |	ВТ_1 КАК ВТ_1
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_1.Аналитика1,
	        |	ВТ_1.Аналитика3
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияПоказателейОтчетов6.Аналитика1 КАК Проект,
	        |	ЗначенияПоказателейОтчетов6.Аналитика2 КАК СтатьяЗатрат,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3 КАК СтатьяДоходовРасходов,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4 КАК НазначениеПлатежа,
	        |	ВЫРАЗИТЬ(ЗначенияПоказателейОтчетов6.Аналитика5 КАК Справочник.Сотрудники).Наименование КАК Контрагент,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6 КАК Регион,
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) КАК Сумма,
			//|	0 КАК ОтклонениеПроцент,
			//|	0 КАК СуммаОтклонение,
			//|	0 КАК СуммаФакт,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета КАК ПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.Родитель КАК ПериодОтчетаРодитель,
	        |	ЗначенияПоказателейОтчетов6.Версия.Организация КАК Организация,
	        |	""ОРЕХ"" КАК Направление
	        |ИЗ
	        |	ВТ_СотрудикиЦФО КАК ВТ_СотрудикиЦФО
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейОтчетов6 КАК ЗначенияПоказателейОтчетов6
	        |		ПО ВТ_СотрудикиЦФО.Сотрудник = ЗначенияПоказателейОтчетов6.Аналитика5
	        |ГДЕ
	        |	ЗначенияПоказателейОтчетов6.Версия.ВидОтчета В(&ВидОтчетаСводный)
	        |	И ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета В(&мПериодов)
	        |	И ТИПЗНАЧЕНИЯ(ЗначенияПоказателейОтчетов6.Аналитика5) = ТИП(Справочник.Сотрудники)
	        |	И ЗначенияПоказателейОтчетов6.Показатель.Код = ""ИзменениеОкладов_СуммаРуб""
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗначенияПоказателейОтчетов6.Аналитика2,
	        |	ЗначенияПоказателейОтчетов6.Аналитика3,
	        |	ЗначенияПоказателейОтчетов6.Аналитика4,
	        |	ЗначенияПоказателейОтчетов6.Аналитика5,
	        |	ЗначенияПоказателейОтчетов6.Аналитика6,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета,
	        |	ЗначенияПоказателейОтчетов6.Версия.ПериодОтчета.Родитель,
	        |	ЗначенияПоказателейОтчетов6.Версия.Организация,
	        |	ЗначенияПоказателейОтчетов6.Аналитика1,
	        |	ВЫРАЗИТЬ(ЗначенияПоказателейОтчетов6.Аналитика5 КАК Справочник.Сотрудники).Наименование
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЗначенияПоказателейОтчетов6.Значение) > 0";

КонецФункции

Процедура УдалитьМотивациюИИсключенныеСтатьи(ТаблицаДанныхОтчета)    

	МассивУдаляемыхСтрок = Новый Массив;
	КодыДляУдаления = Новый Соответствие;
	КодыДляУдаления.Вставить("00-000017", Истина);
	КодыДляУдаления.Вставить("РТ-000040", Истина);
	КодыДляУдаления.Вставить("00-000011", Истина);
	КодыДляУдаления.Вставить("000000038", Истина);
	
	Для Каждого Стр Из ТаблицаДанныхОтчета Цикл  
		Если СтрНайти(Стр.Направление, "Мотивация") <> 0 
			Или КодыДляУдаления.Получить(Стр.СтатьяЗатрат.Код) <> Неопределено Тогда     
			МассивУдаляемыхСтрок.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл 
		ТаблицаДанныхОтчета.Удалить(УдаляемаяСтрока);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуДанныхФотКолонками(ДанныеФОТ) 
	ДанныеФОТ.Колонки.Добавить("СортировкаСтатьяЗатрат", Новый ОписаниеТипов("Число"));   
	ДанныеФОТ.Колонки.Добавить("ПериодЗаписи", Новый ОписаниеТипов("Дата"));	
КонецПроцедуры    

Процедура ОпределитьПорядокСортирокиДанныхПоФОТ(ДанныеФОТ)   
	СоответствияПорядкаСортировкиСтатьиЗатрат = ПолучениеСоответствияПорядкаСортировкиСтатьиЗатрат();   
	
	Для Каждого Стр Из ДанныеФОТ Цикл    
		ПорядокСортировкиСтатьиЗатрат = СоответствияПорядкаСортировкиСтатьиЗатрат.Получить(Стр.СтатьяЗатрат);
		Если ПорядокСортировкиСтатьиЗатрат <> Неопределено Тогда
			Стр.СортировкаСтатьяЗатрат = ПорядокСортировкиСтатьиЗатрат;  
			Стр.ПериодЗаписи = Стр.ПериодОтчета.ДатаНачала;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры    

Функция ПрименитьСортировкуДанныхТаблицы(ДатаНачалаОтчета,ТаблицаДанныхОтчета)   
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВТ_Табл",ТаблицаДанныхОтчета);  
	Запрос.УстановитьПараметр("НачПер",ДобавитьМесяц(ДатаНачалаОтчета,-12));  
	Запрос.УстановитьПараметр("КонПер",КонецГода(ДатаНачалаОтчета));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Табл.Контрагент КАК Контрагент,
	|	ВТ_Табл.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_Табл.Направление КАК Направление,
	|	ВТ_Табл.Организация КАК Организация,
	|	ВТ_Табл.ОтклонениеПроцент КАК ОтклонениеПроцент,
	|	ВТ_Табл.ПериодОтчета КАК ПериодОтчета,
	|	ВТ_Табл.Проект КАК Проект,
	|	ВТ_Табл.Регион КАК Регион,
	|	ВТ_Табл.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВТ_Табл.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Табл.Сумма КАК Сумма,
	|	ВТ_Табл.СуммаОтклонение КАК СуммаОтклонение,
	|	ВТ_Табл.СуммаФакт КАК СуммаФакт,
	|	ВТ_Табл.СортировкаСтатьяЗатрат КАК СортировкаСтатьяЗатрат,
	|	ВТ_Табл.ПериодЗаписи КАК ПериодЗаписи
	|ПОМЕСТИТЬ ВТ_Табл
	|ИЗ
	|	&ВТ_Табл КАК ВТ_Табл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Табл.Контрагент КАК Контрагент,
	|	ВТ_Табл.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_Табл.Направление КАК Направление,
	|	ВТ_Табл.Организация КАК Организация,
	|	ВТ_Табл.ОтклонениеПроцент КАК ОтклонениеПроцент,
	|	ВТ_Табл.ПериодОтчета КАК ПериодОтчета,
	//|	ВТ_Табл.ПериодОтчетаРодитель КАК ПериодОтчетаРодитель,
	|	ВТ_Табл.Проект КАК Проект,
	|	ВТ_Табл.Регион КАК Регион,
	//|	ВТ_Табл.СортировкаНаправление КАК СортировкаНаправление,
	//|	ВТ_Табл.СортировкаПериод КАК СортировкаПериод,
	|	ВТ_Табл.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВТ_Табл.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Табл.Сумма КАК Сумма,
	|	ВТ_Табл.СуммаОтклонение КАК СуммаОтклонение,
	|	ВТ_Табл.СуммаФакт КАК СуммаФакт,
	|	ВТ_Табл.СортировкаСтатьяЗатрат КАК СортировкаСтатьяЗатрат,
	//|	ВТ_Табл.СортировкаПроект КАК СортировкаПроект,
	|	ВТ_Табл.ПериодЗаписи КАК ПериодЗаписи
	|ИЗ
	|	ВТ_Табл КАК ВТ_Табл
	|ГДЕ
	|	ВТ_Табл.ПериодЗаписи МЕЖДУ &НачПер И &КонПер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодЗаписи,
	|   СортировкаСтатьяЗатрат";

	
	Возврат  Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьПериодОтчета(КомпоновщикНастроек) 
    
    ДатаНачала = Неопределено;
    ДатаОкончания = Неопределено;
    ИспользовалсяПериодСверки = Ложь;
    
    Для Каждого Парам Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
        Если Не Парам.Использование Или НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Парам,"Параметр") Тогда
            Продолжить;
        КонецЕсли;
        
        ИмяПараметра = Строка(Парам.Параметр);
        
        Если ИмяПараметра = "Период" Тогда
            ДатаНачала = Парам.Значение.ДатаНачала;
            // Устанавливаем дату окончания из периода, если еще не установлена из ПериодСверки
            Если Не ИспользовалсяПериодСверки Тогда
                ДатаОкончания = Парам.Значение.ДатаОкончания;
            КонецЕсли;
            
        ИначеЕсли ИмяПараметра = "ПериодСверки" Тогда
            // ПериодСверки переопределяет только дату окончания
            ДатаОкончания = Парам.Значение.ДатаОкончания;
            ИспользовалсяПериодСверки = Год(ДатаОкончания) - Год(ДатаНачала) >= 1 Или Год(ДатаОкончания) - Год(ДатаНачала) >= -1;
        КонецЕсли;
    КонецЦикла;
    
    Результат = Новый Структура;
    Результат.Вставить("ДатаНачала", ДатаНачала);
    Результат.Вставить("ДатаОкончания", ДатаОкончания);
    Результат.Вставить("ЕстьПериодСверки", ИспользовалсяПериодСверки);
    
    Возврат Результат;
    
КонецФункции

Процедура ОбработатьСутиацииИсключения(СтруктураПериодаОтчета)
	
	Если СтруктураПериодаОтчета.ЕстьПериодСверки Тогда        
		Если Год(СтруктураПериодаОтчета.ДатаНачала) = Год(СтруктураПериодаОтчета.ДатаОкончания) Тогда 
			ШаблонИсключения = СтрШаблон("Нельзя сравнить данные за одинаковые периоды (Период текущий и Период сверки)");
			ВызватьИсключение("Нельзя сравнить данные за одинаковые периоды (Период текущий и Период сверки)");
		ИначеЕсли Год(СтруктураПериодаОтчета.ДатаНачала) > Год(СтруктураПериодаОтчета.ДатаОкончания) Тогда
			ШаблонИсключения = СтрШаблон("Нельзя сравнить данные если период сверки меньше текущего периода");
			ВызватьИсключение("Нельзя сравнить данные если период сверки меньше текущего периода");	
		КонецЕсли;  
	Иначе
		Если Год(СтруктураПериодаОтчета.ДатаНачала) <  Год(СтруктураПериодаОтчета.ДатаОкончания) 
			ИЛИ Год(СтруктураПериодаОтчета.ДатаОкончания) > Год(СтруктураПериодаОтчета.ДатаНачала) Тогда    
			 	ВызватьИсключение("Нельзя сравнивать несколько периодов в параметре ""Период текущий"" используйте параметр ""Период сверки"" ");	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьДанныеПоРаспределениюПроцентов(ДатаНачалаОтчета,ДатаОкончанияОтчета)  
	СценарииОтчета = Справочники.Сценарии.НайтиПоНаименованию("Сценарий месячный (2025 год)"); 
	МассивПериодовПроцентыРаспределения = ПериодыУХ.ПолучитьПодчиненныеПериоды(
		НачалоГода(ДатаНачалаОтчета), 
		КонецГода(ДатаОкончанияОтчета), 
		Перечисления.Периодичность.Год);
	
	ТаблицаПроцентовПоПериоду = Новый ТаблицаЗначений;
	ТаблицаПроцентовПоПериоду.Колонки.Добавить("ПериодПроцентов", Новый ОписаниеТипов("СправочникСсылка.Периоды"));  
	ТаблицаПроцентовПоПериоду.Колонки.Добавить("НаименованиеТаблицы", Новый ОписаниеТипов("Строка"));
	ТаблицаПроцентовПоПериоду.Колонки.Добавить("ТаблицаПроцентов", Новый ОписаниеТипов("ТаблицаЗначений"));
	
	ТаблицаПроцентовОЛ = ПолучитьТаблицуРаспределенияОЛ();
	
	Для Каждого ПериодПроцентов Из МассивПериодовПроцентыРаспределения Цикл    
		// Получаем год из периода
		Год = Год(ПериодПроцентов.ДатаНачала);
		
		// Инициализация таблиц процентов для текущего периода
		ТаблицаПроцентовРТС = ПолучениеТаблицыПроцентов(
		Справочники.ВидыОтчетов.НайтиПоКоду("ПроцентыРаспределенияРТС"), 
		ПериодПроцентов, 
		СценарииОтчета, 
		"Регион"); 
		
		ТаблицаПроцентовЦРЭ = ПолучениеТаблицыПроцентов(
		Справочники.ВидыОтчетов.НайтиПоКоду("ПроцентыРаспределенияЦРЭ"), 
		ПериодПроцентов, 
		СценарииОтчета, 
		"Регион");
		
		ТаблицаПроцентовОТС = ПолучениеТаблицыПроцентов(
		Справочники.ВидыОтчетов.НайтиПоКоду("ПроцентыРаспределенияОТС"), 
		ПериодПроцентов, 
		СценарииОтчета, 
		"Регион");
		
		ТаблицаПроцентовКосвенные = ПолучениеТаблицыПроцентов(
		Справочники.ВидыОтчетов.НайтиПоКоду("РасходыКонтактЦентраРТС"), 
		ПериодПроцентов, 
		СценарииОтчета, 
		"НазначениеПлатежа");
		
		// Добавляем данные в результирующую таблицу
		НоваяСтрока = ТаблицаПроцентовПоПериоду.Добавить();
		НоваяСтрока.ПериодПроцентов = ПериодПроцентов;
		НоваяСтрока.НаименованиеТаблицы = "ПроцентыРаспределенияРТС";
		НоваяСтрока.ТаблицаПроцентов = ТаблицаПроцентовРТС;
		
		НоваяСтрока = ТаблицаПроцентовПоПериоду.Добавить();
		НоваяСтрока.ПериодПроцентов = ПериодПроцентов;
		НоваяСтрока.НаименованиеТаблицы = "ПроцентыРаспределенияЦРЭ";
		НоваяСтрока.ТаблицаПроцентов = ТаблицаПроцентовЦРЭ;
		
		НоваяСтрока = ТаблицаПроцентовПоПериоду.Добавить();
		НоваяСтрока.ПериодПроцентов = ПериодПроцентов;
		НоваяСтрока.НаименованиеТаблицы = "ПроцентыРаспределенияОТС";
		НоваяСтрока.ТаблицаПроцентов = ТаблицаПроцентовОТС;
		
		НоваяСтрока = ТаблицаПроцентовПоПериоду.Добавить();
		НоваяСтрока.ПериодПроцентов = ПериодПроцентов;
		НоваяСтрока.НаименованиеТаблицы = "РасходыКонтактЦентраРТС";
		НоваяСтрока.ТаблицаПроцентов = ТаблицаПроцентовКосвенные;       
		
		//Если Год >= 2026 Тогда
			НоваяСтрока = ТаблицаПроцентовПоПериоду.Добавить();
			НоваяСтрока.ПериодПроцентов = ПериодПроцентов;
			НоваяСтрока.НаименованиеТаблицы = "ПроцентыРаспределенияОЛ";
			НоваяСтрока.ТаблицаПроцентов = ТаблицаПроцентовОЛ; 
		//КонецЕсли;
		
	КонецЦикла;   
	
	Возврат ТаблицаПроцентовПоПериоду;
КонецФункции  

Функция ПолучитьПроцентыРаспределения(НаименованиеТаблицы,Стр,ТаблицыПроцентовОрганизаций,КэшПериодов)   
	
	ДатаНачалаОтчета = Стр.ПериодОтчета.ДатаНачала;
	
	КлючКэшПериода = СтрШаблон("%1|%2",НачалоГода(ДатаНачалаОтчета),КонецГода(ДатаНачалаОтчета));
	
	МассивПериодовПроцентыРаспределения = КэшПериодов.Получить(КлючКэшПериода);
	
	Если МассивПериодовПроцентыРаспределения = Неопределено Тогда     	
		МассивПериодовПроцентыРаспределения =  ПериодыУХ.ПолучитьПодчиненныеПериоды(
			НачалоГода(ДатаНачалаОтчета), 
			КонецГода(ДатаНачалаОтчета), 
			Перечисления.Периодичность.Год)[0];
		
		КэшПериодов.Вставить(КлючКэшПериода,МассивПериодовПроцентыРаспределения);		
	КонецЕсли;	
		
	СтруктураОтбораПроцентовПоОрганизации = Новый Структура("ПериодПроцентов,НаименованиеТаблицы",МассивПериодовПроцентыРаспределения,НаименованиеТаблицы);	
	мТаблРаспределения = ТаблицыПроцентовОрганизаций.НайтиСтроки(СтруктураОтбораПроцентовПоОрганизации);  
	
	ТаблицаРаспределения = мТаблРаспределения[0].ТаблицаПроцентов;     
	Если НаименованиеТаблицы = "РасходыКонтактЦентраРТС" Или НаименованиеТаблицы = "ПроцентыРаспределенияОЛ" Тогда   
		Возврат ТаблицаРаспределения;	
	Иначе
		СтруктураОтбораПоРегиону = Новый Структура("Регион",Стр.Аналитика6); 
		Возврат ТаблицаРаспределения.НайтиСтроки(СтруктураОтбораПоРегиону);	
	КонецЕсли; 
		
КонецФункции
#КонецОбласти     

