
&НаСервере
Процедура ПроверкаНаСервере()    
	
	//ОчиститьВсе();
	
	//Параметры для заполнения отчета ++ 
	//тПериодыОтчета  = ОбъектРасчета.МассивПериодов; 
	тПериодыОтчета  = Новый Массив;
	тПериодыОтчета.Добавить(Справочники.Периоды.НайтиПоНаименованию("2025 г.")); 
	КодГруппыОтчетов = "ИзменениеОклада6";    
	//СценарииОтчета = ОбъектРасчета.Сценарий;
	//ВидОтчетаПоказателя = ОбъектРасчета.ВидОтчета;
	//--        
	ВидОтчетаПоказателя = Справочники.ВидыОтчетов.НайтиПоКоду("СводныйОтчетИзменениеОкладовМногопериодныйОТС");
	СценарииОтчета = Справочники.Сценарии.НайтиПоНаименованию("Сценарий месячный (2025 год)");   
	
	//СценарииОтчета = Справочники.Сценарии.НайтиПоНаименованию("Сценарий месячный (2025 год)");   
	
	
	//Получим все виды отчеты подчиенные группе ++
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("РодительКод",КодГруппыОтчетов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыОтчетов КАК ВидыОтчетов
	|		ПО НастраиваемыйОтчет.ВидОтчета = ВидыОтчетов.Ссылка
	|ГДЕ
	|	ВидыОтчетов.Родитель.Код = &РодительКод
	|	И НЕ ВидыОтчетов.ПометкаУдаления
	|	И НЕ НастраиваемыйОтчет.ПометкаУдаления
	|	И НЕ ВидыОтчетов.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда   
		Сообщение = "Возникли ошибки при заполнении сводного отчета. Обратитесь к администраторам системы";  
		ОбщегоНазначенияКлиентСерверУХ.СообщитьПользователю(Сообщение);
	Иначе     
		МассивОтчетовИзменениеОкладов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");	
	КонецЕсли;
	//--
	
	
	//Получим общее количество показалетей отчетов ++     	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("МассивВладельцев", МассивОтчетовИзменениеОкладов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияПоказателейОтчетов4.Показатель.Код КАК ПоказательКод,
	|	ЗначенияПоказателейОтчетов4.Показатель.ТипЗначения КАК ПоказательТипЗначения
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетов4 КАК ЗначенияПоказателейОтчетов4
	|ГДЕ
	|	ЗначенияПоказателейОтчетов4.Показатель.Владелец В(&МассивВладельцев)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗначенияПоказателейОтчетов4.Показатель.Код,
	|	ЗначенияПоказателейОтчетов4.Показатель.ТипЗначения,
	|	ЗначенияПоказателейОтчетов4.Показатель.ТипПоказателя.Наименование
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗначенияПоказателейОтчетовНечисловые.Показатель.Код,
	|	ЗначенияПоказателейОтчетовНечисловые.Показатель.ТипЗначения
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетовНечисловые КАК ЗначенияПоказателейОтчетовНечисловые
	|ГДЕ
	|	ЗначенияПоказателейОтчетовНечисловые.Показатель.Владелец В(&МассивВладельцев)";
	
	РезультатЗапросаПоказатели = Запрос.Выполнить();
	Если РезультатЗапросаПоказатели.Пустой() Тогда   
		Сообщение = "Возникли ошибки при заполнении сводного отчета. Обратитесь к администраторам системы";  
		ОбщегоНазначенияКлиентСерверУХ.СообщитьПользователю(Сообщение);
	Иначе     
		МассивПоказателейОтчета = РезультатЗапросаПоказатели.Выгрузить();	
	КонецЕсли;
	//--
	
	ТаблицаИзменениеОклада = Новый ТаблицаЗначений; 
	Для Каждого СтрКолонка Из МассивПоказателейОтчета Цикл  
		Если СокрЛП(СтрКолонка.ПоказательКод) = "ИзменениеОклада_Ставка" И Строка(СтрКолонка.ПоказательТипЗначения) = "Число" Тогда        
			Продолжить;
		КонецЕсли;
		ТаблицаИзменениеОклада.Колонки.Добавить(СокрЛП(СтрКолонка.ПоказательКод),Новый ОписаниеТипов(Строка(СтрКолонка.ПоказательТипЗначения)));	
	КонецЦикла;
	
	//Добавим аналитики к таблице измнения окладов ++ 
	ТаблицаИзменениеОклада.Колонки.Добавить("Аналитика1",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	//-- 
	
	//Добавим вид отчета к таблице измнения окладов ++ 
	ТаблицаИзменениеОклада.Колонки.Добавить("ВидОтчета",Новый ОписаниеТипов("СправочникСсылка.ВидыОтчетов"));
	//--
	
	
	//Получим, заполним данными сводный отчет ++
	Для Каждого ВидОтчета Из МассивОтчетовИзменениеОкладов Цикл    		
		СтруктураПараметровОтбора   = Новый Структура("ВидОтчета,ПериодОтчета,Сценарий",  
		ВидОтчета,тПериодыОтчета,СценарииОтчета);
		
		РаскрываемыеАналитики       = Новый Структура("Аналитика1,Аналитика2,Аналитика3,Аналитика4");
		
		тЗначенияПоказателейВидаОтчета = СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(
		СтруктураПараметровОтбора,РаскрываемыеАналитики);          
		
		Если тЗначенияПоказателейВидаОтчета.Количество() =  0 Тогда      
			//Сообщить(ВидОтчета.Наименование);
			Продолжить;
		КонецЕсли;   
		
		Таб1 = тЗначенияПоказателейВидаОтчета.Скопировать();
		Таб1.Свернуть("Аналитика1");
		Для Каждого Стр Из Таб1 Цикл       
			СтруктураОтбора = Новый Структура("Аналитика1",Стр.Аналитика1);
			МассивСтрок = тЗначенияПоказателейВидаОтчета.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда   
				НовСтр = ТаблицаИзменениеОклада.Добавить(); 
				НовСтр.ВидОтчета = ВидОтчета;
				НовСтр.Аналитика1 = Стр.Аналитика1;
				Для Каждого СтрДанные Из МассивСтрок Цикл     
					Если СтрДанные.Значение =	-1	Тогда 
						НовСтр[СокрЛП(СтрДанные.ПоказательОтчета.Код)] = СтрДанные.ЗначениеНечисловое;
					Иначе  
						НовСтр[СокрЛП(СтрДанные.ПоказательОтчета.Код)] = СтрДанные.Значение;	
					КонецЕсли;				
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	
	///Сбродов М.В. Добавляем таблицу ДМС РТС для будущего добавления ее в отчет
	
	ВидОтчета = Справочники.ВидыОтчетов.НайтиПоКоду("ДМС2025");
	
	Данные_Стоимость_ДМС_СуммаРуб = Справочники.ПоказателиОтчетов.НайтиПоКоду("Данные_Стоимость",,,ВидОтчета);
	
	ТаблицаДМС = Новый ТаблицаЗначений();
	//Добавим аналитики к таблице  
	ТаблицаДМС.Колонки.Добавить("Аналитика1",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаДМС.Колонки.Добавить("Данные_Стоимость",Новый ОписаниеТипов("Число"));         
	ТаблицаДМС.Колонки.Добавить("ВидОтчета",Новый ОписаниеТипов("СправочникСсылка.ВидыОтчетов"));	
	
	СтруктураПараметровОтбора   = Новый Структура("ВидОтчета,ПериодОтчета,Сценарий",  
	ВидОтчета,тПериодыОтчета,СценарииОтчета);
	
	РаскрываемыеАналитики       = Новый Структура("Аналитика1");
	
	тЗначенияПоказателейВидаОтчета = СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(
	СтруктураПараметровОтбора,РаскрываемыеАналитики);           
	
	Таб1 = тЗначенияПоказателейВидаОтчета.Скопировать();
	Таб1.Свернуть("Аналитика1");
	Для Каждого Стр Из Таб1 Цикл       
		СтруктураОтбора = Новый Структура("Аналитика1",Стр.Аналитика1);
		МассивСтрок = тЗначенияПоказателейВидаОтчета.НайтиСтроки(СтруктураОтбора);
		Если МассивСтрок.Количество() > 0 Тогда   
			НовСтр = ТаблицаДМС.Добавить(); 
			НовСтр.ВидОтчета = ВидОтчета;
			НовСтр.Аналитика1 = Стр.Аналитика1;
			Для Каждого СтрДанные Из МассивСтрок Цикл     
				Если СтрДанные.Значение =	-1	Тогда 
					НовСтр[СокрЛП(СтрДанные.ПоказательОтчета.Код)] = СтрДанные.ЗначениеНечисловое;
				Иначе  
					НовСтр[СокрЛП(СтрДанные.ПоказательОтчета.Код)] = СтрДанные.Значение;	
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	////////////////////////////////////////////////////////////////////////////
	
	
	КодГруппыОтчетов = "РаспределениеПоБЛ6";    
	
	//Получим все виды отчеты подчиенные группе ++
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("РодительКод",КодГруппыОтчетов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыОтчетов КАК ВидыОтчетов
	|		ПО НастраиваемыйОтчет.ВидОтчета = ВидыОтчетов.Ссылка
	|ГДЕ
	|	ВидыОтчетов.Родитель.Код = &РодительКод
	|	И НЕ ВидыОтчетов.ПометкаУдаления
	|	И НЕ НастраиваемыйОтчет.ПометкаУдаления
	|	И НЕ ВидыОтчетов.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда   
		Сообщение = "Возникли ошибки при заполнении сводного отчета. Обратитесь к администраторам системы";  
		ОбщегоНазначенияКлиентСерверУХ.СообщитьПользователю(Сообщение);
	Иначе     
		МассивОтчетовИзменениеОкладов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");	
	КонецЕсли;
	//--
	
	ТаблицаРаспределениеПроцентов = Новый ТаблицаЗначений; 
	ТаблицаРаспределениеПроцентов.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаРаспределениеПроцентов.Колонки.Добавить("КолонкаНаименование",Новый ОписаниеТипов("Строка"));
	ТаблицаРаспределениеПроцентов.Колонки.Добавить("ПроцентПоБизнесЛинии",Новый ОписаниеТипов("Число")); 
	ТаблицаРаспределениеПроцентов.Колонки.Добавить("Регион",Новый ОписаниеТипов("СправочникСсылка.ПроизвольныйКлассификаторУХ"));	
	
	//Получим, заполним данными сводный отчет ++
	Для Каждого ВидОтчета Из МассивОтчетовИзменениеОкладов Цикл    		
		СтруктураПараметровОтбора   = Новый Структура("ВидОтчета,ПериодОтчета,Сценарий",  
		ВидОтчета,тПериодыОтчета,СценарииОтчета);
		
		РаскрываемыеАналитики       = Новый Структура("Аналитика1,Аналитика2,Аналитика3");
		
		тЗначенияПоказателейВидаОтчета = СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(
		СтруктураПараметровОтбора,РаскрываемыеАналитики);          
		
		Если тЗначенияПоказателейВидаОтчета.Количество() =  0 Тогда      
			Сообщение = "Обратите внимание, отчет - "+ВидОтчета.Наименование + " не заполнен, и не будет включен в текущий отчет!"; 
			ОбщегоНазначенияКлиентСерверУХ.СообщитьПользователю(Сообщение);
			Продолжить;
		КонецЕсли;                   
		
		Для Каждого Стр Из тЗначенияПоказателейВидаОтчета Цикл 
			НовСтр = ТаблицаРаспределениеПроцентов.Добавить(); 
			НовСтр.Сотрудник = Стр.Аналитика1; 
			Если Стр.ПоказательОтчета.Колонка.Наименование = "GМаркет" Тогда    
				НовСтр.КолонкаНаименование = "G-Маркет";
			Иначе
				НовСтр.КолонкаНаименование = Стр.ПоказательОтчета.Колонка.Наименование;	
			КонецЕсли;
			
			Если Стр.Значение = -1	Тогда 
				ПроцентРаспределения  = Стр.ЗначениеНечисловое;
			Иначе  
				ПроцентРаспределения  = Стр.Значение;	
			КонецЕсли; 
			НовСтр.ПроцентПоБизнесЛинии = ПроцентРаспределения;
			НовСтр.Регион = Стр.Аналитика2;
		КонецЦикла;    
		
	КонецЦикла;	   
	
	Январь2025 = Справочники.Периоды.НайтиПоНаименованию("Январь 2025 г.");
	ИзменениеОкладов_СуммаРуб = Справочники.ПоказателиОтчетов.НайтиПоКоду("ИзменениеОкладов_СуммаРуб",,,ВидОтчетаПоказателя); 	
	ИзменениеОкладов_СоотношениПоПроектам = Справочники.ПоказателиОтчетов.НайтиПоКоду("ИзменениеОкладов_СоотношениПоПроектам",,,ВидОтчетаПоказателя); 	
	
	//Данные по статье затрат, статье доходов расходов, назначению платежа  ++	
	СтруктураПараметровОтбора   = Новый Структура("ВидОтчета,ПериодОтчета,Сценарий",  
	Справочники.ВидыОтчетов.НайтиПоКоду("ВспомогаОтчетМеппингНазваниеВакансииНПФИО"),тПериодыОтчета,СценарииОтчета);	
	РаскрываемыеАналитики       = Новый Структура("Аналитика1,Аналитика2,Аналитика3");
	
	ТаблицаВспомогательная = СводнаяТаблицаУХ.ПолучитьЗначениеПоказателей(
	СтруктураПараметровОтбора,РаскрываемыеАналитики);          	
	//--
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВТ_Данные1",ТаблицаРаспределениеПроцентов); 
	Запрос.УстановитьПараметр("ВТ_НазначениеСтатья",ТаблицаВспомогательная);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_РаспределениеПроцентов.Сотрудник КАК Сотрудник,
	|	ВЫРАЗИТЬ(ВТ_РаспределениеПроцентов.КолонкаНаименование КАК СТРОКА(20)) КАК КолонкаНаименование,
	|	ВТ_РаспределениеПроцентов.ПроцентПоБизнесЛинии КАК ПроцентПоБизнесЛинии,
	|	ВТ_РаспределениеПроцентов.Регион КАК Регион
	|ПОМЕСТИТЬ ВТ_РаспределениеПроцентов
	|ИЗ
	|	&ВТ_Данные1 КАК ВТ_РаспределениеПроцентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НазначениеСтатья.Аналитика1 КАК Сотрудник,
	|	ВТ_НазначениеСтатья.Аналитика2 КАК СтатьяДоходовРасходов,
	|	ВТ_НазначениеСтатья.Аналитика3 КАК НазначениеПлатежа
	|ПОМЕСТИТЬ ВТ_НазначениеСтатья
	|ИЗ
	|	&ВТ_НазначениеСтатья КАК ВТ_НазначениеСтатья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НазначениеСтатья.Сотрудник КАК Сотрудник,
	|	ВТ_НазначениеСтатья.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВТ_НазначениеСтатья.НазначениеПлатежа КАК НазначениеПлатежа
	|ПОМЕСТИТЬ ВТ_НазначениеСтатья_ИТОГ
	|ИЗ
	|	ВТ_НазначениеСтатья КАК ВТ_НазначениеСтатья
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_НазначениеСтатья.Сотрудник КАК Сотрудник,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_НазначениеСтатья.НазначениеПлатежа) КАК КоличествоНазначений
	|		ИЗ
	|			ВТ_НазначениеСтатья КАК ВТ_НазначениеСтатья
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_НазначениеСтатья.Сотрудник) КАК ВложенныйЗапрос
	|		ПО (ВТ_НазначениеСтатья.Сотрудник = ВложенныйЗапрос.Сотрудник
	|				И ВложенныйЗапрос.КоличествоНазначений < 2)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные1.Сотрудник КАК Сотрудник,
	|	ВТ_Данные1.ПроцентПоБизнесЛинии КАК ПроцентПоБизнесЛинии,
	|	ПроизвольныйКлассификаторУХ.Ссылка КАК Проект,
	|	ВТ_Данные1.Регион КАК Регион,
	|	ВложенныйЗапрос.Регион КАК КолВоРегионов,
	|	ВТ_НазначениеСтатья_ИТОГ.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВТ_НазначениеСтатья_ИТОГ.НазначениеПлатежа КАК НазначениеПлатежа
	|ИЗ
	|	ВТ_РаспределениеПроцентов КАК ВТ_Данные1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроизвольныйКлассификаторУХ КАК ПроизвольныйКлассификаторУХ
	|		ПО ВТ_Данные1.КолонкаНаименование = ПроизвольныйКлассификаторУХ.Наименование
	|			И (ПроизвольныйКлассификаторУХ.Владелец.Наименование = ""Проект"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_РаспределениеПроцентов.Сотрудник КАК Сотрудник,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_РаспределениеПроцентов.Регион) КАК Регион
	|		ИЗ
	|			ВТ_РаспределениеПроцентов КАК ВТ_РаспределениеПроцентов
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_РаспределениеПроцентов.Сотрудник) КАК ВложенныйЗапрос
	|		ПО ВТ_Данные1.Сотрудник = ВложенныйЗапрос.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НазначениеСтатья_ИТОГ КАК ВТ_НазначениеСтатья_ИТОГ
	|		ПО ВТ_Данные1.Сотрудник = ВТ_НазначениеСтатья_ИТОГ.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные1.Сотрудник,
	|	ВТ_Данные1.ПроцентПоБизнесЛинии,
	|	ПроизвольныйКлассификаторУХ.Ссылка,
	|	ВТ_Данные1.Регион,
	|	ВложенныйЗапрос.Регион,
	|	ВТ_НазначениеСтатья_ИТОГ.СтатьяДоходовРасходов,
	|	ВТ_НазначениеСтатья_ИТОГ.НазначениеПлатежа";    
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	//Соответсвие периодов
	СоответствиеПериодов = Новый Соответствие; 
	СоответствиеПериодов.Вставить("01.01.2025",Справочники.Периоды.НайтиПоНаименованию("Январь 2025 г.")); 
	СоответствиеПериодов.Вставить("01.02.2025",Справочники.Периоды.НайтиПоНаименованию("Февраль 2025 г."));
	СоответствиеПериодов.Вставить("01.03.2025",Справочники.Периоды.НайтиПоНаименованию("Март 2025 г."));
	СоответствиеПериодов.Вставить("01.04.2025",Справочники.Периоды.НайтиПоНаименованию("Апрель 2025 г."));
	СоответствиеПериодов.Вставить("01.05.2025",Справочники.Периоды.НайтиПоНаименованию("Май 2025 г."));
	СоответствиеПериодов.Вставить("01.06.2025",Справочники.Периоды.НайтиПоНаименованию("Июнь 2025 г."));
	СоответствиеПериодов.Вставить("01.07.2025",Справочники.Периоды.НайтиПоНаименованию("Июль 2025 г."));
	СоответствиеПериодов.Вставить("01.08.2025",Справочники.Периоды.НайтиПоНаименованию("Август 2025 г."));
	СоответствиеПериодов.Вставить("01.09.2025",Справочники.Периоды.НайтиПоНаименованию("Сентябрь 2025 г."));
	СоответствиеПериодов.Вставить("01.10.2025",Справочники.Периоды.НайтиПоНаименованию("Октябрь 2025 г."));
	СоответствиеПериодов.Вставить("01.11.2025",Справочники.Периоды.НайтиПоНаименованию("Ноябрь 2025 г."));
	СоответствиеПериодов.Вставить("01.12.2025",Справочники.Периоды.НайтиПоНаименованию("Декабрь 2025 г."));
	//--  
	
	//Соответсвие Месяцев
	СоответствиеМесяцев = Новый Соответствие; 
	СоответствиеМесяцев.Вставить("1",Справочники.Периоды.НайтиПоНаименованию("Январь 2025 г.")); 
	СоответствиеМесяцев.Вставить("2",Справочники.Периоды.НайтиПоНаименованию("Февраль 2025 г."));
	СоответствиеМесяцев.Вставить("3",Справочники.Периоды.НайтиПоНаименованию("Март 2025 г."));
	СоответствиеМесяцев.Вставить("4",Справочники.Периоды.НайтиПоНаименованию("Апрель 2025 г."));
	СоответствиеМесяцев.Вставить("5",Справочники.Периоды.НайтиПоНаименованию("Май 2025 г."));
	СоответствиеМесяцев.Вставить("6",Справочники.Периоды.НайтиПоНаименованию("Июнь 2025 г."));
	СоответствиеМесяцев.Вставить("7",Справочники.Периоды.НайтиПоНаименованию("Июль 2025 г."));
	СоответствиеМесяцев.Вставить("8",Справочники.Периоды.НайтиПоНаименованию("Август 2025 г."));
	СоответствиеМесяцев.Вставить("9",Справочники.Периоды.НайтиПоНаименованию("Сентябрь 2025 г."));
	СоответствиеМесяцев.Вставить("10",Справочники.Периоды.НайтиПоНаименованию("Октябрь 2025 г."));
	СоответствиеМесяцев.Вставить("11",Справочники.Периоды.НайтиПоНаименованию("Ноябрь 2025 г."));
	СоответствиеМесяцев.Вставить("12",Справочники.Периоды.НайтиПоНаименованию("Декабрь 2025 г."));
	//--     
	
	СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("00-000017");    
	СтатьяЗатраФОТНалоги = Справочники.СтатьиЗатрат.НайтиПоКоду("РТ-000040");
	СтатьяЗатратМотивация = Справочники.СтатьиЗатрат.НайтиПоКоду("00-000018");
	
	ДействующиеСотрудники =  Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("00-000046"); 
	ИзменениеОклада = Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("00-000055");
	ВакансииНаЗамену = Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("00-000056");
	ДекретныйОтпуск = Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("00-000054");
	СтатьяДоходовРасходов = Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
	
	///Сбродов М.В. ДМС
	СтатьяЗатратДМС = Справочники.СтатьиЗатрат.НайтиПоКоду("00-000011");
	СтатьяДиРПрочееКадры = Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("00-000025");	 
	НазначениеПлатежаДМС = Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000165");
	///////////////////     
	
	
	//{Воронков А.Д. Статус ШЕ  ++ 
	ПоказательОтчета_СтатусШЕ = Справочники.ПоказателиОтчетов.НайтиПоКоду("ИзменениеОкладов_СтатусШЕ",,,ВидОтчетаПоказателя); 	
	//--}  
	
	//{Воронков А.Д. Трансферты ++   
	ПоказательОтчета_Трансферт = Справочники.ПоказателиОтчетов.НайтиПоКоду("ИзменениеОкладов_ПереводИзРТСТОТС",,,ВидОтчетаПоказателя);    
	ПоказательОтчета_ПроектТрансферт = Справочники.ПоказателиОтчетов.НайтиПоКоду("ИзменениеОкладов_ПроектТрансферт",,,ВидОтчетаПоказателя); 
	//--}
	
	МассивТрансфертСотрудников = Новый Массив;
	МассивТрансфертСотрудников.Добавить(Справочники.Сотрудники.НайтиПоНаименованию("Захарова Александра Михайловна"));
	
	АналитикаПроектОбучение =  Справочники.ПроизвольныйКлассификаторУХ.НайтиПоКоду("000000010");  //Обучение
	
	СтавкаДоПревышения = 30.2;
	СтавкаПослеПревышения = 15.3;       
	ЗначениеСуммаДоПревышения = 2759000;
	
	ДекретныйОтпускИсключение = Новый Массив;
	ДекретныйОтпускИсключение.Добавить(Справочники.Сотрудники.НайтиПоНаименованию("Спицына Инна Сергеевна")); 
	ДекретныйОтпускИсключение.Добавить(Справочники.Сотрудники.НайтиПоНаименованию("Васильева Полина Федоровна"));
	ДекретныйОтпускИсключение.Добавить(Справочники.Сотрудники.НайтиПоНаименованию("Князева Надежда Александровна"));
	ДекретныйОтпускИсключение.Добавить(Справочники.Сотрудники.НайтиПоНаименованию("Косарева Нина Викторовна"));
	ДекретныйОтпускИсключение.Добавить(Справочники.Сотрудники.НайтиПоНаименованию("Байрамова Ирина Николаевна"));
	ДекретныйОтпускИсключение.Добавить(Справочники.Сотрудники.НайтиПоНаименованию("Бичикашвили Татьяна Владимировна"));
	ДекретныйОтпускИсключение.Добавить(Справочники.Сотрудники.НайтиПоНаименованию("Дашиева Ольга Дашидондоковна"));
	ДекретныйОтпускИсключение.Добавить(Справочники.Сотрудники.НайтиПоНаименованию("Амирова Светлана Разиевна"));
	
	
	                   
		Для Каждого СотрИзм Из ТаблицаИзменениеОклада Цикл   
		
		Локация = СокрЛП(СотрИзм.ИзменениеОклада_Локация);
		
		ПризнакВторогоЭтапа = Ложь;  
		ПризнакИзмененияОклада = Ложь;
		ПризнакВыводаПроцентыБЛ = Ложь;
		ПризнакМотивации = Ложь;
		
		ПризнакПитания = Ложь;
		ПризнакДМС = Ложь;
		
		ПризнакРасчетаПоДекретницеИсключение = Ложь; 
		ПризнакРасчетаТрансферт = Ложь;

		
		СтруктураОтбора = Новый Структура("Сотрудник",СотрИзм.Аналитика1);	 
		МассивДанныхПроценты = РезультатЗапроса.НайтиСтроки(СтруктураОтбора); 
		
		Если СтрНайти(СотрИзм.Аналитика1.Наименование,"Уволен") > 0  Тогда  
			СтатьяДоходовРасходов = ВакансииНаЗамену;      
			ПризнакМотивации = Истина;
		ИначеЕсли СтрНайти(СотрИзм.ИзменениеОклада_Ставка,"Декрет") > 0 Тогда       
			СтатьяДоходовРасходов = ДекретныйОтпуск;	  
		Иначе
			СтатьяДоходовРасходов = ДействующиеСотрудники;	  
			ПризнакМотивации = Истина;
		КонецЕсли;    
		
		СреднемесячнаяПремия = СотрИзм.ИзменениеОклада_СреднемесячнаяПремия;  
		
		Если ПризнакМотивации Тогда
			Если СреднемесячнаяПремия = 0 ИЛИ СреднемесячнаяПремия = Неопределено Тогда  
				ПризнакМотивации = Ложь;	
			КонецЕсли;
		КонецЕсли;
		
		Если СотрИзм.ИзменениеОклада_ДатаИзменения <> Дата(1,1,1) Тогда
			ПризнакИзмененияОклада = Истина;	
		КонецЕсли;   
		ИзменениеОклада_ДатаИзменеВторойЭтап = СотрИзм.ИзменениеОклада_ДатаИзменеВторойЭтап;
		ИзменениеОклада_ОкладТекущий = СотрИзм.ИзменениеОклада_ОкладТекущий;	
		ИзменениеОклада_ДельтаМеждуОкладами = СотрИзм.ИзменениеОклада_ДельтаМеждуОкладами;       
		ИзменениеОклада_НовыйОкладВторойЭтап = СотрИзм.ИзменениеОклада_НовыйОкладВторойЭтап;    
		ИзменениеОклада_ДельтаМеждуОкладами_ВторойЭтап = 0;
		//СотрИзм.Аналитика1.Наименование = "Баранов Виктор Сергеевич"
		Если МассивДанныхПроценты.Количество() > 0 Тогда   
			
			Для Каждого СтрПроценты Из МассивДанныхПроценты Цикл    
				
				ДостиглиДоПревышения = Ложь;
				ДостиглиПослеПревышения = Ложь;
				ФОТНалогиСумма = 0;            
				СуммаДоПревышения = 0; 
				СуммаПослеПревышения = 0; 
				ФОТНалогиСумма_ИзменениеОклада = 0;
				
				ОбщаяСуммаДохода = 0;
				ИзменениеОклада_ДанныеСумма = 0;           
				ИзменениеОкладаСумма_ДоПревышения = 0;     
				ИзменениеОкладаСумма_ПослеПревышения = 0;
				
				ИзменениеОкладаСумма_ДоПревышения_ПредыдущийМесяц = 0;  
				
				ИзменениеОклада_ДельтаМеждуОкладами_ВторойЭтап = 0;  			
				
				Сч = 1;      
				
				СчМесяцПервыйЭтап = Месяц(СотрИзм.ИзменениеОклада_ДатаИзменения);	    
								
				Если ИзменениеОклада_ДатаИзменеВторойЭтап <> Дата(1,1,1) Тогда     
					ПризнакВторогоЭтапа = Истина;
					СчМесяцВторойЭтап = Месяц(ИзменениеОклада_ДатаИзменеВторойЭтап);	 		
				КонецЕсли;
				
				//Действующие сотрудники ++ 
				//Если статья доходов/расходов "Декретный отпуск" и не заполнена дельта расчета, пропускаем такую строку, добавлять не будем.
				Если СтатьяДоходовРасходов = ДекретныйОтпуск И ИзменениеОклада_ДельтаМеждуОкладами = 0 И ИзменениеОклада_ОкладТекущий = 0 Тогда   
					Продолжить;
				Иначе    
					
					АналитикаПроект = СтрПроценты.Проект;
					АналитикаНазначениеПлатежа = СтрПроценты.НазначениеПлатежа;   
					АналитикаСотрудник = СтрПроценты.Сотрудник;
					АналитикаРегион = СтрПроценты.Регион;
					
					КолВоРегионов = СтрПроценты.КолВоРегионов;    
					ПроцентПоБизнесЛинии = СтрПроценты.ПроцентПоБизнесЛинии;     
					
					ПроцентПоБизнесЛинииОКР = Окр(ПроцентПоБизнесЛинии,2,РежимОкругления.Окр15как20);
									
					Если ДекретныйОтпускИсключение.Найти(АналитикаСотрудник) <> Неопределено Тогда  
						//ДанныеСуммаОКР = ДанныеСуммаОКР * 0.16;	                                    
						ПризнакРасчетаПоДекретницеИсключение = Истина;
					КонецЕсли;   
					
					Если МассивТрансфертСотрудников.Найти(АналитикаСотрудник) <> Неопределено Тогда
                    	ПризнакРасчетаТрансферт = Истина;      
						АналитикаПроект = АналитикаПроектОбучение;
					КонецЕсли;  
					
					Пока Сч <= 12 Цикл   
						ПериодОтчета = СоответствиеМесяцев.Получить(Строка(Сч));
						Если ПризнакРасчетаПоДекретницеИсключение Тогда	
							ДанныеСумма = ((ИзменениеОклада_ОкладТекущий / КолВоРегионов) * ПроцентПоБизнесЛинииОКР) * 0.16;	 
						ИначеЕсли ПризнакРасчетаТрансферт Тогда
							ДанныеСумма = ((ИзменениеОклада_ОкладТекущий / КолВоРегионов) * ПроцентПоБизнесЛинииОКР) * 0.26;	
						Иначе
							ДанныеСумма = (ИзменениеОклада_ОкладТекущий / КолВоРегионов) * ПроцентПоБизнесЛинииОКР;		
						КонецЕсли;  
						
						ДанныеСуммаОКР = Окр(ДанныеСумма,5,РежимОкругления.Окр15как20);
						
						//Строки с Аналитикой Статья доходов расходов - ВакансииНаЗамену,ДекретныйОтпуск,ДействующиеСотрудники - начинаем считать с начала года, т.е. с января, всегда.   
						//Строка ФОТ - СтатьяДоходовРасходов -  ВакансииНаЗамену,ДекретныйОтпуск,ДействующиеСотрудники в зависимости от условия.
						УстановитьЗначениеПоказателя(
						ИзменениеОкладов_СуммаРуб,   
						ДанныеСуммаОКР,
						ПериодОтчета,
						АналитикаПроект,СтатьяЗатрат,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
						//--

						///Сбродов М.В. Добавим строку ДМС
						СтрокаДМС = ТаблицаДМС.Найти(АналитикаСотрудник,"Аналитика1");
						Если СтрокаДМС<>Неопределено Тогда   
							ПризнакДМС = Истина;
							УстановитьЗначениеПоказателя(
							ИзменениеОкладов_СуммаРуб,   
							((СтрокаДМС.Данные_Стоимость/12) / КолВоРегионов) * ПроцентПоБизнесЛинииОКР,
							ПериодОтчета,
							АналитикаПроект,СтатьяЗатратДМС,СтатьяДиРПрочееКадры,НазначениеПлатежаДМС,АналитикаСотрудник,АналитикаРегион);
						КонецЕсли;
						//--
						/////////////////////////////////
                                                                  
						//Новый код ++     
						ОбщаяСуммаДохода = ОбщаяСуммаДохода;    
						
						Если ПризнакРасчетаПоДекретницеИсключение Тогда 
							ДоходЗаМесяц = (ИзменениеОклада_ОкладТекущий + ?(ПризнакМотивации,СреднемесячнаяПремия,0)) * 0.16; 	
						ИначеЕсли ПризнакРасчетаТрансферт Тогда
							ДоходЗаМесяц = ((ИзменениеОклада_ОкладТекущий / КолВоРегионов) * ПроцентПоБизнесЛинииОКР) * 0.26;	
						Иначе
							ДоходЗаМесяц = ИзменениеОклада_ОкладТекущий + ?(ПризнакМотивации,СреднемесячнаяПремия,0); 
						КонецЕсли;  
						
						//Сбродов М.В.
						Если ПризнакИзмененияОклада //Если вообще нет изменения окладов не считаем пропорции
						//Сбродов М.В.
						И Сч >= СчМесяцПервыйЭтап Тогда    
							Если ПризнакИзмененияОклада И ИзменениеОклада_ДельтаМеждуОкладами <> 0 Тогда   
								ПризнакВыводаПроцентыБЛ = Истина;
								Если ПризнакИзмененияОклада И НЕ ПризнакВторогоЭтапа Тогда      
									ДоходЗаМесяц = ДоходЗаМесяц + ИзменениеОклада_ДельтаМеждуОкладами;
									ИзменениеОклада_ДанныеСумма = (ИзменениеОклада_ДельтаМеждуОкладами /КолВоРегионов) * ПроцентПоБизнесЛинииОКР;	   									
								ИначеЕсли ПризнакИзмененияОклада И ПризнакВторогоЭтапа И Сч < СчМесяцВторойЭтап Тогда  
									ДоходЗаМесяц = ДоходЗаМесяц + ИзменениеОклада_ДельтаМеждуОкладами;	   	
									ИзменениеОклада_ДанныеСумма = (ИзменениеОклада_ДельтаМеждуОкладами /КолВоРегионов) * ПроцентПоБизнесЛинииОКР;   
									
								ИначеЕсли ПризнакИзмененияОклада И ПризнакВторогоЭтапа И Сч >= СчМесяцВторойЭтап Тогда    
									ИзменениеОклада_ДельтаМеждуОкладами_ВторойЭтап = СотрИзм.ИзменениеОклада_НовыйОкладВторойЭтап-СотрИзм.ИзменениеОклада_НовыйОкладРубМес;
									ДоходЗаМесяц = ДоходЗаМесяц + ИзменениеОклада_ДельтаМеждуОкладами + ИзменениеОклада_ДельтаМеждуОкладами_ВторойЭтап;        
									ИзменениеОклада_ДанныеСумма = (((ИзменениеОклада_ДельтаМеждуОкладами + (ИзменениеОклада_НовыйОкладВторойЭтап-СотрИзм.ИзменениеОклада_НовыйОкладРубМес))/КолВоРегионов) * ПроцентПоБизнесЛинииОКР);
								КонецЕсли;	
								
								ИзменениеОклада_ДанныеСумма = Окр(ИзменениеОклада_ДанныеСумма,5,РежимОкругления.Окр15как20);
								
								//Строка ФОТ - Изменение оклада ++
								УстановитьЗначениеПоказателя(
								ИзменениеОкладов_СуммаРуб,   
								ИзменениеОклада_ДанныеСумма,
								ПериодОтчета,
								АналитикаПроект,СтатьяЗатрат,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);   
								//--
							КонецЕсли;
						КонецЕсли;    
						
						ОбщаяСуммаДохода = ОбщаяСуммаДохода + ДоходЗаМесяц;      
						
						Если ОбщаяСуммаДохода = ЗначениеСуммаДоПревышения Тогда 
							СуммаДоПревышения = ДоходЗаМесяц * СтавкаДоПревышения / 100;       
							
							ИзменениеОкладаСумма_ДоПревышения = СуммаДоПревышения * СтавкаДоПревышения / 100;
							ДостиглиДоПревышения = Истина;
						ИначеЕсли ОбщаяСуммаДохода < ЗначениеСуммаДоПревышения Тогда 
							СуммаДоПревышения = ДоходЗаМесяц * СтавкаДоПревышения / 100;  
							ИзменениеОкладаСумма_ДоПревышения = ИзменениеОклада_ДанныеСумма * СтавкаДоПревышения / 100;   
							
							
						ИначеЕсли ОбщаяСуммаДохода > ЗначениеСуммаДоПревышения Тогда 
						
						    //Сбродов М.В. 2025-03-03
							Если ОбщаяСуммаДохода - ДоходЗаМесяц>ЗначениеСуммаДоПревышения Тогда
								ДостиглиДоПревышения = Истина;                                      
							КонецЕсли;
							//Сбродов М.В. 2025-03-03
						  
							Если ДостиглиДоПревышения Тогда
								СуммаДоПревышения = 0;
							Иначе
								СуммаДоПревышения = (ЗначениеСуммаДоПревышения -(ОбщаяСуммаДохода - ДоходЗаМесяц)) * СтавкаДоПревышения / 100;  
								
								ИзменениеОкладаСумма_ДоПревышения = СуммаДоПревышения * СтавкаДоПревышения / 100;
							КонецЕсли; 
							Если ДостиглиПослеПревышения Тогда
								СуммаПослеПревышения = (ДоходЗаМесяц * СтавкаПослеПревышения) / 100;	 							
								ИзменениеОкладаСумма_ПослеПревышения = ИзменениеОклада_ДанныеСумма * СтавкаПослеПревышения / 100; 							
							Иначе   
								СуммаПослеПревышения = (ОбщаяСуммаДохода - ЗначениеСуммаДоПревышения) * СтавкаПослеПревышения / 100;     								
								ИзменениеОкладаСумма_ПослеПревышения = СуммаПослеПревышения * СтавкаПослеПревышения / 100;
								//Сбродов М.В. 2025-03-03
								ДостиглиПослеПревышения = Истина; 
								//Сбродов М.В. 2025-03-03     
							КонецЕсли;
						КонецЕсли;
						
						//Сбродов М.В. Добавил Код
						ФОТНалогиСумма = СуммаДоПревышения + СуммаПослеПревышения; 
						
						//ФОТНалогиСумма = ФОТНалогиСумма - ((ИзменениеОклада_ДельтаМеждуОкладами / ДоходЗаМесяц) * ФОТНалогиСумма);		
						//Всегда 0 
						 
						 //Сбродов М.В. 2025-03-03
						ВременнаяПеременная_ИзменениеОклада_ДельтаМеждуОкладами =0;
						ВременнаяПеременная_ИзменениеОклада_НовыйОкладВторойЭтап = 0;    
						//Сбродов М.В. 2025-03-03
						Если ПризнакИзмененияОклада И Сч >= СчМесяцПервыйЭтап Тогда
							ВременнаяПеременная_ИзменениеОклада_ДельтаМеждуОкладами = ИзменениеОклада_ДельтаМеждуОкладами;
						КонецЕсли;
						Если ПризнакВторогоЭтапа И Сч >= СчМесяцВторойЭтап Тогда
							ВременнаяПеременная_ИзменениеОклада_НовыйОкладВторойЭтап = СотрИзм.ИзменениеОклада_НовыйОкладВторойЭтап-ИзменениеОклада_ОкладТекущий;//ИзменениеОклада_НовыйОкладВторойЭтап;   
							ВременнаяПеременная_ИзменениеОклада_ДельтаМеждуОкладами = 0;	
						КонецЕсли;
						
						
						ПропорцияПревышенияБазы = Окр((ВременнаяПеременная_ИзменениеОклада_ДельтаМеждуОкладами + ВременнаяПеременная_ИзменениеОклада_НовыйОкладВторойЭтап) / ДоходЗаМесяц,6);
        	                       
						                       
						ФОТНалогиСумма_ИзменениеОклада = Окр(ФОТНалогиСумма,3)*ПропорцияПревышенияБазы;   
						
						//Сбродов М.В. 2025-03-03
						РазницаМеждуНалогами = ФОТНалогиСумма-ФОТНалогиСумма_ИзменениеОклада;
						//Сбродов М.В. 2025-03-03
						
						//Если РазницаМеждуНалогами<>0 Тогда
							УстановитьЗначениеПоказателя(
							ИзменениеОкладов_СуммаРуб,   
							(РазницаМеждуНалогами / КолВоРегионов) * ПроцентПоБизнесЛинииОКР,
							ПериодОтчета,
							АналитикаПроект,СтатьяЗатраФОТНалоги,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
						//КонецЕсли;
						//--
						
						//Строка Налоги с ФОТ - Изменение оклада ++  
						//Если ФОТНалогиСумма_ИзменениеОклада<>0 Тогда
							УстановитьЗначениеПоказателя(
							ИзменениеОкладов_СуммаРуб,   
							(ФОТНалогиСумма_ИзменениеОклада/КолВоРегионов) * ПроцентПоБизнесЛинииОКР,
							ПериодОтчета,
							АналитикаПроект,СтатьяЗатраФОТНалоги,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
						//КонецЕсли;
						//-- 
						//Сбродов М.В. Добавил Код
						
						////Сбродов М.В. Убрал старый код
						
						
												
												
						Если ПризнакМотивации Тогда   
							УстановитьЗначениеПоказателя(
							ИзменениеОкладов_СуммаРуб, 
							Окр((СреднемесячнаяПремия / КолВоРегионов) * ПроцентПоБизнесЛинииОКР,5,РежимОкругления.Окр15как20),
							ПериодОтчета,
							АналитикаПроект,СтатьяЗатратМотивация,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);			
						КонецЕсли;	
						//--
						
						Сч = Сч + 1;
					КонецЦикла;
				КонецЕсли;
				//--
				
				ПроцентПоБизнесЛинииОКР = Окр(ПроцентПоБизнесЛинии,5,РежимОкругления.Окр15как20);
				
				Если ПризнакРасчетаТрансферт Тогда    			
					ПроцентПоБизнесЛинииОКР = 0.26; 
					
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_Трансферт,   
					"РТСТ",
					Январь2025,
					АналитикаПроект,СтатьяЗатраФОТНалоги,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);  
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_ПроектТрансферт,   
					"Перевод РТС",
					Январь2025,
					АналитикаПроект,СтатьяЗатраФОТНалоги,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион); 
					
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_Трансферт,   
					"РТСТ",
					Январь2025,
					АналитикаПроект,СтатьяЗатраФОТНалоги,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_ПроектТрансферт,   
					"Перевод РТС",
					Январь2025,
					АналитикаПроект,СтатьяЗатраФОТНалоги,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион); 
					
					/// 
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_СтатусШЕ,   
					"УТШЕ",
					Январь2025,
					АналитикаПроект,СтатьяЗатраФОТНалоги,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);   
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_СтатусШЕ,   
					"УТШЕ",
					Январь2025,
					АналитикаПроект,СтатьяЗатраФОТНалоги,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион); 

					УстановитьЗначениеПоказателя(
					ПоказательОтчета_СтатусШЕ,   
					"УТШЕ",
					Январь2025,
					АналитикаПроект,СтатьяЗатрат,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_СтатусШЕ,   
					"УТШЕ",
					Январь2025,
					АналитикаПроект,СтатьяЗатрат,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);

					
					////
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_Трансферт,   
					"РТСТ",
					Январь2025,
					АналитикаПроект,СтатьяЗатрат,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион); 
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_ПроектТрансферт,   
					"Перевод РТС",
					Январь2025,
					АналитикаПроект,СтатьяЗатрат,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
					
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_Трансферт,   
					"РТСТ",
					Январь2025,
					АналитикаПроект,СтатьяЗатрат,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
					
					УстановитьЗначениеПоказателя(
					ПоказательОтчета_ПроектТрансферт,   
					"Перевод РТС",
					Январь2025,
					АналитикаПроект,СтатьяЗатрат,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
					
					//УстановитьЗначениеПоказателя(
					//ПоказательОтчета_ПроектТрансферт,   
					//"Перевод РТС",
					//Январь2025,
					//АналитикаПроект,СтатьяЗатрат,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
					//
					//УстановитьЗначениеПоказателя(
					//ИзменениеОкладов_СуммаРуб,   
					//"РТС",
					//ПериодОтчета,
					//АналитикаПроект,СтатьяЗатрат,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);   
					
				КонецЕсли;  
				
				УстановитьЗначениеПоказателя(
				ИзменениеОкладов_СоотношениПоПроектам,   
				ПроцентПоБизнесЛинииОКР,
				Январь2025,
				АналитикаПроект,СтатьяЗатрат,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);  
				
				//ФОТ-Налоги ++
				УстановитьЗначениеПоказателя(
				ИзменениеОкладов_СоотношениПоПроектам,   
				ПроцентПоБизнесЛинииОКР,
				Январь2025,
				АналитикаПроект,СтатьяЗатраФОТНалоги,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);
				//--    
				
				//Мотивация ++
				Если ПризнакМотивации Тогда   
					УстановитьЗначениеПоказателя(
					ИзменениеОкладов_СоотношениПоПроектам,   
					ПроцентПоБизнесЛинииОКР,
					Январь2025,
					АналитикаПроект,СтатьяЗатратМотивация,СтатьяДоходовРасходов,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);			
				КонецЕсли;
											
				//ДМС ++  
				Если ПризнакДМС Тогда    
					УстановитьЗначениеПоказателя(
					ИзменениеОкладов_СоотношениПоПроектам,   
					ПроцентПоБизнесЛинииОКР,
					Январь2025,
					АналитикаПроект,СтатьяЗатратДМС,СтатьяДиРПрочееКадры,НазначениеПлатежаДМС,АналитикаСотрудник,АналитикаРегион);			
				КонецЕсли;
				//--

					
				//--
				Если ПризнакИзмененияОклада И ПризнакВыводаПроцентыБЛ Тогда
					УстановитьЗначениеПоказателя(
					ИзменениеОкладов_СоотношениПоПроектам,   
					ПроцентПоБизнесЛинииОКР,
					Январь2025,
					АналитикаПроект,СтатьяЗатрат,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);  
					
					//ФОТ-Налоги ++
					УстановитьЗначениеПоказателя(
					ИзменениеОкладов_СоотношениПоПроектам,   
					ПроцентПоБизнесЛинииОКР,
					Январь2025,
					АналитикаПроект,СтатьяЗатраФОТНалоги,ИзменениеОклада,АналитикаНазначениеПлатежа,АналитикаСотрудник,АналитикаРегион);  
					//--
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Проверка(Команда)
	ПроверкаНаСервере();
КонецПроцедуры     

&НаСервере
Процедура УстановитьЗначениеПоказателя(Показатель = Неопределено,
	ЗначениеПоказателя = Неопределено,
	ПериодОтчета = Неопределено,
	Аналитика1 = Неопределено, Аналитика2 = Неопределено, Аналитика3 = Неопределено, Аналитика4 = Неопределено, Аналитика5 = Неопределено,Аналитика6 = Неопределено)
	//Процедура пустышка, чтобы при отладке конфигуратор не ругался на отстуствие процедуры  УстановитьЗначениеПоказателя
КонецПроцедуры // УстановитьЗначениеПоказателя()

