
&ИзменениеИКонтроль("ПолучитьПоказателиТекущейСтроки")
Функция Расш1_ПолучитьПоказателиТекущейСтроки(СписокОбластейПоказателей, тОбъектАБ, ВидОтчета, СтруктураРасшифровки)


	ТзСвойстваПоказателей = ПолучитьИзВременногоХранилища(тОбъектАБ.ТзСвойстваПоказателейАдрес);
	//ПоказателиТекущегоОтчета = ТзСвойстваПоказателей.Выгрузить(Новый Структура("ВидОтчета",ВидОтчета),"По")

	ПоказателиСтроки = Новый ТаблицаЗначений;
	ПоказателиСтроки.Колонки.Добавить("ПоказательОтчета");
	ПоказателиСтроки.Колонки.Добавить("УидГруппыОтборов");

	Для Каждого СтрПоказатель Из СписокОбластейПоказателей Цикл

		НстрПоказатель = ПоказателиСтроки.Добавить();
		НстрПоказатель.ПоказательОтчета = СтрПоказатель.Значение;
		НстрПоказатель.УидГруппыОтборов = СтрПоказатель.Представление;	
	КонецЦикла;	

	ПоказателиСтроки.Свернуть("ПоказательОтчета,УидГруппыОтборов");
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого ПоказательУид Из ПоказателиСтроки Цикл
		текущаяГруппа = тОбъектАБ.РасшифровкаГруппОтборов.НайтиСтроки(Новый Структура("УидГруппыОтборов",ПоказательУид.УидГруппыОтборов));
		Для Каждого СтрОтборГруппы Из текущаяГруппа Цикл
			Если СтрОтборГруппы.ПолеКод = "Организация" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ОрганизацияОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;	
			Если СтрОтборГруппы.ПолеКод = "Сценарий" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.СценарийОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;
			Если СтрОтборГруппы.ПолеКод = "ПериодС" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ПериодНачалаОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;
			Если СтрОтборГруппы.ПолеКод = "ПериодПо" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ПериодОкончанияОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;
			Если СтрОтборГруппы.ПолеКод = "Проект" И НЕ СтрОтборГруппы.Отбор = Перечисления.ВидыСравненияПоказателейОтчетов.ПроектОтчета Тогда
				МассивУдаляемыхСтрок.Добавить(ПоказательУид);
				Продолжить;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;	
    #Удаление
	Для Каждого СтрУдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
		ПоказателиСтроки.Удалить(СтрУдаляемаяСтрока);
	КонецЦикла;	
    #КонецУдаления
	#Вставка   
	ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивУдаляемыхСтрок);
	//Для Каждого СтрУдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл     
	//	СтруктураОтбора = Новый Структура("ПоказательОтчета,УидГруппыОтборов",СтрУдаляемаяСтрока.ПоказательОтчета,СтрУдаляемаяСтрока.УидГруппыОтборов); 
	//	НайденныеСтроки = ПоказателиСтроки.НайтиСтроки(СтруктураОтбора); 
	//	Если НайденныеСтроки.Количество() > 0 Тогда
	//		ПоказателиСтроки.Удалить(СтрУдаляемаяСтрока);   			
	//	КонецЕсли;
	//КонецЦикла;	
	#КонецВставки
	РесурыПериодыВСтроках = Новый ТаблицаЗначений;
	РесурыПериодыВСтроках.Колонки.Добавить("ИмяВЗапросе");
	РесурыПериодыВСтроках.Колонки.Добавить("ПоказательОтчета");
	РесурыПериодыВСтроках.Колонки.Добавить("ТипЗначенияПоказателя");
	РесурыПериодыВСтроках.Колонки.Добавить("ЗначениеВалюта");
	РесурыПериодыВСтроках.Колонки.Добавить("ПересчитыватьВалютнуюСумму");

	ИндексПоказателя = 1;

	Для Каждого ТекПоказатель ИЗ  ПоказателиСтроки Цикл

		СвойствоПоказателя = ТзСвойстваПоказателей.НайтиСтроки(Новый Структура("Ссылка,ВидОтчета",ТекПоказатель.ПоказательОтчета,ВидОтчета));

		Если  СвойствоПоказателя.Количество()=1  Тогда
			НстрРесурс = РесурыПериодыВСтроках.Добавить();
			НстрРесурс.ИмяВЗапросе = "Значение"+ИндексПоказателя;
			НстрРесурс.ПоказательОтчета = ТекПоказатель.ПоказательОтчета;
			НстрРесурс.ТипЗначенияПоказателя = СвойствоПоказателя[0].ТипЗначения;

			НстрРесурс = РесурыПериодыВСтроках.Добавить();
			НстрРесурс.ИмяВЗапросе = "ЗначениеВалюта"+ИндексПоказателя;
			НстрРесурс.ПоказательОтчета = ТекПоказатель.ПоказательОтчета;
			НстрРесурс.ТипЗначенияПоказателя = СвойствоПоказателя[0].ТипЗначения;
			НстрРесурс.ЗначениеВалюта = Истина;
			НстрРесурс.ПересчитыватьВалютнуюСумму = СвойствоПоказателя[0].Валютный;  
			ИндексПоказателя = ИндексПоказателя+1;


		КонецЕсли;	

	КонецЦикла;	

	Если РесурыПериодыВСтроках.Количество() >0 Тогда
		СтруктураРасшифровки.Вставить("АдресРесурсыПериодыВСтроках",ПоместитьВоВременноеХранилище(РесурыПериодыВСтроках,Новый УникальныйИдентификатор));
		СтруктураРасшифровки.Вставить("Ссылка",ПоказателиСтроки[0].ПоказательОтчета);
		СтруктураРасшифровки.Вставить("Уид",ПоказателиСтроки[0].УидГруппыОтборов);

	КонецЕсли;

КонецФункции
