

#Область ОписаниеПеременных
 
#КонецОбласти
 
#Область ОбработчикиСобытийФормы
#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти
 
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
    ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим) ;
    ДиалогВыбораКаталога.Заголовок = "Выберите папку";
    Если НЕ ДиалогВыбораКаталога.Выбрать() Тогда
        Сообщить("Каталог НЕ ВЫБРАН",СтатусСообщения.Внимание);
    Иначе    
        Каталог=ДиалогВыбораКаталога.Каталог;
    КонецЕсли  
КонецПроцедуры 
&НаКлиенте
Процедура Сохранить(Команда)   
	Если ПроверитьЗаполнение() Тогда
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("Каталог", Каталог);
		Закрыть(ПараметрыЗакрытия);  
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберете каталог для сохранения файлов. Пока не выберете каталог, сохранить файлы не получится.");
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти