
&ИзменениеИКонтроль("НастроитьВариантыОтчетов")
Процедура Расш1_НастроитьВариантыОтчетов(Настройки)

	ПанелиОтчетовБП.Настроить(Настройки);

	ПроверкаКонтрагентовБРО.НастроитьВариантыОтчетов(Настройки);

	УчетЗарплаты.НастроитьВариантыОтчетов(Настройки);

	#Область УХ_МСФО
	Если ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.ОбъектыМСФО") Тогда 
		МодульМСФОУХ = ОбщегоНазначения.ОбщийМодуль("МСФОУХ");
		МодульМСФОУХ.НастроитьВариантыОтчетов(Настройки);
	КонецЕсли;
	#КонецОбласти

	#Область УХ_Встраивание

	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда // не БМ, НМ
		МодульВарианты = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетовУХПереопределяемый");
		МодульВарианты.НастроитьВариантыОтчетов(Настройки);
	КонецЕсли;

	// ОПК
	Если ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.ПланированиеИКонтрольСлужебный") Тогда 
		МодульВарианты = ОбщегоНазначения.ОбщийМодуль("ОперативноеПланированиеКонтроль");
		МодульВарианты.НастроитьВариантыОтчетов(Настройки);
	КонецЕсли;
	// Конец ОПК

	#КонецОбласти

	ИнтеграцияИС.НастроитьВариантыОтчетов(Настройки);
    #Удаление
	#КонецУдаления
	#Вставка     
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки,Метаданные.Отчеты.СводныйОтчетПроверка_v4);  
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки,Метаданные.Отчеты.СводныйОтчетГК_v18);     
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки,Метаданные.Отчеты.СводныйОтчетГК_v19);
	#КонецВставки
КонецПроцедуры
