
&НаСервере
&ИзменениеИКонтроль("УправлениеФормойСервер")
Процедура Расш1_УправлениеФормойСервер()

	//Управление режимом импорт и отображение
	Элементы.ПанельЯчейки.Доступность    													 	= Объект.БланкДляОтображения;
	Элементы.ПолеТабличногоДокументаМакет.ТолькоПросмотр 									 	= НЕ Объект.БланкДляОтображения;	
	Элементы.КМ_ПолеТабличногоДокументаМакетКонтекстноеМенюСопоставитьСАналитикой.Доступность  	= Объект.БланкДляОтображения;
	Элементы.КМ_КомандыДиаграммы.Доступность  													= Объект.БланкДляОтображения;
	Элементы.КМ_РаботаСАналитикой.Доступность  													= Объект.БланкДляОтображения;
	Элементы.КМ_РаботаСПоказателями.Доступность  												= Объект.БланкДляОтображения;

	Элементы.ГруппаВниманиеИмпортНадпись.Видимость                                              = НЕ Объект.БланкДляОтображения;
	Элементы.ИмяЛиста.Видимость                                                             	= НЕ Объект.БланкДляОтображения;	

	Элементы.ГруппаРазработкаОтчетаЧерезМакет.Доступность                                       = Объект.БланкДляОтображения;
	Элементы.ГруппаРаботаСАналитикойМакета.Доступность                                          = Объект.БланкДляОтображения;
	Элементы.ФормаИзменитьОтбор.Доступность                                       				= Объект.БланкДляОтображения;
	Элементы.ФормаВставитьДиаграмму.Доступность                                          		= Объект.БланкДляОтображения;
	Элементы.ГруппаФормулы.Доступность                                          				= Объект.БланкДляОтображения;

	// Управление режимом редактирования формул бланка при нажатии на формулу	
	Элементы.ГруппаТекстВыражения.Видимость 		= РежимРедактированияФормулы;
	Элементы.ТекущаяФормула.Видимость				= НЕ РежимРедактированияФормулы;
	Элементы.ФормаИзменитьОтбор.Доступность			= НЕ РежимРедактированияФормулы;;
	Элементы.ПолеТабличногоДокументаМакет.Защита 	= РежимРедактированияФормулы;      
	#Удаление
	Элементы.ГруппаКомандыРаботыСМакетом.Видимость  = НЕ РежимРедактированияФормулы И НЕ ТолькоПросмотр;
	#КонецУдаления
	#Вставка     
	Если РольДоступна("ЭкспортБланков") Тогда
		Элементы.ГруппаКомандыРаботыСМакетом.Видимость  = НЕ РежимРедактированияФормулы;
	Иначе 
		Элементы.ГруппаКомандыРаботыСМакетом.Видимость  = НЕ РежимРедактированияФормулы И НЕ ТолькоПросмотр;
	КонецЕсли;
	#КонецВставки
	Элементы.ФормаГруппаГенерацияМакета.Видимость	= НЕ ТолькоПросмотр;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("БланкЭкспортироватьНаСервере")
Функция Расш1_БланкЭкспортироватьНаСервере()
	
	#Удаление
	Записать();
	#КонецУдаления
	#Вставка      
	Если НЕ РольДоступна("ЭкспортБланков") Тогда
		Записать();	
	КонецЕсли;	
	#КонецВставки
	
	ТабличныйДокументКопия = Новый ТабличныйДокумент;
	ТабличныйДокументКопия.Вывести(ПолеТабличногоДокументаМакет);
	Возврат Новый Структура("ВидОтчета,ПравилоОбработки,БланкОтчета,ТаблДок,Режим20", Объект.Владелец, ПравилоОбработки, Объект.Ссылка,ТабличныйДокументКопия,?(Объект.БланкДляОтображения,Ложь,Истина));

КонецФункции
