
#Область ПрограммныйИнтерфейс
#Область ДляВызоваИзДругихПодсистем

#КонецОбласти
#КонецОбласти

#Область Инициализация
#КонецОбласти      

#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("НачПер");
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки); 
	Если ПараметрСКД.Значение = Дата(1,1,1) Тогда
		ПараметрСКД.Значение = НачалоГода(ТекущаяДата());
	КонецЕсли;
	ПараметрСКД.Использование = Истина;     
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("КонПер");
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	Если ПараметрСКД.Значение = Дата(1,1,1) Тогда
		ПараметрСКД.Значение = КонецГода(ТекущаяДата());
	КонецЕсли;
	ПараметрСКД.Использование = Истина;  
КонецПроцедуры
#КонецОбласти 
#Область СлужебныеПроцедурыИФункции
#КонецОбласти